[
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Music",
        "description": "The Department of Music offers a degree program leading to the bachelor of arts in music as well as a minor in music. A minor in musical theatre is available in conjunction with the Department of Theatre and Dance. The Department of Music&aposs curriculum is designed to provide students of diverse backgrounds with the skills necessary to comprehend, perform, and appreciate music&aposs role in human history and its power to enhance the lives of all people. Because individual study and performance is essential to the expression and acquisition of music as a language and art form, private instruction and membership in all departmental music ensembles is available to all Santa Clara students.",
        "programs": [
            {
                "title": "Music Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements, students majoring in music must complete the department&aposs lower and upper-division requirements.\nLower-Division Core\nMUSC 1, 2, 3\nMUSC 1A, 2A, 3A\nTwo courses from Introduction to Listening series: MUSC 7, 8, 9, 10\nMinimum of three units of private instruction\nMinimum of six units in an approved departmental ensemble\nMusic at Noon: All majors and minors must complete one quarter of MUSC 16/116\nUpper-Division\nFive upper-division electives\nOne Ethnomusicology/Music History upper-division elective from: MUSC 130,131, 132, 133, 134, 136, 139, 189, 190, 192, 194, 195, 196\nThree units of private (applied) instruction\nSix units in an approved departmental ensemble\nAt least one course (lower or upper division) must be an Electronic Music course: MUSC 9, 57/157, 115, 119\n"
            },
            {
                "title": "Music Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in music:\nMusic Skills/Literacy courses\nTwo Music Theory courses\nTwo Musicianship courses\nTwo courses from Introduction to Listening series: MUSC 7, 8, 9, 10\nOne course selected from MUSC 3, 3A, or any upper-division elective\nOne Ethnomusicology/Music History upper-division elective from: MUSC 130, 131, 132, 133, 134, 136, 139, 189, 190, 192, 194, 195, 196\nTwo units of private (applied)instruction\nMusic at Noon: One quarter of MUSC 16/116\nSix units in an approved departmental ensemble\nAt least one course (lower or upper division) must be an Electronic Music course: MUSC 9, 57/157, 115, 119\nNote: Students may take a Theory Placement Exam to test into a course that is appropriate for their skill level, but must still complete two courses from both the Theory and Musicianship sequences.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Anthropology",
        "description": "The Department of Anthropology offers a degree program leading to the bachelor of science in anthropology. A solid undergraduate foundation in anthropology secures the analytical skills needed to undertake professional degrees in anthropology, business, law, public health, social services, or provides a foundation for embarking on a number of other professional careers. The department also offers a minor, several emphases, and an honors thesis option.",
        "programs": [
            {
                "title": "Anthropology Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling the Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in anthropology must complete the following departmental requirements:\nANTH 1, 2, 3\nSOCI 1\nANTH 50 or ENVS 50 or POLI 50\nANTH 110, 112, 114, 198\nFive upper-division courses selected from the following four categories: biological (ANTH 130--139), archaeological (ANTH 140--149), cultural (ANTH 150--179), or regional (ANTH 180--189). At least three of the four categories must be represented in the student&aposs selection.\nAn introductory statistics course\nSix anthropology seminars\n"
            },
            {
                "title": "Anthropology Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in anthropology:\nANTH 1 or 2\nANTH 3\nOne additional lower-division anthropology course\nANTH 110\nTwo approved upper-division anthropology courses\nFour anthropology seminars\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Ethnic Studies",
        "description": "The department offers students the option to complete a major in ethnic studies (bachelor of science) or a minor in ethnic studies. Students who declared a companion major in ethnic studies prior to spring 2016 will be able to complete the companion major or switch to a stand alone major if they choose. The major provides students with advanced and concentrated training in racial and ethnic studies with coursework clustered in the upper division around six themes: Community Engagement and Social Movements; Race, Law, Politics, and Policy; Intersectionality and Hybridity; Inequality and Education; Immigration, Transnationalism, and Globalization; and Social and Cultural Analysis. Both the stand alone major and minor enhance a student&aposs employment opportunities in business, community service work, education, law, medicine, social work, politics, and government. For those considering graduate school, the majors provide a foundation for graduate studies particularly for those who seek to become university professors and researchers with a specialization in a variety of issues and policies impacting U.S. racial and ethnic communities.",
        "programs": [
            {
                "title": "Ethnic Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum, students pursuing the major in ethnic studies must complete the following requirements:\nETHN 5\nTwo courses from ETHN 10, 20, 30, 40, 80\nOne of the following breadth electives: ANTH 86, 90; DANC 62; ENGL 35, 35G, 36, 37, 38, 39, 69; ETHN 11, 12, 21, 22, 35, 36, 41, 50, 51, 55, 65, 69, 70, 75, 95, 96; MUSC 20; RSOC 91; THTR 14, 65\nSix upper-division courses selected from at least four of the following six categories:  Community Engagement and Social Movements (ETHN 112, 122, 123, 125,132, 133, 142, 149, 160, 163, 166, 171)  Race, Law, Politics and Policy (ETHN 120, 126, 127, 149, 153, 155, 178, 185)  Intersectionality and Hybridity (ETHN 121, 129, 141, 151, 152, 154, 157, 163, 167)  Inequality and Education (ETHN 150, 157, 161, 167)  Immigration, Transnationalism, and Globalization (ETHN 112, 120, 126, 127, 170, 171, 172, 178)  Social and Cultural Analysis (ETHN 124, 128, 130, 132, 135, 136, 141, 144, 145, 160, 162, 164, 166, 172)\nCommunity Engagement and Social Movements (ETHN 112, 122, 123, 125,132, 133, 142, 149, 160, 163, 166, 171)\nRace, Law, Politics and Policy (ETHN 120, 126, 127, 149, 153, 155, 178, 185)\nIntersectionality and Hybridity (ETHN 121, 129, 141, 151, 152, 154, 157, 163, 167)\nInequality and Education (ETHN 150, 157, 161, 167)\nImmigration, Transnationalism, and Globalization (ETHN 112, 120, 126, 127, 170, 171, 172, 178)\nSocial and Cultural Analysis (ETHN 124, 128, 130, 132, 135, 136, 141, 144, 145, 160, 162, 164, 166, 172)\nNote: No class can be used to fulfill more than one category.\nAn upper-division elective that may be completed within ethnic studies or from any other department or program\nAn upper-division seminar in theory and methods (ETHN 165 or 195)\nA capstone project fulfilled through one of two options: (1) completion of ETHN 198, or (2) a research project completed in an upper-division ethnic studies seminar. In the first option, students will complete an applied research project through ETHN 198 that typically encompasses a community internship along with a weekly essay and final paper. In the second option, students will complete a research project that typically entails intensive reading and writing and the execution of a research design or some equivalent project. The capstone provides opportunities for students to apply their understanding of methodology and specific methods to a project explicitly centered around critical racial and ethnic studies.\n"
            },
            {
                "title": "Ethnic Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in ethnic studies:\nETHN 5\nTwo courses from ETHN 10, 20, 30, 40, 80\nThree upper-division courses in ethnic studies\nETHN 198 or 199 or any other upper-division ethnic studies course. (Note: The capstone project is optional for students completing the minor.)\nDepartmental Courses Applicable to the Minor\nNote: For course descriptions, see the listings of the relevant departments. Students should consult with the Ethnic Studies Department Chair to determine the applicability of courses taken at other institutions or in study abroad programs.\nANTH 86, 90, 146\nARTH 141\nCHST 106\nCOMM 107, 121\nDANC 62/162\nENGL 35, 36, 37, 38, 39, 69, 130, 134, 139, 140, 155, 158, 166\nHIST 153, 178, 180, 185\nMUSC 20, 132\nSPAN 133\nPOLI 153, 195\nPSYC 189\nRSOC 91, 139, 164, 184\nSOCI 132, 153, 175, 150, 180\nTHTR 14, 65, 161, 189\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Neuroscience",
        "description": "Neuroscience examines the bidirectional relationship between the nervous system and behavior from the perspective of a variety of disciplines including biology, psychology, chemistry, computer science, philosophy, and engineering. The neuroscience curriculum at Santa Clara is structured so that students learn to analyze the complexities of human and non-human behavior using multiple approaches. Students learn how individual neurons produce and process electrochemical signals required for cellular communication (cellular and molecular neuroscience). Students study neural circuits that process sensory information from the environment and produce motor behavior and other adaptive output (systems neuroscience). Students study thought, emotion, and behavior by looking at the structure and function of brains in normal and diseased states (behavioral and cognitive neuroscience). Majoring in neuroscience prepares students for graduate work and careers in a variety of fields that seek to better understand and impact the nervous system, cognition, and mental health.",
        "programs": [
            {
                "title": "Neuroscience Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling the Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in neuroscience must complete the following requirements:\nNEUR 1, 10, 150, 190\nBIOL 21, 24, 25 (or 1A, 1B, 1C), 122, 160\nCHEM 11, 12, 13, 31, 32\nMATH 11 or 35 (35 recommended)\nMATH 12 or 36 or CSCI 10\nPHIL 32 (recommended)\nPSYC 1, 165, 169\nOne from BIOL 110, 120, 123, 165, 174, 175\nOne from PSYC 130, 138, 166, 167, 196\nOne additional course from: BIOL 110, 119, 120, 123, 124, 165, 171, 174, 175; CHEM 141\nOne additional course from: COMM 100A, 176A; PHIL 113, 117, 153, 158, 160, 161; PSYC 166, 167, 196\nRecommended Pre-Health courses: PHYS 11, 12, 13 or PHYS 31, 32, 33 and CHEM 33, 141\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Art and Art History",
        "description": "Studio art majors develop comprehensive skills that help prepare them for graduate study or careers in either the fine or commercial arts. Faculty members emphasize the development of conceptual and technical competence, as well as critical analysis of the student&aposs own work and that of others. By graduation, every studio art major develops a body of original artwork to be exhibited in a senior show for display in the department gallery space. Students are required to articulate an artist&aposs statement reflecting their own engagement with the creative process, in conjunction with their senior show. Studio art majors enjoy opportunities to present their artwork in regional conferences as well as in student-organized exhibitions on and off campus. At the end of each academic year, students are encouraged to submit their work to the Annual Student Art Exhibit, which is judged by an outside professional in the field of art. The department also oversees merit-based scholarships, which are awarded to outstanding studio art majors with junior status.",
        "programs": [
            {
                "title": "Art History Major",
                "type": "Undergraduate Major",
                "requirements": "Students must complete 15 courses (13 ARTH and 2 ARTS):\nFour courses from ARTH 11A, 12A, 21--27\nTwo lower- or upper-division ARTS courses\nARTH 100 (preferably at the end of sophomore year)\nFive upper-division ARTH courses\nTwo additional lower- or upper-division ARTH courses\nARTH 196 (senior year)\nNote: Of the courses labeled ARTH, at least two must be taken from courses numbered 21--22 or 101--139 (pre-modern era). Of the five required upper-division ARTH, one must be from 101--139, one must be from 141, 142, 146, or 150--179 (global area), and one must be 106 or 120 (advanced writing in the discipline). Only 4 units of ARTH 98/198 may count toward the major. Studio art or art history courses taken during a term of study abroad may be applied to no more than half of the requirements for a major in art history. No more than three courses may be taken abroad to fulfill the five upper-division ARTH course requirement.\n"
            },
            {
                "title": "Studio Art Major",
                "type": "Undergraduate Major",
                "requirements": "Students must complete 17 courses (13 ARTS and 4 ARTH):\nFour foundation ARTS courses (recommended for first- or second-year students; transfer students should meet with the department chair for individualized advising):  ARTS 30  ARTS 74  One two-dimensional foundation course from ARTS 32 or 72  One three-dimensional foundation course from ARTS 33, 63, or 64\nARTS 30\nARTS 74\nOne two-dimensional foundation course from ARTS 32 or 72\nOne three-dimensional foundation course from ARTS 33, 63, or 64\nSix additional ARTS courses (excluding ARTS 194 or ARTS 198), three of which must be upper division\nFour ARTH courses:  One lower-division ARTH course from: ARTH 11A or ARTH 12A (but not both), ARTH 21, ARTH 22, ARTH 23 (preferred), (recommended for first- or second-year students)  ARTH Global (upper or lower division)  ARTH 185  ARTH 106 or 120 (satisfies advanced writing and fulfils pre-modern breadth requirement)\nOne lower-division ARTH course from: ARTH 11A or ARTH 12A (but not both), ARTH 21, ARTH 22, ARTH 23 (preferred), (recommended for first- or second-year students)\nARTH Global (upper or lower division)\nARTH 185\nARTH 106 or 120 (satisfies advanced writing and fulfils pre-modern breadth requirement)\nARTS 100 (recommended in junior year)\nARTS 190 (must be taken fall of senior year)\nARTS 196 (senior year, winter and spring quarters; two-quarter class with grades assigned at end of spring quarter)\nNote: Studio art or art history courses taken during a term of study abroad may be applied to no more than half of the requirements for a major in studio art. Only one ARTH course may be taken abroad to fulfill the requirements for a major in studio art. Students who wish to receive credit toward a major or minor for studio art courses taken at affiliated study abroad programs must be able to document their work for review by members of the department&aposs faculty.\n"
            },
            {
                "title": "Art History Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete 7 courses (6 ARTH and 1 ARTS):\nTwo courses from ARTH 11A, 12A, 21--27\nOne studio ARTS course\nThree upper-division ARTH courses\nOne additional lower- or upper-division ARTH course\nNote: Only 4 units of ARTH 98/198 may count toward the minor. Studio art or art history courses taken during a term of study abroad may be applied to no more than half of the requirements for a minor in art history. Only one upper-division course may be taken abroad to fulfill the three upper-division ARTH course requirement.\n"
            },
            {
                "title": "Studio Art Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete 7 courses (6 ARTS and 1 ARTH):\nOne two-dimensional course from ARTS 30--72 (or approved upper-division equivalent)\nOne three-dimensional course from ARTS 33, 63, or 64 (or approved upper-division equivalent)\nFour additional ARTS courses (upper-division preferred, excluding ARTS 194)\nOne lower- or upper-division ARTH course (excluding ARTH 11A or 12A)\nNote: Study abroad courses in art history are not accepted for the minor in studio art. Approved studio art study abroad courses may be applied to no more than half of the requirements for a minor in studio art.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Classics",
        "description": "Students majoring or minoring in classics may pursue one of three different tracks: classical languages and literatures, classical studies, or ancient studies. Students who want to major and minor in classics must do so in different tracks.",
        "programs": [
            {
                "title": "Classics Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of arts degree, students majoring in classics must complete the departmental requirements for the track desired:\nBachelor of Arts in Classics\nClassical Languages and Literatures Track\nNine upper-division courses in the language of concentration\nFirst-year proficiency in both classical languages\nCLAS 197A and CLAS 197B\nClassical Studies Track\nSix classes in either Latin or Greek, which may include the elementary sequence (but not both sequences)\nSix classics courses, at least four of which must be upper-division\nCLAS 197A and CLAS 197B\nAncient Studies Track\nCLAS 60 or CLAS 61\nEleven classics courses, at least seven of which must be upper-division\nCLAS 197A and CLAS 197B\n"
            },
            {
                "title": "Classics Minor",
                "type": "Undergraduate Minor",
                "requirements": "Classical Languages and Literatures Track\nCompletion of five upper-division courses in either Latin or Greek (Latin 3 or Greek 3 can be counted as an upper-division course for these purposes)\nClassical Studies Track\nLatin 3 or Greek 3, or one upper-division Greek or Latin course\nFour classics courses, at least two of which must be upper-division\nAncient Studies Track\nCLAS 60 or CLAS 61\nFour classics courses, at least two of which must be upper-division\nApproved Courses towards Major and Minor in Classics\nApproved classics courses include all classes (including cross-listed courses) with a CLAS prefix, as well as courses in other departments such as ARTH 104, 106, 110; ARTH 152 may also count for the Ancient Studies Track; PHIL 14, 141; POLI 111. Other courses in the ancient worlds may count as well---consult with the Department Chair of Classics before enrolling. With the approval of the chair, a classical language class may be substituted for a non-language course.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Sociology",
        "description": "The Department of Sociology offers a degree leading to a bachelor of science in sociology. A solid undergraduate foundation in sociology secures the analytical skills needed to undertake professional degree programs in sociology, business, law, and social services or to embark on a number of careers from management to research. A minor in sociology is available. Honors thesis options also are offered to qualified majors.",
        "programs": [
            {
                "title": "Sociology Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in sociology must complete the following departmental requirements:\nSOCI 1\nANTH 3\nSOCI 33, 35, 118, 119, 120, 198\nSOCI 121 or 122\nFive upper-division sociology electives (excluding SOCI 194)\nOne upper-division elective from outside the Department of Sociology to be selected from an approved list; the list is available in the departmental office\n"
            },
            {
                "title": "Sociology Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in sociology:\nSOCI 1, 33, 35, 117\nThree other approved upper-division sociology courses excluding SOCI 118, 119, 120, 121, 122, 194, 195, 198, and 199\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Mathematics and Computer Science",
        "description": "The Department of Mathematics and Computer Science maintains a program for the discovery, encouragement, and development of talent in mathematics or computer science among undergraduates. This program includes special sections, seminars, individual conferences, and directed study guided by selected faculty members. Students are also encouraged to participate actively in research projects directed by faculty.",
        "programs": [
            {
                "title": "Mathematics Major",
                "type": "Undergraduate Major",
                "requirements": "CSCI 10 (or demonstrated equivalent proficiency in computer programming)\nMATH 11, 12, 13, 14, 23, 51, 52, and 53\nPHYS 31 and 32. Students with a special interest in the application of mathematics in the social sciences or economics may substitute ECON 170 or 173 for PHYS 32. Students planning to teach in secondary schools may substitute, with approval of the department chair, PHYS 11 and 12 for PHYS 31 and 32.\nSeven approved 5-unit upper-division courses in mathematics or computer science, which must include at least one course in analysis (MATH 102, 105, or 153), at least one course in algebra (MATH 103 or 111), and at least one course selected from geometry (MATH 101, 113, or 174), or from discrete mathematics (MATH 176 or 177), or from applied mathematics (MATH 122, 125, 144, 155, 165, or 166)\nStudents planning to undertake graduate studies in pure mathematics should plan to take MATH 105, 111, 112, 113, 153, and 154. Students planning to undertake graduate studies in applied mathematics should complete the emphasis in applied mathematics and take MATH 105, 144, 153, 154, and 155.\n"
            },
            {
                "title": "Computer Science (Mathematics) Major",
                "type": "Undergraduate Major",
                "requirements": "MATH 11, 12, 13, 14, 51, 53\nCSCI 10, 60, 61\nOne of ANTH 1, PHYS 31, CHEM 11, or ENVS 21\nCOEN 20 and 20L, COEN (or ELEN) 21 and 21L\nMATH 122, CSCI 161, CSCI 163A, and COEN 177 and 177L\nFive additional 4- or 5-unit upper-division courses in one of the following emphases:\n"
            },
            {
                "title": "Mathematics Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in mathematics:\nMATH 11, 12, 13, 14, and either 52 or 53\nThree approved 5-unit upper-division mathematics courses with no more than one course selected from MATH 165 and 166. In place of MATH 165 or 166, a student may select an upper-division computer science course. MATH 100, 192, and CSCI 192 do not count toward the minor.\n"
            },
            {
                "title": "Computer Science Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in computer science:\nCSCI 10, 60, and 61\nMATH 51\nCOEN 20 and 20L\nA total of three 4 or 5-unit upper-division courses, as follows: Two upper-division CSCI courses and one upper-division CSCI or COEN course. CSCI 192 does not count toward the minor.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Individual Studies",
        "description": "The Individual Studies Program (ISP) major has been established to meet the needs of students who wish to design a course of studies with a multidisciplinary perspective. Students who want to pursue an ISP major should begin by scheduling a meeting with the program director to obtain a list of instructions regarding administrative details.",
        "programs": [
            {
                "title": "Individual Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of arts or bachelor of science degrees, students majoring in ISP must complete the following departmental requirements:\nBe a full-time student at Santa Clara for at least one year\nHave fewer than 111 quarter units of academic work completed at the time of application\nHave a minimum 3.0 grade point average\nSubmit a Petition for Admission to the ISP director for review and approval. The petition should include:\nA clear, logical, and conceptually refined description of the proposed program\nA well-developed argument, supported by appropriate evidence, showing that no existing academic major can meet the student&aposs educational objectives\nA plan of study listing courses, seminars, internships, etc., that meets the student&aposs educational objectives and fulfills the requirements of the Undergraduate Core Curriculum\nIdentifying a faculty advisor or advisors whose areas of expertise overlap with the student&aposs proposed area of study, and who have agreed to serve as the student&aposs academic advisor for the proposed ISP major plan\nBe advised that ISP majors within the College of Arts and Sciences can only be associated with a bachelor of arts (B.A.) degree or a bachelor of science (B.S.) degree in social sciences.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Environmental Studies and Sciences",
        "description": "Each student works with a faculty advisor, who helps integrate the classroom curriculum with the student&aposs plans for future study and/or work in environmental fields.",
        "programs": [
            {
                "title": "Environmental Science Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and College of Arts and Sciences requirements for the bachelor of science degree, students majoring in environmental science must complete the following departmental requirements:\nENVS 21, 22, 23, 101, 122, 198\nBIOL 160/ENVS 110\nENVS 116\nCHEM 11, 12, 13\nMATH 11 or MATH 35\nECON 1\nANTH 50/ENVS 50/POLI 50\nENVS 79 or PHIL 29\nSelect one of the following course series: BIOL 1A, 1B, 1C or CHEM 31, 32 or PHYS 11, 12, 13 (PHYS 31, 32, 33 can be substituted)\nOne course from ANTH 140/ENVS 136, ANTH 154, CENG 124/ENVS 124, COMM 120A, ECON 111, ENVS 120, ENVS 128, ENVS 146, ENVS 147, ENVS 149/POLI 146, ENVS 150, ENVS 155, ENVS 158/PSYC 158, ENVS 167, ETHN 156\nAttend 10 approved Environmental Studies and Sciences environmental colloquia\nEnvironmental science majors shall select a concentration in Applied Ecology or in Water, Energy, and Technology. Alternatively, students may work with their advisors to design an individualized plan of study.\n"
            },
            {
                "title": "Environmental Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and College of Arts and Sciences requirements for the bachelor of science degree, students majoring in environmental studies must complete the following departmental requirements:\nENVS 21, 22, 23, 101, 122, 198\nECON 1\nANTH 50/ENVS 50/POLI 50\nENVS 79 or PHIL 29\nOne course from ANTH 112, BIOL 160/ENVS 110, COMM 110, ECON 41/42, OMIS 40, POLI 101, PSYC 40, SOCI 120\nENVS 116\nOne course from BIOL 151/ENVS 151, BIOL 153/ENVS 153, ENGR 60, ENVS 80, ENVS 145, ENVS 148, ENVS 160, ENVS 165, ENVS 166, ENVS 185\nAttend 10 approved Environmental Studies and Sciences environmental colloquia\nEnvironmental studies majors shall select one of the following concentrations: Green Business; Environmental Policy, Law, and Politics; Sustainable Development; or Environmental Humanities. Alternatively, students may work with their advisors to design an individualized plan of study.\n"
            },
            {
                "title": "Environmental Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in environmental studies:\nENVS 21, 22, 23\nOne course from ANTH 112, ANTH 145/ENVS 137, BIOL 160/ENVS 110, CENG 160, COMM 110, ECON 41/42, ENVS 115, ENVS 116, OMIS 40, POLI 101, PSYC 40, SOCI 120\nOne course from CENG 124/ENVS 124, COMM 120A, ENVS 120, ENVS 122/POLI 157, ENVS 128, ENVS 147, POLI 123\nOne course from ENVS 79, ENVS 152/TESP 152, PHIL 29, RSOC 140, TESP 26\nThree additional courses from the lists above or ANTH 50/ENVS 50/POLI 50, ANTH 140/ENVS 136, ANTH 154, BIOL 150, BIOL 151/ENVS 151, BIOL 153/ENVS 153, BIOL 156/ENVS 156, CENG 119, CENG 139, CENG 140, CENG 143, CENG 161, CENG 163, ECON 101, ECON 111, ENGL 154/ENVS 154, ENGR 60, ENVS 20, ENVS 80, ENVS 95, ENVS 128, ENVS 131, ENVS 132, ENVS 141, ENVS 142, ENVS 143, ENVS 144, ENVS 145, ENVS 146, ENVS 148, ENVS 149/POLI 146, ENVS 151/BIOL 151, ENVS 153/BIOL 153, ENVS 154, ENVS 155, ENVS 160, ENVS 165, ENVS 166, ENVS 167, ENVS 185, ENVS 191, ENVS 195, ENVS 196, ENVS 197, ENVS 199, MGMT 172, MKTG 189, OMIS 108E, PHSC 142\nAttend six approved Environmental Studies and Sciences environmental colloquia or complete ENVS 140\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Psychology",
        "description": "The Department of Psychology offers a degree program leading to the bachelor of science in psychology. Psychology is the study of behavior, emotion, and thought using the scientific method. At the undergraduate level, the study of psychology is part of a liberal arts education. A major in psychology lays the groundwork for various careers and advanced studies, including the pursuit of graduate degrees needed for the professional practice of psychology.",
        "programs": [
            {
                "title": "Psychology Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in psychology must complete the following departmental requirements:\nPSYC 1, 2, 51, 52, and 53\nMATH 6 and 8 or MATH 35 or 11 and 8\nOne biological psychology course from PSYC 165, 166, 167\nOne developmental psychology course from PSYC 172, 185, 196\nOne applied psychology course from PSYC 115, 117, 140, 157\nOne socio-cultural/personality course from PSYC 150, 160, 162\nOne learning/cognition/perception course from PSYC 120, 130, 131, 138\nOne advanced topics course from PSYC 111, 116, 118, 132, 133, 141, 151, 168, 171, 178, 199A\nThree additional approved upper-division psychology courses\nHonors in Psychology\nPsychology majors may be selected for graduation with Honors in Psychology provided they have a grade point average of 3.3 or higher in their psychology courses, complete PSYC 99 and a senior project in a manner approved by the faculty honors committee. Honors students are expected to participate in various department-sponsored events.\nEmphasis in Gerontology\nIn addition to the bachelor of science and departmental requirements, students who wish to study the process of aging should inquire about the gerontology certificate program. For additional information, contact Dr. Patricia Simone, Director of Gerontology, at psimone@scu.edu.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Women's and Gender Studies",
        "description": "The Department of Women&aposs and Gender Studies brings together scholars and scholarship on women and gender, areas that have come to occupy an increasingly important place in a number of disciplines in the last quarter century. Areas of inquiry include the participation of women in social and cultural production; the construction of gender and its role as a constitutive element of social, political, economic, and legal structures; feminist theory; and the development of ideas about femininities, masculinities, and sexualities. Gender is examined as it intersects with class, sexuality, ethnicity, disability, age, nationality, and the like. Women&aposs and Gender Studies provides an integrated, interdisciplinary approach to understanding the social and cultural constructions of gender that shape the experiences of everyone. The curriculum offers a solid foundation in women&aposs and gender studies, facilitating graduate study and careers involving gender justice concerns, and preparing students for leadership roles in diverse workplaces and communities. Women&aposs and Gender Studies offers a major and minor.",
        "programs": [
            {
                "title": "Women's and Gender Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling University Core Curriculum, students with a major in Women&aposs and Gender Studies must complete the following requirements:\nThirteen courses:\nOne Principles of WGST course or sequence:  WGST 1A and 2A  WGST 11A and 12A  WGST 50  WGST 51  WGST 57/HIST 84  WGST 112/ETHN 154  WGST 114/ETHN 157  WGST 115/SOCI 153/ETHN 151\nWGST 1A and 2A\nWGST 11A and 12A\nWGST 50\nWGST 51\nWGST 57/HIST 84\nWGST 112/ETHN 154\nWGST 114/ETHN 157\nWGST 115/SOCI 153/ETHN 151\nFour required upper-division courses:  WGST 101 (Feminist Theory) (advised in the junior year)  WGST 102/COMM 111G (Feminist Methods) (advised in the junior year)  WGST 105 (Advanced Seminar) or WGST 105A (Body Politics)  WGST 190 (Capstone) (senior year)\nWGST 101 (Feminist Theory) (advised in the junior year)\nWGST 102/COMM 111G (Feminist Methods) (advised in the junior year)\nWGST 105 (Advanced Seminar) or WGST 105A (Body Politics)\nWGST 190 (Capstone) (senior year)\nThree-course concentration in one of three areas: Cultural Politics of Representation; Power, Rights, and Society; or Sexualities, Body Politics, and Social Structures\nFive electives\n"
            },
            {
                "title": "Women's and Gender Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in Women&aposs and Gender Studies:\nSix courses, at least three of which must be upper division:\nOne Principles of WGST course or sequence:  WGST 1A and 2A  WGST 11A and 12A  WGST 50  WGST 51  WGST 57/HIST 84  WGST 112/ETHN 154  WGST 114/ETHN 157  WGST 115/SOCI 153/ETHN 151\nWGST 1A and 2A\nWGST 11A and 12A\nWGST 50\nWGST 51\nWGST 57/HIST 84\nWGST 112/ETHN 154\nWGST 114/ETHN 157\nWGST 115/SOCI 153/ETHN 151\nOne of the following:  WGST 101 (Feminist Theory) (advised in the junior year)  WGST 102/COMM 111G (Feminist Methods) (advised in the junior year)\nWGST 101 (Feminist Theory) (advised in the junior year)\nWGST 102/COMM 111G (Feminist Methods) (advised in the junior year)\nAll minors must complete:  WGST 190 (Capstone) (senior year)\nWGST 190 (Capstone) (senior year)\nThree electives\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Political Science",
        "description": "The department offers opportunities to participate in a variety of programs that combine practical field experience and academic credit. It assists students in arranging academic credit for internships. Placements include government agencies, legislative or judicial bodies, political parties, and nongovernment organizations. On the national level, Santa Clara partners with American University&aposs Washington, D.C., program, in which students receive credit for internships and intensive seminars in the nation&aposs Capitol. Santa Clara also participates in the Panetta Institute&aposs Congressional Internship Program, which fully subsidizes students who study and intern with the California Congressional delegation on Capitol Hill. On the international level, the department encourages student participation in the numerous University-operated and approved study abroad programs around the world.",
        "programs": [
            {
                "title": "Political Science Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in political science must complete the following departmental requirements:\nOne course from the following list to satisfy the Core mathematics requirement: MATH 8, 11, or 30 (with MATH 8 preferred)\nPOLI 1; 2 or 3; 25; 30; 40 (ECON 1 or 2 may be substituted for POLI 40); and 99\nSeven upper-division courses in political science, including one lecture course from each of the following five areas: United States politics, comparative politics, international relations, political philosophy, and applied quantitative methods; a sixth upper-division course from any political science subfield; and a political science senior seminar taken after achieving senior status or with the permission of the instructor\n"
            },
            {
                "title": "Political Science Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in political science:\nAny three lower-division political science courses: POLI 1, 2 or 3, 25, 30, 40 (ECON 1 or 2 cannot be substituted for POLI 40), 45, 50, 55, 99\nAny three upper-division 5-unit political science courses\nOne additional upper- or lower-division political science course\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Chemistry and Biochemistry",
        "description": "Undergraduate research is a critical component of our degrees and most of our majors conduct research in collaboration with faculty mentors. Research in the department has been funded by the National Institutes of Health, the National Science Foundation, the Howard Hughes Medical Institute, the American Chemical Society Petroleum Research Fund, the Dreyfus Foundation, and the Research Corporation. Majors in chemistry, biochemistry, biology, and public health science participate in faculty research projects through CHEM 182, 183, and 184. In addition, advanced students have opportunities for part-time employment assisting faculty in laboratory and related teaching activities. The chemistry and biochemistry curricula are designed to be flexible in the sequence of upper-division coursework so as to allow students to participate in study abroad programs. Students interested in study abroad should meet with a faculty advisor to plan the junior and senior year courses as early as possible in their academic careers.",
        "programs": [
            {
                "title": "Chemistry and Biochemistry Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of science or bachelor of arts degrees, students majoring in chemistry and biochemistry must complete the following departmental requirements for each degree option:\nBachelor of Science in Chemistry\nCHEM 11, 12, 13, 15, 31, 32, 33\nCHEM 102, 111, 141, 151, 152, 154\nThree upper-division chemistry electives, not including CHEM 182\nFour quarters of CHEM 115\nMATH 11, 12, 13\nPHYS 11, 12, 13 or PHYS 31, 32, 33\nBachelor of Science in Chemistry, ACS Certified\nCHEM 11, 12, 13, 15, 31, 32, 33\nCHEM 102, 111, 141, 150, 151, 152, 154\nCHEM 183, 184\nTwo upper-division chemistry electives, not including CHEM 182\nFour quarters of CHEM 115\nMATH 11, 12, 13\nPHYS 31, 32, 33\nBachelor of Science in Biochemistry\nCHEM 11, 12, 13, 15, 31, 32, 33\nCHEM 101, 111, 141, 142, 143, 150, 151 or 152\nTwo additional upper-division chemistry electives, not including CHEM 182; BIOL 110, 113, 172, 174, or 176 may be taken to satisfy one of these two electives\nFour quarters of CHEM 115\nMATH 11, 12, 13\nPHYS 11, 12, 13 or PHYS 31, 32, 33\nBIOL 1A, 1B, 1C, 175\nBachelor of Science in Biochemistry, ACS Certified\nCHEM 11, 12, 13, 15, 31, 32, 33\nCHEM 101, 111, 141, 142, 143, 150, 151 or 152, 154\nCHEM 183, 184\nTwo additional upper-division chemistry electives; BIOL 110, 113, 172, 174, or 176 may be taken to satisfy one of these two electives\nFour quarters of CHEM 115\nMATH 11, 12, 13\nPHYS 31, 32, 33\nBIOL 1A, 1B, 1C, 175\nBachelor of Arts in Chemistry\nCHEM 11, 12, 13, 15, 31, 32, 33\nCHEM 101 or 102, 111, 141, and 150 or 151 or 152\nTwo additional upper-division chemistry electives, not including CHEM 182\nUpper-division lab requirement: 30 hours, which can be satisfied by CHEM 102, 143, 154, or 1 unit of CHEM 182\nFour quarters of CHEM 115\nMATH 11, 12, 13\nPHYS 11, 12, 13 or PHYS 31, 32, 33\nElectives for all degrees can be fulfilled by taking any upper-division chemistry course of 3 units or more, including CHEM 183 and 184.\n"
            },
            {
                "title": "Chemistry and Biochemistry Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in chemistry:\nCHEM 11, 12, 13, 31, 32, and 33\n15 units of upper-division chemistry courses, not including CHEM 115 and 182\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Theatre and Dance",
        "description": "The performance season, sponsored by the department, includes four faculty-directed plays and two dance concerts, in addition to student-directed plays and dance recitals. Participation in these productions is open to all members of the University community---students, faculty, and staff. Guest artists regularly direct, design, choreograph, and/or perform in productions with SCU students.",
        "programs": [
            {
                "title": "Theatre and Dance Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling undergraduate Core Curriculum and College of Arts and Sciences requirements for the bachelor of arts degree, students majoring in theatre arts must complete the following departmental requirements:\nEmphasis in Theatre\nTHTR 9, 10, 24, and 30\nOne course from THTR 31, 32, 33\nTHTR 41A, 42B\nOne course from THTR 112, 113, 119, 161, 165, 167\nDANC 159 or 189\nTHTR 185\nThree approved 5-unit upper-division theatre or dance electives\n4 units of THTR 39/139\nSenior Project may be fulfilled by one of the following courses: THTR 192, 195, 196, 197 (*see description below)\nEmphasis in Dance\nTHTR 9, 10, and 30\nOne course each in Ballet and Jazz (one at level III)\nDANC 48 (prerequisite: DANC 47 or permission of instructor)\nDANC 49\nDANC 67\nDANC 143 and 146\nTwo courses from DANC 140, 141, 142, 145, 147, 148\nDANC 162 or 166\nDANC 159 or 189\n2 units of THTR 39/139\nSenior Project may be fulfilled by one of the following courses: DANC 192 or 193 (*see description below)\n*Senior Project: The Senior Project provides majors with the opportunity to demonstrate their progress in meeting the department learning objectives. In this capstone course, students will prepare and present a final project in an area of their choosing (e.g., acting, design, directing, playwriting, history, literature, dance choreography, performance art, etc.). The Senior Project, demonstrating both effective leadership and collaboration, must include each of the following elements: public presentation, reflection on process (through journaling, etc.) and assessment of progress in addressing department learning goals, and a culminating oral presentation. Short readings followed by discussions with peer groups and faculty in sophomore and junior years will guide students with choosing and successfully completing the Senior Project.\n"
            },
            {
                "title": "Theatre Minor",
                "type": "Undergraduate Minor",
                "requirements": "THTR 10, 8 or 24, 30\nOne course from THTR 41A or 42B\nFour 5-unit upper-division theatre and dance electives\nTHTR 39/139\n"
            },
            {
                "title": "Dance Minor",
                "type": "Undergraduate Minor",
                "requirements": "THTR 10\nOne course each in ballet and jazz (one at level III)\nDANC 48 (prerequisite: DANC 47 or permission of instructor)\nDANC 49\nDANC 143 and 146\nOne course from DANC 140, 141, 142, 145, 147, 148\nOne 5-unit upper-division theatre and dance elective\nTHTR 39/139\n"
            },
            {
                "title": "Theatre Design and Technology Minor",
                "type": "Undergraduate Minor",
                "requirements": "• THTR 10, 30 > • One course from THTR 31, 32, 33, or 36 > • 4 units of THTR 39/139, or THTR 38/138 and 2 units of THTR 39/139 with a makeup production element > • Three or more courses from THTR 130, 131, 132, 133, 134, 136, 137, 138\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "English",
        "description": "The Department of English affords students a rich undergraduate education in the liberal arts centered on literature, cultural studies, and the art of writing. Critical or creative writing projects are integral to every course in the English major. Students and faculty in the English Department discuss and write about British, American, and global literatures, new media, and film. A range of theoretical approaches are used, sometimes with a focus on visual rhetoric and cultural studies. The department also offers the Creative Writing Program, which provides students with a coherent course of study in the writing of poetry, fiction, and creative nonfiction. The English major prepares students to read and write critically, to bring intellectual flexibility to academic and professional problems, and to enter the workforce as individuals with trained skills in analysis and self-expression.",
        "programs": [
            {
                "title": "English Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling the Undergraduate Core Curriculum requirements for the bachelor of arts degree, students majoring in English must complete the following departmental requirements:\nThree foundation courses: ENGL 14, 15, and 16\nTwo historically grounded literary or cultural studies courses; at least one of these courses must be from a period before 1800\nA three-course concentration in literary/cultural studies (American, British, or individually defined); at least two of these courses must be upper-division\nA three-course concentration in writing (professional writing and new media, or creative writing); at least two of these courses must be upper-division\nOne upper-division course in theory, or gender/sexuality, or ethnic/global studies (this course may also be used to meet another requirement)\nOne senior seminar\nEach student&aposs plan of study should be discussed well in advance with an assigned advisor. To this end, the student should write a memorandum of understanding to be agreed upon with the advisor.\nPlease note that the English Department does not allow students to challenge courses.\n"
            },
            {
                "title": "English Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in English:\nTwo foundation courses: ENGL 14 or 15, and 16\nFive English electives; four of which must be upper-division courses\n"
            },
            {
                "title": "Creative Writing Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in creative writing:\nTwo introductory courses: ENGL 71 and 72\nTwo practicum courses: ENGL 91 and 191\nThree electives from the following list: ENGL 73, 170, 171, 172, 173, 175, 176, 177, 179, 179W\nOne additional advanced course: ENGL 171 or 172 (may not double dip)\n"
            },
            {
                "title": "Professional Writing Minor",
                "type": "Undergraduate Minor",
                "requirements": "The professional writing minor in English offers students training in writing for business, nonprofit, and public sector work. Coursework focuses on professional and technical communication genres for print and digital media and development of a professional portfolio and network. The program emphasizes optimizing multimodal communication based on the technology and audience relevant to the particular rhetorical situation. Guidance in obtaining internships for credit is provided. The minor cultivates lifelong learning habits of mind for continued professional growth. When English majors complete the professional writing minor, no more than two courses from the major may be used to fulfill the requirements for the minor.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Philosophy",
        "description": "The Department of Philosophy offers a degree program leading to the bachelor of arts in philosophy. Philosophy inquires directly into the relation of human beings to the world: what we are, how we know, what values are, how we live. Worth pursuing for its own sake, philosophical inquiry also promotes analytical thinking and precise expression and, thus, is excellent undergraduate preparation for a number of professional careers in areas such as law, government, finance, media, writing, and computer programming. To qualify for honors in philosophy, the major ordinarily must have a 3.5 grade point average in philosophy courses and complete PHIL 197 with a grade of A− or better.",
        "programs": [
            {
                "title": "Philosophy Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of arts degree, students majoring in philosophy must complete the following departmental requirements:\nOne lower-division course from PHIL 40--44. Waived for students who completed a Foundations Core sequence in Philosophy (PHIL 1A/2A or PHIL 11A/12A)\nPHIL 14, 15, and 16 (History of Western Philosophy)\nPHIL 17 or 18 (Informal or Formal Logic)\nPHIL 19 (Knowledge and Reality)\nOne course from PHIL 124--127, 141A--151, 174--181A (History of Philosophy)\nOne course from PHIL 174--180 (Non-Western Philosophy)\nOne course from PHIL 109--112, 120--129, 152 (Ethical Theory)\nOne course from PHIL 150--165 (Metaphysics and Epistemology)\nFour additional upper-division courses from PHIL 108--199\n"
            },
            {
                "title": "Philosophy Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in philosophy:\nPHIL 14 and 15 (History of Western Philosophy)\nPHIL 17 or 18 (Informal or Formal Logic)\nFour upper-division courses PHIL 108--199\nEmphases in Philosophy\nAn emphasis may be taken as part of a philosophy major or minor. Four emphases in philosophy are offered: Pre-Law and Justice (P), Ethics and Values (E), Science and Analysis (S), and History of Philosophy (H).\nTo graduate with an emphasis, students must complete four upper-division courses (PHIL 108--199) chosen from the following approved list:\nPre-Law and Justice (P) courses: PHIL 111, 116--128, 185A\nEthics and Values (E) courses: PHIL 108--128, 141, 145, 152, 154, 159, 165, 181, 183, 184, 185A\nScience and Analysis (S) courses: PHIL 128, 150--165\nHistory of Philosophy (H) courses: PHIL 124--127, 141--151, 155, 175--181, 184\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Child Studies",
        "description": "The Child Studies Program offers a degree program leading to the bachelor of science in child studies. The child studies major is designed for undergraduates interested in a career working with children in a school or community-based setting. The curriculum is designed for students interested in careers in elementary-school teaching, social work, counseling, family law, directing child care programs, speech and language pathology, occupational therapy, or nonprofit agencies that provide community services to children and families. Students with a B.S. in child studies are prepared to go on to postgraduate studies related to their career goals such as teacher credential programs/graduate programs in education as well as postgraduate programs such as master&aposs degree programs in psychology, social work, or other fields. Advisors in child studies can provide information about teaching credential programs and many other vocations requiring further graduate or professional school education.",
        "programs": [
            {
                "title": "Child Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in child studies must complete the following program requirements:\nCHST 3, 4, 6, 11, 12, 75, 100, 101, 102, 104, 105, 106 (ELSJ), 181, 182\nPSYC 2, 185 (ELSJ)\nTwo electives selected from: CHST 66, 109, 111, 114, 138, 190, 191, 199; PSYC 134, 172\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "History",
        "description": "The major program in history provides students with an understanding of the human experience through the analysis of evidence derived from both the recent and more distant past. As history majors, students learn essential skills, understand the breadth and similarities of the human experience, and acquire specific geographical and thematic knowledge. A degree in history provides excellent preparation for careers in education, journalism, media, government, law, business, and international affairs---all of which are careers that utilize the history major&aposs expertise in discovering, organizing, and analyzing the forces that shape the contemporary world.",
        "programs": [
            {
                "title": "History Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling University Core Curriculum requirements for the bachelor of arts degree, students majoring in history will complete 13 history courses distributed in the following manner:\nFour lower-division courses, which may include HIST 11A and 12A\nNine upper-division courses, encompassing:  HIST 100  HIST 101S  Six other upper-division courses.  One seminar course taken after the student has completed both HIST 101S and 115 quarter units\nHIST 100\nHIST 101S\nSix other upper-division courses.\nOne seminar course taken after the student has completed both HIST 101S and 115 quarter units\nFrom among the student&aposs lower- and upper-division courses (excluding HIST 100 and 101S), at least one course from four of the following five fields: Global History, the Americas (United States and/or Latin America), Europe, East/South Asia, Africa/West Asia\nAn optional senior project (HIST 197), which is essential to be eligible for Honors in History, may be taken as one of the required upper-division courses\nHonors in History\nHistory majors may be selected for graduation with Honors in History provided they have a grade point average of 3.5 or higher in their history courses and complete a senior project (HIST 197) in a manner approved by the faculty honors committee.\nStudents may also qualify for Phi Alpha Theta, the international honor society in history, Phi Beta Kappa, Alpha Sigma Nu, and other academic honor societies, as well as the honors at graduation. For more details, see Chapters 8 and 10.\nDirected Reading/Research\nStudents can complete directed reading/research (HIST 199) in source materials and secondary works dealing with selected historical problems in world and comparative history. Prerequisite: Permission of department chair and instructor.\n"
            },
            {
                "title": "History Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in history:\nSeven history department courses, at least four of which must be upper-division\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Urban Education",
        "programs": [
            {
                "title": "Urban Education Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in urban education:\nPOLI 1 or HIST 96A or 96B\nCHST 106, 138\nPSYC 134\nPSYC 172 or 185\nTwo upper-division electives selected from the following: CHST 104, 111; ENGL 104, 105; ETHN 157, 161; SOCI 153, 157, 175\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Pre-Health Sciences",
        "programs": []
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Medieval and Renaissance Studies",
        "programs": [
            {
                "title": "Medieval and Renaissance Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in Medieval and Renaissance studies:\nSeven courses selected from three different departments with a maximum of three lower-division courses\nOne of the upper-division courses must require an interdisciplinary research paper based on source materials and secondary works dealing with a topic rooted in the Medieval and/or Renaissance periods. The research paper requirement may be fulfilled by enrolling in MRST 199 under the supervision of an affiliated faculty member and the program director.\nThe study of French, German, Greek, Italian, Latin, and/or Spanish is strongly recommended but not required. Students should consult with the program director to determine the cluster of courses best suited to their personal interests and preparation.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Gerontology",
        "programs": []
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Musical Theatre",
        "programs": [
            {
                "title": "Musical Theatre Minor",
                "type": "Undergraduate Minor",
                "requirements": "All students must complete the following:\nTheory: MUSC 1 and 1A\nSinging: MUSC 34 and three quarters of on-campus private voice instruction\nActing: THTR 8, 10, or 24\nDance: DANC 40 and 41 (or higher level depending upon proficiency) for American musical theatre track; DANC 43 and 46 (or higher level depending upon proficiency) for lyric theatre track\nIn addition to the above, students must complete the following based on their track:\nAmerican musical theatre:\nDANC 55 or 155; and two of the following: THTR 165, THTR 80 or 180, and THTR 123\nLyric theatre:\nTHTR 123, and two of the following: MUSC 109 (or may be taken as independent study), MUSC 53 or 153, and MUSC 194\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Sustainability",
        "programs": [
            {
                "title": "Sustainability Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete a total of seven courses. Two courses must be taken from each of the following three dimensions of sustainability: environmental, societal, and economic. In addition, students must complete one action learning course consisting of an approved project, community-based or immersion course. The following courses are approved for each area.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Catholic Studies",
        "programs": [
            {
                "title": "Catholic Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in Catholic studies:\nFoundational Courses\nTwo courses in Catholic theology from offerings in the Department of Religious Studies\nOne approved course from the Cultures & Ideas series (or equivalent)\nFaith and Culture Courses\nOne specialized course in Catholic history\nOne course in Catholic literature\nOne specialized course in philosophy or an upper-division course in theology\nTwo approved elective courses in the study of Catholic societies or cultures\nThe Colloquium\nDuring sophomore, junior, and senior years, students may participate in a 2-unit interdisciplinary colloquium. The colloquium meets one quarter each year for discussion of a range of relevant topics pertinent to the Catholic intellectual tradition and Catholic imagination. The colloquium is open to all Santa Clara students, but first priority is given to Catholic studies minors.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Arabic, Islamic, and Middle Eastern Studies",
        "programs": [
            {
                "title": "Arabic, Islamic, and Middle Eastern Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete a total of nine courses---six culture courses and three Arabic language courses---for a minor in AIMES. Details concerning these requirements are as follows:\nCulture Courses\nStudents must take a total of six culture courses relating to AIMES (two lower-level and four upper-level) from at least three different departments. No more than two courses may be counted for AIMES credit from the department in which a student majors. A maximum of three courses for AIMES credit may be taken from any one department.\nArabic Language\nThree quarters of Arabic are required. Students with prior knowledge of a relevant language may take a test that certifies that they have fulfilled this requirement.\nSenior Project\nIn lieu of one of the six required courses in Middle Eastern and Islamic cultures, students may elect to do an independent study/reading course on a project in consultation with a member of the AIMES Faculty Advisory Council. This project may entail fieldwork with local Islamic and diaspora Middle Eastern communities in the Bay Area.\nStudents enrolled in the AIMES minor are strongly encouraged to participate in SCU-approved study abroad programs that pertain to Arabic, Islamic, and Middle Eastern studies. Before enrolling in any such program, students should check with the director and faculty members of the AIMES minor as well as the International Programs Office.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Biotechnology",
        "programs": [
            {
                "title": "Biotechnology Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in biotechnology:\nScientific Foundations of Biotechnology\nBIOL 1A, 1B, 1C, 175\nCHEM 11, 12, 31, 32\nEthical Issues\nBIOL 171\nAdvanced Laboratory Skills\nBIOL 176, 177, or CHEM 143\nContemporary Topics in Biotechnology and Related Fields\nBIOL 189\nOne Elective Course\nBIOL 110, 113, 174, or CHEM 141\nNote: If BIOL 171 or 189 is not offered during the academic year, any SCU course focused on medical ethics may be used as a replacement with the consent of the director of biotechnology.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Pre-Law",
        "programs": []
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Pre-Teaching",
        "programs": []
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Asian Studies",
        "programs": [
            {
                "title": "Asian Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in Asian studies:\nCulture Courses\nTwo lower-division courses and four upper-division courses (maximum of two upper-division courses from a student&aposs major and three in any one department) selected from the list of approved courses\nCulture courses include approved offerings in disciplines including art history, communication, history, philosophy, political science, and religious studies\nLanguage Courses\nCompletion of the third course of the first-year, college-level sequence in an Asian language (Japanese and Chinese are offered) or demonstration of an equivalent level of proficiency by passing a language proficiency examination supervised by the Department of Modern Languages and Literatures\nNon-native speakers of English may satisfy this requirement by presenting professionally recognized documentation of proficiency in an Asian language\nThe Asian Studies Program strongly urges its students to spend a summer, quarter, or year in one of the many University-approved study abroad programs in Asia.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "International Studies",
        "programs": [
            {
                "title": "International Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "For the minor in international studies, students must complete the equivalent of four foundation courses, a capstone course, plus an emphasis course in either Global Thematic or Area Studies as follows:\nFoundation Courses\nForeign Language: Two upper-division courses in a foreign language related to the chosen Global Thematic or Area Studies emphasis or the equivalent, as demonstrated through successful examination through the Department of Modern Languages and Literatures\nSocial Science: Two relevant courses in anthropology, communication, political science, or sociology; one of which must be ANTH 3, COMM 107A, POLI 2, POLI 25, SOCI 133, or SOCI 134\nCapstone Course\nA minimum of 20 contact hours in a class, academic internship, or community-based learning experience abroad. The course must include academic oversight and assessment. This requirement may be fulfilled by a minimum of one quarter study abroad related to the chosen Area Studies or Global Thematic emphasis. Students should communicate with the Associate Provost for International Programs to request approval for alternative capstone courses.\nGlobal Thematic Emphasis (GTE) Courses\nIn addition to the foundation courses, students pursuing the Global Thematic emphasis must complete three courses, at least two of which must be upper division and no more than one of which may be in the student&aposs academic major. Students develop their own theme and present a detailed proposal to the International Studies Committee for approval usually no later than the first quarter of their junior year. Students planning to incorporate academic work from a study abroad program should obtain approval prior to departure.\nArea Studies Emphasis Courses\nIn addition to the foundation courses, students pursuing the Area Studies emphasis must complete three courses, at least two of which must be upper division and no more than one of which may be in the student&aposs academic major. Other courses may be approved with the permission of the Associate Provost for International Programs.\nArea Studies Africa: ECON 134, 135; ENGL 35, 130, 157, 164, 165, 166; HIST 104, 107, 141, 142, 143, 144, 149, 157, 193; FREN 111, 112, 113; POLI 146; RSOC 19, 22L, 46, 81, 170, 191; TESP 131, 184\nArea Studies Europe: COMM 199 (appropriate topic only); ENGL 149, 155, 168; 131, 132, 134, 136, 139, 192; FREN 108, 110, 111, 116, 170, 171, 172, 182, 183; GERM 110, 111, 150, 151, 160, 182, 183; INTL 110, 119; ITAL 113, 180, 182; SPAN 125, 150, 151; PHIL 108, 109, 143, 150, 158; POLI 119, 132, 133, 134, 143, 144, 145\nArea Studies Latin America: ANTH 185, HIST 64, 161, 162, 163, 164, 169, 196; POLI 124, 136, 136A, 137, 140, 196; SOCI 134, 135; SPAN 112, 130, 131, 135, 140, 141, 145, 146, 148\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Latin American Studies",
        "programs": [
            {
                "title": "Latin American Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in Latin American studies: seven courses, with at least four upper-division courses from at least three departments. No more than two courses can be from the department in which a student majors. Two of the required courses are foundational courses that provide students with a comprehensive understanding of Latin America as a world region. Each of the foundation courses covers a major historical period.\nFoundational Course I\nServes as an introduction to Latin American culture and civilization from the Native American experiences, through the Spanish Conquest, to the independence of Latin American nations. Note: The director may add new courses that fulfill this requirement.\nStudents must select one of the following courses:\nANTH 185. Peoples of Latin America\nANTH 186. Mesoamerican Prehistory\nHIST 166. Latin America: Empires\nSPAN 130. Survey of Latin American Literature I\nFoundational Course II\nServes as an introduction to Latin American culture and civilization by focusing on the formation in the 19th century of nation states and the forces shaping 20th and 21st century experiences. Note: The director may add new courses that fulfill this requirement.\nStudents must select one of the following courses:\nHIST 95. Modern Latin America\nPOLI 137. Politics in South America\nSPAN 131. Survey of Latin American Literature II\nSPAN 137. Latin American Cultures and Civilizations\nLanguage Requirement\nSuccessful completion of SPAN 100 or 101, or equivalent Spanish or Portuguese language proficiency demonstrated by passing an examination given by the Department of Modern Languages and Literatures, or successful completion of one upper-division course in Latin American literature and culture taught in Spanish. Note: SPAN 100 and 101 do not count towards the seven required courses for the LAS minor.\nElectives\nFour electives (at least three of which must be upper-division) selected from three different departments. Only two electives can be from a student&aposs major. In lieu of one of the electives, juniors and seniors can design an independent study with the approval of the director of Latin American Studies and an affiliated faculty member. The courses that may be used to fulfill this requirement are:\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Economics",
        "description": "As one of the social sciences, economics studies how the choices we make as individuals---as consumers and producers, as savers and investors, as managers and employees, as citizens and voters---combine to determine how society uses its scarce resources to produce and distribute goods and services. This practical discipline provides insights into important issues such as the determinants of wealth and poverty; unemployment, inflation, international trade, and economic growth; and success and failure in the marketplace. The rigorous, systematic analysis that the study of economics brings to bear on these and other real-world issues provides excellent preparation for careers in both the private and the public sectors, as well as for graduate study in economics, business, public policy, and law. Economics graduates pursue varied careers in business, law, banking and finance, government service, education, and private consulting. Students considering graduate study in economics leading to a master&aposs or doctoral degree are strongly encouraged to meet with their advisor as early as possible to plan an appropriate course of study.",
        "programs": [
            {
                "title": "Economics Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and College of Arts and Sciences requirements for the bachelor of science degree, students majoring in economics must complete the following departmental requirements:\nECON 1 or 1E, 2, and 3\nMATH 11 and 12, or MATH 30 and 31\nOMIS 40 or MATH 122 or MATH 8, or AMTH 108\nECON 41 and 42\nECON 113, 114, 115, and 181 or 182\nFive upper-division economics electives, at least two of which must be completed after ECON 113 and 115\n"
            },
            {
                "title": "Economics Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students with a minor in economics through the College of Arts and Sciences must complete the following requirements:\nECON 1, 2, 3, 113, and 115\nTwo additional upper-division economics courses\nMATH 11 or 30\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Modern Languages and Literatures",
        "description": "Students interested in taking a course in a language they have never previously studied should begin at the Elementary 1 level course. Those who wish to continue studying a language they studied prior to coming to SCU (or grew up speaking at home) must take a Placement Test to determine the most appropriate course for their level. This test is free and can be taken from any location. See the Department of Modern Languages and Literatures&apos [website]{.underline} [ ]{.underline} for more information on placement and proficiency testing. Study abroad is a valuable enhancement of the undergraduate experience and is particularly recommended for students pursuing a major or minor in a foreign language. Both the Office of International Programs and the student&aposs modern languages&apos advisor should be consulted to ensure appropriate integration of the work done abroad into the student&aposs program of study.",
        "programs": [
            {
                "title": "French and Francophone Studies Major",
                "type": "Undergraduate Major",
                "requirements": "FREN 100 and 101, or department-approved substitutes\nAt least one course in French or Francophone literature\nRemaining electives in French or Francophone studies to total 40 quarter upper-division units chosen with the approval of the student&aposs major advisor. At least 20 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "Italian Studies Major",
                "type": "Undergraduate Major",
                "requirements": "ITAL 100 and 101, or department-approved substitutes\nRemaining electives in Italian language, literature, and culture to total 40 quarter upper-division units, chosen with the approval of the Italian advisor. At least 20 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "Spanish Studies Major",
                "type": "Undergraduate Major",
                "requirements": "SPAN 100 and 101, or department-approved substitutes\nSPAN 175\nAt least one survey course (but not more than three) from SPAN 120, 121, 130, 131\nOne course in Latin American literature or culture\nOne course in Spanish Peninsular literature or culture\nRemaining electives in Spanish language, literature, and culture to total 40 quarter units of upper-division work, chosen with the approval of the Spanish advisor. At least 20 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "French and Francophone Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "FREN 100 and 101, or department-approved substitutes\nAt least one course in French or Francophone literature\nRemaining electives to total at least 19 quarter units of upper-division work in French. At least 10 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "Italian Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "ITAL 100 and 101, or department-approved substitutes\nRemaining electives to total at least 19 quarter units of upper-division work in Italian. At least 10 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "Japanese Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "JAPN 100, 101, and 102, or department-approved substitutes\nRemaining electives to total at least 19 quarter units of upper-division work in Japanese. At least 10 of these units must be taken at SCU or taught by SCU faculty.\n"
            },
            {
                "title": "Spanish Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "SPAN 100 and 101, or department-approved substitutes\nAt least one course in Hispanic literature or culture\nRemaining electives to total at least 19 quarter units of upper-division work in Spanish. At least 10 of these units must be taken at SCU or taught by SCU faculty.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Religious Studies",
        "description": "The Department of Religious Studies offers a degree program leading to the bachelor of arts in religious studies. The department also offers a minor program for those who wish to concentrate in theological and religious studies. In keeping with the University&aposs commitment to the Catholic faith tradition, the department offers a variety of courses in Scripture, History, and Catholic theology. Faithful to the Jesuit tradition of liberal education and engagement with other religions, the department offers a wide breadth of courses in various religious traditions and methodologies for the study of religion. The department also offers courses as part of the Undergraduate Core Curriculum, at both lower-division and upper-division levels. Courses are clustered in three areas: Theology, Ethics, and Spirituality (TESP); Scripture and Tradition (SCTR); and Religion and Society (RSOC).",
        "programs": [
            {
                "title": "Religious Studies Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of arts degree, students majoring in religious studies must complete the following departmental requirements:\nThree lower-division courses, one from each of the three areas (scripture and tradition; theology, ethics, and spirituality; and religion and society)\nSeven approved upper-division courses, including three designated religious studies seminars, with one in each of the three areas\nRELS 90 (Theories and Methods)\nRELS 197A and RELS 197B, a year-long capstone seminar\n"
            },
            {
                "title": "Religious Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in religious studies:\nOne introductory-level religious studies course (1--19)\nTwo intermediate-level courses (20--99)\nFour approved advanced-level courses (100--199), one of which must be a religious studies seminar. Of the seven courses, at least one must be from each the three areas (scripture and tradition; theology, ethics, and spirituality; and religion and society).\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Physics",
        "description": "A student whose GPA is below a 2.5 must obtain approval from the department chair to declare a physics or engineering physics major.",
        "programs": [
            {
                "title": "Physics Major",
                "type": "Undergraduate Major",
                "requirements": "CHEM 11\nMATH 11, 12, 13, 14\nMATH 22 or MATH 23 or AMTH 106\nPHYS 31, 32 (preferred) or PHYS 11, 12\nPHYS 33, 34, 70, 103, 111, 192\nCompletion of either the \"physics track\" or \"biophysics track\" course requirements specified below\n"
            },
            {
                "title": "Engineering Physics Major",
                "type": "Undergraduate Major",
                "requirements": "CHEM 11\nMATH 11, 12, 13, 14\nAMTH 106 or MATH 22 or MATH 23\nOne course chosen from CSCI 10, COEN 10, COEN 11, COEN 44 or COEN 45\nPHYS 31, 32, 33, 34, 70, 103, 111, 112, 121, 192\nOne upper-division physics elective chosen from PHYS 104.171\nPHYS 120 (preferred) or MECH 121\nAt least four courses chosen from MECH 10, MECH 11, MECH 15, MECH 122, MECH 143 or ELEN 123, CENG 41, CENG 43, COEN 11 or CSCI 60, ELEN 21 or COEN 21, ELEN 100, ELEN 110, ELEN 115, ELEN 118, ELEN 144\nAn approved cluster of five technical courses focused in a specific area chosen by the student and subject to advisor consent. A few of the many possible course cluster areas include: computational, electronics, materials science, solid state, and mechanical. See the engineering physics program coordinator for additional information or go to the physics department website at [www.scu.edu/cas/physics]{.underline}.\n"
            },
            {
                "title": "Physics Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in physics:\nPHYS 31, 32, 33, 34, 192\nFour additional and approved physics courses numbered 70--171\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Communication",
        "description": "All courses taken to fulfill requirements for the major or minor must be four or five units and must be taken for a letter grade, not on a pass/no pass basis. Practicum courses, numbered 190 through 195, do not count toward fulfillment of the communication major or minor.",
        "programs": [
            {
                "title": "Communication Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum requirements for the bachelor of arts degree, students majoring in communication must complete the following departmental requirements:\nCOMM 1\nCOMM 2\nCOMM 12\nCOMM 20\nCOMM 30\nCOMM 40\nTwo upper-division communication theory courses (signified by the letter \"A\" in the course number)\nOne upper-division communication applied course (signified by the letter \"B\" in the course number)\nTwo additional approved elective upper-division communication courses\nCOMM 110\nCOMM 111 or 111G\nCOMM 196 or 197\n"
            },
            {
                "title": "Communication Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must choose either the journalism or digital filmmaking track. Communication majors may not enroll in one of these minors. Students may only complete one communication minor.\nStudents must fulfill the following requirements for a minor in communication:\nJournalism (two lower-division; five upper-division)\nTwo lower-division requirements:\n• COMM 40 and COMM 2 or COMM 30\nFive (5) courses from the following lists, but no more than two (2) from List II.\nList I:\n• COMM 132B\n• COMM 141B\n• COMM 142B\n• COMM 143B (may be repeated up to three times as topics vary)\n• COMM 145B\n• COMM 146B\n• COMM 170A\n• COMM 162B\nList II:\n• COMM 147A\n• COMM 171A\n• COMM 121A\n• COMM 185A\nOne upper-division course from another department (such as political science, ethnic studies, or public health) may be accepted, with permission of the journalism minor director.\nDigital Filmmaking (two lower-division; five upper-division)\nTwo lower-division requirements:\n• COMM 2 and COMM 30\nFive (5) courses from the following lists, but no more than two (2) from List II.\nList I---Production Courses:\n• COMM 130B\n• COMM 131B\n• COMM 132B\n• COMM 133B\n• COMM 134B\n• COMM 135B\nList II---History/Theory Courses:\n• COMM 136A\n• COMM 137A\n• COMM 138A\n• COMM 139A\n• COMM 171A\n• COMM 187A\n• COMM 188A\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Public Health",
        "description": "Students intending to pursue a medical degree, or postgraduate training in other health-related professions, should contact the University pre-health advisor to discuss prerequisites for admission to such programs. Many require a full year of physics coursework (e.g., PHYS 11-13 or 31-33) and completion of the organic chemistry series (CHEM 33) in addition to the requirements for the public health science major.",
        "programs": [
            {
                "title": "Public Health Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling the Undergraduate Core Curriculum requirements for the bachelor of science degree, public health science majors must complete the following courses:\nPHSC 1, 2, 100, 139, 150, 190\nBIOL 1A, 1B, 1C\nCHEM 11, 12, 13, 31, 32\nTwo introductory social science courses chosen from ANTH 1, ANTH 3, ANTH 50, ECON 1, ENVS 50, POLI 1, POLI 2, POLI 50, PSYC 1, PSYC 2, SOCI 1, SOCI 33\nMATH 35, 36 (recommended) or MATH 11, 12\nOne statistics course chosen from MATH 8, ANTH 112, BIOL 160, COMM 110, ENVS 110, OMIS 40, PSYC 40, SOCI 120\nOne public health elective: Any PHSC course other than the required courses listed above\nTwo biomedical, electives, at least one with a lab component, chosen from BIOL 105, BIOL 106/PHSC 124, 110 (lab), 113 (lab), 114 (lab), 114AW (non-lab), 115 (lab), 116 (lab), 119, 124 (lab), 145, 160 (lab), BIOL 179, CHEM 141\nTwo social science or humanities electives chosen from ANTH 112, ANTH 133, ANTH 134, ANTH 135, ANTH 137, ANTH 140, ANTH 150, ANTH 170, COMM 164A, COMM 176A, ECON 101, ECON 129, ECON 135, ECON 160, ENVS 116, ENVS 146, ENVS 147, ENVS 149, HIST 123, POLI 140, POLI 146, POLI 158, POLI 167, PSYC 114, PSYC 115 or 115EL, PSYC 117 or 117EL, PSYC 150, PSYC 167, PSYC 172, PSYC 185 or 185EL, PSYC 196, SOCI 132, SOCI 138, SOCI 157, SOCI 165, SOCI 172/PHSC 124, TESP 157, RSOC 170\nInternship Requirement\nThe PHS major requires students to complete at least 100 hours of public health-related internship work. Internships must be approved in advance by each student&aposs academic advisor in the Public Health Program. Internships can be done on a part-time or full-time basis, during the academic year or summer. Students may receive course credit for volunteer internships. For guidance on internships, contact one of the Public Health Program faculty.\n"
            },
            {
                "title": "Public Health Minor",
                "type": "Undergraduate Minor",
                "requirements": "The interdisciplinary public health minor provides an introduction to the field of public health and is particularly useful for students interested in careers related to medicine, health care, community health, social work, education, or public policy. The minor establishes a sound scientific foundation to understand the functioning of the human body in health and disease and to appreciate the mechanisms by which diseases arise and spread in populations. Students also develop a foundation in the social sciences and statistical methods. Upper-division courses address the influences of biological, environmental, cultural, economic, and historical factors on human health. Students are encouraged to study abroad, if possible, to gain perspective on global health issues. The Public Health Program is evolving and students are encouraged to petition the Director of the Public Health Program to consider new relevant courses developed at Santa Clara and partner institutions abroad in addition to the electives described below.\nPublic Health Courses\nPHSC 1, 2, 150, and at least one additional PHSC course\nOne statistics course chosen from MATH 8, ANTH 112, BIOL 160, COMM 110, ENVS 110, OMIS 40, PSYC 40, SOCI 120\nNatural Science Courses\nBIOL 1A\nCHEM 11\nUpper-Division Elective Courses\nAt least three courses from the following list, including courses from at least two departments: ANTH 112, ANTH 133, ANTH 134, ANTH 135, ANTH 137, ANTH 140, ANTH 150, ANTH 170, BIOL 106 (PHSC 124), BIOL 110, BIOL 113, BIOL 114, BIOL 115, BIOL 116, BIOL 119, BIOL 124, BIOL 145, BIOL 160, BIOL 179, COMM 164A, COMM 176A, ECON 101, ECON 129, ECON 135, ECON 160, ENVS 116, ENVS 146, ENVS 147, ENVS 149, HIST 123, POLI 140, POLI 146, POLI 158, POLI 167, PSYC 114, PSYC 115 or 115EL, PSYC 117 or 117EL, PSYC 150, PSYC 167, PSYC 172, PSYC 185 or 185EL, PSYC 196, SOCI 132, SOCI 138, SOCI 157, SOCI 165, SOCI 172, TESP 157, RSOC 170\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Biology",
        "description": "The Department of Biology offers a program leading to the bachelor of science degree. The major provides students a solid foundation in the core concepts of modern biological thought, and provides students with critical skills to put concepts into practice. The biology major serves as a strong foundation for graduate, medical, or professional studies, as well as for careers in teaching, research, and business. Most courses emphasize laboratory or field work, and students are also encouraged to work with faculty on research projects. Most faculty members involve students in their research programs. Qualified students can obtain course credit for research by enrolling in BIOL 195, and for major research projects by enrolling in BIOL 198. Minor degrees in biology and related disciplines (biotechnology, biomedical engineering, public health, and environmental studies) are available. The Biology Department also offers the fundamental introductory curriculum for all of life science majors, as well as courses that satisfy the Natural Science and Science, Technology & Society requirements of the Core Curriculum, the latter of which are available to all University students who are curious about the nature of life. Numerous study abroad opportunities in the life sciences, both for biology majors and nonmajors, are available through the Study Abroad office.",
        "programs": [
            {
                "title": "Biology Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling the Undergraduate Core Curriculum requirements for the bachelor of science degree, students majoring in biology must complete the following departmental requirements:\nBIOL 1A, 1B, and 1C\nCHEM 11, 12, 13, 31, and 32 (CHEM 33 suggested)\nPHYS 11, 12, 13 or PHYS 31, 32, 33\nMATH 35 and 36 (recommended) or MATH 11 and 12\nBIOL 101\nSeven approved upper-division biology courses, including five with a laboratory component\nStudents are advised to take at least one upper-division course each from one of five biological \"concepts\" categories (Evolution, Information Flow, Structure-Function, Systems, and Transformations of Energy and Matter). Students are also advised to take at least one upper-division course that focuses on the use of modeling and simulation to solve biological problems.\n"
            },
            {
                "title": "Biology Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must fulfill the following requirements for a minor in biology:\nSuccessful completion of BIOL 1C\nThree upper-division biology courses, including two with a laboratory component\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "College of Arts and Sciences",
        "department": "Pastoral Ministries",
        "description": "Founded in 1983, the Graduate Program in Pastoral Ministries offers small classes in both face-to-face and online blended formats tailored to our students ministry goals. The program provides a strong theological foundation to an international body of students.",
        "programs": [
            {
                "title": "Pastoral Ministries",
                "type": "Graduate Program",
                "degree": "M.A. Degree in Pastoral Ministries",
                "description": "People of all ages, vocations and walks of life pursue the Master's Degree in Pastoral Ministries to enrich their lives through a deeper exploration of their faith. Many choose to deepen their understanding of spiritual matters in order to pursue careers in fields related to social justice, such as human services, community outreach, restorative justice, education, youth or campus ministry. Coursework focuses on history, psychology, discernment, contemporary issues, liturgy, scripture, prayer, Hispanic ministry, and lay leadership from a justice perspective.",
                "requirements": "The degree requirements consist of sixty quarter units which are made up of fifteen four-unit classes. Seven of the fifteen courses are required foundational courses; the remaining eight classes are selected from a variety of elective courses.In addition, each student is required to submit a Mid-Program Review paper and to create a Capstone ePortfolio which will include the final papers or projects from three Foundational courses and three other courses.",
                "admission": "To apply to the Graduate Program in Pastoral Ministries you will need to complete an online application and submit specific materials directly to the Program.\nPrerequisites:\n1. A recommended 3.0 cumulative grade point average (GPA)\n2. A Bachelor's degree from an accredited university",
                "program link": "https://www.scu.edu/cas/academics/graduate-program-in-pastoral-ministries/academics/",
                "admission link": "https://www.scu.edu/cas/academics/graduate-program-in-pastoral-ministries/admissions/"
            }
        ]
    }
]
