[
    {
        "university": "Santa Clara University",
        "school": "Jesuit School of Theology",
        "department": "Graduate",
        "programs": [
            {
                "title": "Theology",
                "type": "Graduate Program",
                "degree": "Master of Theology (Th.M.)",
                "description": "The Master of Theology degree is a one-year program in advanced theological study beyond the Master of Divinity degree, and is available in almost any area of specialized interest. There is a wide variety of offerings in the GTU during any academic year (in fact, over 250 courses each semester). Through cross-registration into courses at the University of California - Berkeley, theological specializations can be developed in relation to many other concerns, e.g., sociology, psychology, education, the arts, and the religions and anthropology of most of the major cultures of the world.",
                "requirements": "A student may expect to complete the Master of Theology degree in one academic year, but must complete the program within two calendar years from the date of initial registration in the program.\nProgram Focus: Students in the Master of Theology program will be expected to select a focus for their studies.\na. Students opting for a research Th.M. will focus their studies toward a deeper personal knowledge and scholarly advancement in some particular area of the theological disciplines. These students will be expected to write a thesis.\nb. Students opting for a pastoral Th.M. will focus their work toward the communication of the Christian Gospel. Pastoral Th.M. students may opt to do a project rather than a thesis.",
                "admission": "Prerequisites\n1. The Bachelor of Arts degree or its equivalent.\n2. The Master of Divinity or its academic equivalent must have been completed, with an overall 3.0 (B) average, within the previous five years at the Jesuit School or at a comparable theological center. Requests for exceptions will be considered by the Admissions Committee and the Academic Dean.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/master-of-theology-thm/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/master-of-theology-thm/"
            },
            {
                "title": "Divinity",
                "type": "Graduate Program",
                "degree": "Master of Divinity (M.Div.)",
                "description": "The Master of Divinity is a three-year academic and professional degree that meets the needs for both academic training and pastoral experience of those preparing for pastoral ministry in the Roman Catholic Church in the U.S. To accomplish this purpose, the Jesuit School of Theology provides courses of instruction in theology and related disciplines, introduces students to the use of source materials and the practice of scholarly work and investigation, and provides opportunities for supervised experience in pastoral ministry. The M.Div. degree is the ordinary course of theological education and training for those preparing for ordination to presbyteral ministry.",
                "requirements": "The Master of Divinity degree requires the completion of 81 semester units of course work, including nine units of Field Education. No more than one-third of the course work may be taken on a pass-fail basis. A student may expect to complete the Master of Divinity degree in three academic years, but must complete the program within six calendar years from the date of initial registration in the program. The normal full-time course load is 9-12 units per semester; in addition, up to 3 units may be taken each year during the January intersession.",
                "admission": "Prerequisites\n1. The Bachelor of Arts degree or its academic equivalent.\n2. Nine semester hours or 12 quarter hours of philosophy. Typically, this prerequisite is satisfied by courses in the areas of history of philosophy, ethics, and systematic philosophy. Students preparing for ordination are required to have completed 24 semester units or 36 quarter hours of philosophy.\n3. The applicant should possess the personal maturity and faith commitment commensurate with preparation for full-time ministry. To this end, preference is given to applicants who have at least one year of post-college work experience, and at least part-time, ministerial experience.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/master-of-divinity-mdiv/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/master-of-divinity-mdiv/"
            },
            {
                "title": "Divinity and Arts",
                "type": "Graduate Program",
                "degree": "Concurrent Master of Divinity and Master of Arts",
                "description": "A Combined Master of Divinity/Master of Arts degree program is offered by the Jesuit School of Theology in cooperation with the Graduate Theological Union. This program allows students to integrate a primarily ministerial degree with a more specialized academic degree program. The Master of Divinity degree program provides a strong theological foundation with the goal of preparing students for ministry and leadership in the Roman Catholic Church. The Master of Arts is an academic degree which requires students to determine an area of concentration and submit a thesis.",
                "requirements": "The demands of the two degree programs combined will determine the total time required to complete the Combined M.Div. / M.A. program. However, the program must be completed in no less than a total of four academic years. The student may transfer no more than half of the credits required for one degree into the other; and no more than half of the credits required may be granted based on transfer credit. This means that the JST/GTU Combined M.Div./M.A. degree program allows a student to count up to 24 units total toward both degree programs.",
                "admission": "Students who elect to do a Combined M.Div./M.A. program must formally apply to each program separately, indicating the intent to pursue a Combined M.Div./M.A. degree program on both applications. Most program participants apply to the JST Master of Divinity degree program first. After the completion of the first year of M.Div. studies, students would then apply for the JST/GTU M.A. degree program.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/concurrent-master-of-divinity-and-master-of-arts/",
                "admission link": ""
            },
            {
                "title": "Arts",
                "type": "Graduate Program",
                "degree": "Master of Arts (M.A.)",
                "description": "The Jesuit School of Theology offers the Masters of Arts (M.A.) degree in cooperation with the Graduate Theological Union (GTU). The Master of Arts (Common M.A.) is a two-year program leading to an academic degree in theology. The program provides ecumenical and interreligious learning opportunities, and students have access to courses offered throughout the consortium, as well as many courses at UC Berkeley. The GTU Common M.A. student is required to affiliate with a member school. Students select a specific academic field or Area of Study as the focus of their M.A. work.",
                "requirements": "1. Course work. The Common M.A. is a two-year degree program requiring a total of fourteen 3-unit academic courses plus six units of thesis work.\n2. Language Requirement. All M.A. students are required to demonstrate proficiency in at least one modern foreign language early in the second year of residence. Non-native speakers of English may, with permission, certify English as their second language.",
                "admission": "Prerequisites\nApplicants to the Common M.A. program must have completed a bachelor's degree from an accredited institution by the time they intend to enroll in the program.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/master-of-arts-ma/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/master-of-arts-ma/"
            },
            {
                "title": "Theological Studies (On Campus)",
                "type": "Graduate Program",
                "degree": "Master of Theological Studies (M.T.S.)",
                "description": "The Master of Theological Studies program is an academic degree program that offers students a broad understanding of the Catholic theological vision in combination with areas of concentration including liturgy, history, spirituality and ethics. M.T.S. students become theologically literate in the scriptures, doctrinal history and the ethical consequences of that doctrine. Students also learn a theology of ministry for service in a changing Church and world. Students can complete the degree on a full-time basis, but the program also accommodates the schedules of part-time students with evening and weekend course offerings. The M.T.S. is an ideal program for persons engaged in ministry or seeking theological enrichment and a rewarding exploration of their faith.",
                "requirements": "Prerequisites\n1. A bachelor's degree, in Arts or Sciences, or its academic equivalent, completed with at least a 3.0 (B) Grade Point Average.\n2. The applicant should have a background in theology or religious studies, either through formal coursework or its equivalent.\n3. The applicant should have been involved for at least one year in active ministry or its equivalent.",
                "admission": "The Master of Theological Studies degree requires the completion of 48 semester hours (16 three-unit courses). A full-time student may expect to complete the M.T.S. degree in two academic years, but must complete the program within four calendar years from the date of first registration in the program. Twelve semester units is the normal full-time course load. The degree program also requires students to submit a paper (roughly 40 pages) or equivalent project synthesizing the theological concentration and the general theological components of the program.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/master-of-theological-studies-mts/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/master-of-theological-studies-mts/"
            },
            {
                "title": "Theological Studies (Online)",
                "type": "Graduate Program",
                "degree": "Master of Theological Studies (M.T.S.)",
                "description": "The Master of Theological Studies program is an academic degree program that offers students a broad understanding of the Catholic theological vision in combination with areas of concentration including liturgy, history, spirituality and ethics. M.T.S. students become theologically literate in the scriptures, doctrinal history and the ethical consequences of that doctrine. Students also learn a theology of ministry for service in a changing Church and world. Students can complete the degree on a full-time basis, but the program also accommodates the schedules of part-time students with evening and weekend course offerings. The M.T.S. is an ideal program for persons engaged in ministry or seeking theological enrichment and a rewarding exploration of their faith.",
                "requirements": "Prerequisites\n1. A bachelor's degree, in Arts or Sciences, or its academic equivalent, completed with at least a 3.0 (B) Grade Point Average.\n2. The applicant should have a background in theology or religious studies, either through formal coursework or its equivalent.\n3. The applicant should have been involved for at least one year in active ministry or its equivalent.",
                "admission": "The Master of Theological Studies degree requires the completion of 48 semester hours (16 three-unit courses). A full-time student may expect to complete the M.T.S. degree in two academic years, but must complete the program within four calendar years from the date of first registration in the program. Twelve semester units is the normal full-time course load. The degree program also requires students to submit a paper (roughly 40 pages) or equivalent project synthesizing the theological concentration and the general theological components of the program.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/master-of-theological-studies-mts/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/master-of-theological-studies-mts/"
            },
            {
                "title": "Sacred Theology",
                "type": "Undergraduate Major",
                "degree": "Bachelor of Sacred Theology (S.T.B.)",
                "description": "The Bachelor of Sacred Theology (S.T.B.) is a Roman Catholic ecclesiastical degree that ensures a solid knowledge of theology and a strong foundation in Catholic doctrine. The program prepares students for various forms of ministry and further academic study. The Jesuit School of Theology offers the S.T.B. as an enhancement of the Master of Divinity degree program. S.T.B. students participate in the M.Div. program and complete additional requirements. It offers suitable courses and seminars at an advanced level. The progress of each student is guided and supervised by an academic advisor.",
                "requirements": "As an enhancement of the Master of Divinity degree program, the S.T.B. degree program has additional requirements.\n1. Completed M.Div. Program Requirements Successful completion of all requirements for the M. Div. program.\n2. Philosophy Requirement Completion of the 24 semester hours or 32 quarter hours of philosophy. The normal fulfillment of this requirement will be done prior to residency in some cases the student may be able to complete the requirement after admission to the program.\n3. Research Synthesis Paper Composition of a research synthesis paper in some area of theology. This requirement is normally met by an extended research paper (20-30 pages) done during a course taken during residency under the supervision of the professor of the course.\n4. Latin Language Proficiency Demonstration of a working reading knowledge of the Latin language sufficient to use ecclesiastical documents in Latin. This is a prerequisite for the program, but students will be allowed to complete the Latin prerequisite while in S.T.B. studies at the Jesuit School.\n5. A grade point average of at least 3.0 (B) must be maintained for course work. Students will normally take courses on a letter-grade basis except those designated in the course schedule as pass/fail.",
                "admission": "Prerequisites\n1. The degree of Bachelor of Arts or its equivalent with at least 24 semester hours or 32 quarter hours of philosophy.\n2. A 'suitable knowledge of the Latin language' is required. This is understood to be a working reading knowledge sufficient to use ecclesiastical documents in Latin. This requirement can be met either by course work, generally two semesters, or by an examination.\n3. The applicant should possess the personal maturity and faith commitment commensurate with preparation for full-time ministry. To this end, preference is given to applicants who have at least one year of post-college work experience, and at least part-time, directly ministerial experience.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/bachelor-of-sacred-theology-stb/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/bachelor-of-sacred-theology-stb/"
            },
            {
                "title": "Sacred Theology (S.T.D.)",
                "type": "Graduate Program",
                "degree": "Doctorate in Sacred Theology (S.T.D.)",
                "description": "The Doctorate in Sacred Theology is the third cycle in the program of ecclesiastical degrees intended to complete the scientific theological formation, especially through the writing of a doctoral dissertation.  The S.T.D. is the highest Roman Catholic ecclesiastical degree in advanced theological study, and is intended to further students' theological expertise in preparation for scholarly careers in service to the Church.  In keeping with the intellectual tradition and apostolic priority of the Society of Jesus, the program cultivates a critical fidelity to the Roman Catholic tradition, in service of the faith that does justice.  It enables students to understand the interplay between faith and culture, preparing them to address theological and pastoral issues that emerge in diverse cultural contexts.",
                "requirements": "While the STD degree is designed as a two-year program, students typically take three to four years to complete the degree. All work for the STD must be completed within five calendar years from the date of first registration in the program.\n1. At the beginning of the STD program, there will be a diagnostic interview of the student conducted by the academic advisor and one other faculty member.\n2. The first year of course work will be at the 4000 level or above.\n3. Students will be required to do four courses in the area of concentration during the first year of the STD studies.\n4. The residency requirement will be registration for two years of doctoral study beyond the STL or SSL. Students must enroll full-time and pay full tuition during the two years of required residency.\n5. Students will need to establish proficiency in an additional modern language suitable for theological research other than English and other than the modern language required for admission. Students in Biblical Studies will also establish proficiency in Greek or Hebrew, the biblical language not presented for admission to the program.\n6. Students who have not taken comprehensive examinations as part of their STL or SSL program must take comprehensive exams in their area of concentration, ordinarily no later than the second semester of the STD. These exams will be administered by the appropriate department.\n7. Students will write a doctoral thesis to be read and approved by at least three readers. Each student will have a public defense of the completed dissertation.\n8. The doctoral thesis must be filed in the Graduate Theological Union (GTU) Library.\n9. FE 4401: As of 2015-16, all students in the STD program must be enrolled in FE 4401 Research Practicum every semester. All students in these programs are required to engage in some type of pastoral work for the duration of their program, and in FE 4401 (a) reflect as a group upon their pastoral placements and engagement and how this informs their theological studies; and (b) discuss progress on their research projects.",
                "admission": "Prerequisites\n1. A completed Licentiate in Sacred Theology (STL) or Licentiate in Sacred Scripture (SSL) with a minimum grade point average of 3.7.\n2. Proficiency in one modern language suitable for theological research other than the applicant's native tongue. In addition, candidates who intend to specialize in Biblical Studies must show proficiency in one Biblical language.\n3. A major research paper from the STL or SSL program, which demonstrates your research and writing abilities.",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/doctorate-in-sacred-theology-std/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/doctorate-in-sacred-theology-std/"
            },
            {
                "title": "Sacred Theology (S.T.L.)",
                "type": "Graduate Program",
                "degree": "Licentiate in Sacred Theology (S.T.L.)",
                "description": "The Licentiate in Sacred Theology (S.T.L.) is a two-year Roman Catholic ecclesiastical degree in advanced theological study which gives students two full years of study beyond the Bachelor of Sacred Theology (STB) and Master of Divinity (MDiv) degree. The STL degree is suggested for lay, clergy and religious to further theological expertise for service in official capacities in religious communities and dioceses, and for teaching in higher education, diocesan schools and seminaries.",
                "requirements": "Two year's residence is required in the STL program, even though students may complete all degree requirements in less time. All work for the STL program must be completed within four calendar years from the date of initial registration in the program.\n1. Area of Specialization The student must choose an area of specialization at the time of admission to the program. The specialization may be in any area of concentration within JST-SCU, i.e., Biblical, Historical, Systematic, Moral, Pastoral or Liturgical theology, or Christian spirituality.\n2. Course Work Twenty-four semester units of course work are required in addition to the courses counted toward the STB degree. One of these courses should be in the methodology appropriate to the area of specialization. Normally, courses must be 4000 level or above. A procedure for upgrading courses at the 2000 or 3000 level is outlined in the Guidelines for Advanced Master's Degrees.\n3. Modern Language Requirement Demonstration of skill in one modern language other than the student's native language. This may be done by evaluation in course work or by taking the language exams provided for the MA and Graduate Theological Union (GTU) doctoral students. For specialization in Biblical Studies, the student must also demonstrate a suitable knowledge of one of the biblical languages.\n4. Latin Requirement Demonstration of a working reading knowledge of the Latin language sufficient to use ecclesiastical documents in Latin. This is a prerequisite for the program, but students will be allowed to complete the Latin prerequisite while in STL studies at JST-SCU.\n5. FE 4400: As of 2015-16, all students in the STL program must be enrolled in FE 4400 Research Practicum every semester. All students in these programs are required to engage in some type of pastoral work for the duration of their program, and in FE 4400 (a) reflect as a group upon their pastoral placements and engagement and how this informs their theological studies; and (b) discuss progress on their research projects.",
                "admission": "Prerequisites\n1. The Master of Divinity, Bachelor of Sacred Theology, or their academic equivalent must have been completed with an overall 3.0 (B) average, within the previous five years at the Jesuit School or at a comparable theological center. Requests for exceptions will be considered by the Admissions Committee and the Academic Dean.\n2. A 'suitable knowledge of the Latin language' is required.  This is understood to be a working reading knowledge sufficient to use ecclesiastical documents in Latin. This requirement can be met either by coursework, generally two semesters, or by an examination.\n3. The completion of 24 hours of philosophy.\nTo fulfill the Latin language pre-requisite for the S.T.L. program, language proficiency may be demonstrated by the following means:\n1. Successful completion of two semester-long, 3-unit courses, in the Latin language while in studies at JST.\n2. Four semesters of undergraduate language study with the equivalent of a B grade in the fourth semester.\n3. A written examination by a Latin instructor who is approved by the JST Academic Dean.\n4. Evidence of the completion of this language requirement at another school (transcript notation is acceptable).",
                "program link": "https://www.scu.edu/jst/academics/degrees-and-programs/licentiate-in-sacred-theology-stl/",
                "admission link": "https://www.scu.edu/jst/future-students/application-info/application-checklists/licentiate-in-sacred-theology-stl/"
            }
        ]
    }
]
