[
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Accounting",
        "description": "The Department of Accounting strives to provide high-quality accounting instruction, conduct research that contributes to the understanding of accounting issues, and provide superior service to students and alumni, the profession, the University, and the business community. In addition to the major in accounting, the Accounting and Operations Management and Information Systems departments offer a joint major in accounting and information systems.",
        "programs": [
            {
                "title": "Accounting Major",
                "type": "Undergraduate Major",
                "requirements": "ACTG 20, 130, 131, 132, 134, 135, 136, and 138\nNote: Accounting majors may use ACTG 134 to satisfy both the information systems requirement in the Leavey School of Business curriculum and the Science, Technology & Society requirement in the 2009 University Core.\n"
            },
            {
                "title": "Accounting and Information Systems Major",
                "type": "Undergraduate Major",
                "requirements": "ACTG 20, 130, 131, 132, 135, 136, and 138\nOMIS 30 or 31\nOMIS 105, 106, and 150 (or ACTG 155)\nOne course from OMIS 107, 111, 113, 120, 135, 137\nAccounting and information systems majors may use either OMIS 30 or 31 to satisfy the information systems requirement in the Leavey School of Business curriculum. OMIS 150 is cross-listed with ACTG 155. Accounting and information systems majors may enroll in OMIS 150 or ACTG 155.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Management",
        "description": "The Department of Management and Entrepreneurship&aposs curriculum emphasizes rigorous analysis and managerial application. Courses are offered in organizational behavior, human resource management, managerial communication, team management, leadership, entrepreneurship, negotiation, and family business management. Additional courses in strategic management, business ethics, entrepreneurship, new venture creation, and international management provide a general management perspective. Management majors are those who want to develop balanced general management skills and/or prepare for project management careers. Students in other majors who aspire to supervisory or managerial positions will find several of the department electives useful.",
        "programs": [
            {
                "title": "Management Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and Leavey School of Business requirements for the bachelor of science in commerce degree, students majoring in management must complete the following departmental requirements:\nMGMT 174\nFour courses selected from MGMT 164, 165, 166, 169, 170, 171, 172, 173, 175, 177, 179, 180, 181, 197, 198, and 199\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Entrepreneurship",
        "programs": [
            {
                "title": "Entrepreneurship Minor",
                "type": "Undergraduate Minor",
                "requirements": "MGMT 164. Introduction to Entrepreneurship\nMGMT 165. Building a New Business\nMGMT 198E. Internship in Entrepreneurship\nAnd two courses from the following list:\nBUSN 197. Business/Engineering Project Collaboration\nECON 129. Economic Development\nECON 185. Economics of Innovation and Intellectual Property\nENVS 145. Environmental Technology\nENVS 148. Solar Revolution\nFNCE 141. New Venture Finance\nFNCE 143. Entrepreneurial Finance\nFNCE 170. Business Valuation\nMECH 144. Smart Product Design (co-requisite: MECH 144L lab)\nMGMT 172. Social Entrepreneurship or HRNS 120A. Entrepreneurship for Social Justice\nMGMT 175. Managing Family Businesses\nMGMT 177/ENGR 161 Cultures of Innovation\nMKTG 175. Internet Marketing\nMKTG 177. Social Media Marketing\nMKTG 182. Marketing Analysis\nMKTG 187. Innovation and New Product Marketing\nPHSC 157: Social Innovation in Public Health\nSOCI 150. Immigrant Businesses in the United States\nSOCI 172. Management of Health Care Organizations\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "International Business",
        "programs": [
            {
                "title": "International Business Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in international business:\nForeign Language\nOne course from ARAB 23, CHIN 23, FREN 100, GERM 100, ITAL 100, JAPN 23, SPAN 23\nStudents who feel that they already have the required level of language competency must demonstrate such by completing one of the above courses (or a more advanced 100 or 101 level course). Other languages do not qualify.\nBusiness Fundamentals\nBUSN 70 (or BUSN 170); ACTG 11; ECON 1, 2, 3; and MGMT 80\nOne course from MGMT 6, PHIL 26\nWorld Geography or Social Science in a Global Context Cultures & Ideas 3\nTwo approved Cultures & Ideas 3 courses in anthropology, history, political science, sociology, or two courses listed below, or a combination for a total of two courses in both groupings: ENVS 50; ECON 129, 134, 138; HIST 105; POLI 50, 119, 121, 122, 136, 137, 140, 142, 144, 146; PSYC 162; SOCI 138\nOther eligible selected comparative politics courses may be approved by the director of the international business minor program\nNote that some courses may require prerequisites.\nInternational Business\nTwo upper-division courses from FNCE 151; MGMT 170; MKTG 178; ECON 181, 182\nNote that some courses may require prerequisites and may be offered only once per year.\nRecommended (but not required)\nCompletion of advanced language courses\nParticipation in study abroad programs; approved equivalent courses taken abroad may fulfill requirements of the minor\nInternship related to an international business career\nAdditional coursework in economic development, modern history, and politics of selected world regions\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Retail Studies",
        "programs": [
            {
                "title": "Retail Studies Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students must complete the following requirements for a minor in retail studies:\nCOMM 20\nCOMM 12 or OMIS 34, or SOCI 49/149\nECON 1\nOMIS 40 or COMM 110 or PSYC 40, or MATH 8/123 or AMTH 108\nMKTG 181\nMKTG 165 (ACTG 11 and MKTG 181 or 181S are prerequisites to this class)\nSummer internship: BUSN 198R\nMKTG 168 and 169\nStudents must select one of the following three options:\nMulti-channel Option\nOMIS 15 (this OMIS requirement cannot be waived)\nMGMT 160\nInternet Retailing and Digital Marketing Option\nARTS 74 or 174\nARTS 75 or 175\nMKTG 175 or ARTS 177 or OMIS 111, or OMIS 113\nMKTG 177\nWeb Engineering Option\nCOEN 161\nCOEN 163\nCOEN 162\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Economics",
        "description": "As one of the social sciences, economics studies how the choices we make as individuals---as consumers and producers, as savers and investors, as managers and employees, as citizens and voters---combine to determine how society uses its scarce resources to produce and distribute goods and services. This practical discipline provides insights into important issues such as the determinants of wealth and poverty; unemployment, inflation, international trade, and economic growth; and success and failure in the marketplace. The rigorous, systematic analysis that the study of economics brings to bear on these and other real-world issues provides excellent preparation for careers in both the private and the public sectors, as well as for graduate study in economics, business, public policy, and law. Economics graduates pursue varied careers in business, law, banking and finance, government service, education, and private consulting. Students considering graduate study in economics leading to a master&aposs or doctoral degree are strongly encouraged to meet with their advisor as early as possible to plan an appropriate course of study.",
        "programs": [
            {
                "title": "Economics Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and Leavey School of Business requirements for the bachelor of science in commerce degree, students majoring in economics must complete the following departmental requirements:\nECON 41 and 42 (satisfies OMIS 41 requirement in the Leavey School of Business core)\nECON 113, 114, 115, and 181 or 182\nThree upper-division economics electives, at least two of which must be completed after ECON 113 and 115\n"
            },
            {
                "title": "Economics Minor",
                "type": "Undergraduate Minor",
                "requirements": "Students with a minor in economics through the College of Arts and Sciences must complete the following requirements:\nECON 1, 2, 3, 113, and 115\nTwo additional upper-division economics courses\nMATH 11 or 30\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Marketing",
        "description": "Marketing operates at the cutting edge of a well-managed organization. Development of students&apos decision-making and managerial skills are the major objectives of the Department of Marketing program, with special emphases in innovation, high technology, retailing, and digital marketing. Marketing links a business to its markets and customers and acts as the eyes and the ears for a firm, helping managers to identify emerging market opportunities and anticipating customer needs and wants. It is also the firm&aposs voice, handling communications with customers and deciding on advertising, sales, and social media messages. Finally, strategic marketing addresses competitive threats and opportunities, guiding a firm&aposs efforts to deliver superior value. Because customer analysis and competitive advantage are so crucial to business success, a degree in marketing provides a solid foundation for a general management career leading to executive responsibilities. It can also provide the basis for a more focused career in such areas as advertising, retailing, sales, brand management, and market research.",
        "programs": [
            {
                "title": "Marketing Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and Leavey School of Business requirements for the bachelor of science in commerce degree, students majoring in marketing must complete the following departmental requirements:\nMKTG 182 and 183 (recommended to be completed in junior year, prior to electives)\nAfter completion of MKTG 182 and 183, three courses in an area of marketing emphasis chosen from one of the following areas:\nBusiness and Technology Marketing Emphasis\nMKTG 185, 187 (strongly recommended)\nMKTG 175, 177, 186, 189 (recommended)\nConsumer and Channel Marketing Emphasis\nMKTG 165, 175, 186 (strongly recommended)\nMKTG 187, 189 (recommended)\nIndividually Designed Marketing Emphasis\nCourses selected with the student&aposs marketing faculty advisor. The three courses are typically selected from MKTG 165, 175, 178, 185, 186, 187, and 189.\nThe MKTG 198 internship elective should be designed to augment the student&aposs career goals. However, MKTG 198 cannot be substituted for an elective course in the major.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Finance",
        "description": "Finance is at the center of well-managed businesses, from high-technology companies to mutual fund companies. Development of knowledge and managerial skills in the corporate and investment settings are the major goals of the finance program. Graduates with a degree in finance pursue careers as corporate financial officers, traders, investment managers, financial analysts, financial planners, investment bankers, stockbrokers, regulators, and other specialties. Corporate finance officers manage the assets and value of corporations. They examine which new products and investments will be profitable, analyze the most cost-effective ways to produce them, and determine where to get the money needed to fund new ventures. Personal financial planners and stockbrokers help people make wise investments by selecting good stocks and assembling efficient portfolios. Students in finance also learn how to understand and analyze information from capital markets, engage in mergers and acquisitions, and undertake investments in new ventures, real estate, and international markets.",
        "programs": [
            {
                "title": "Finance Major",
                "type": "Undergraduate Major",
                "requirements": "In addition to fulfilling Undergraduate Core Curriculum and Leavey School of Business requirements for the bachelor of science in commerce degree, students majoring in finance must complete the following departmental requirements:\nFNCE 124 and 125\nFour upper-division finance electives*\n*Note: FNCE 118, FNCE 127, and FNCE 129 will NOT meet upper-division elective requirements for finance majors.\n"
            },
            {
                "title": "Real Estate Minor",
                "type": "Undergraduate Minor",
                "requirements": "All Santa Clara University students may pursue the real estate minor by fulfilling the following requirements:\nFNCE 118*\nFour courses from the following list:  FNCE 127*, FNCE 128, FNCE 129*, FNCE 143, ECON 156, and ENVS 128\nFNCE 127*, FNCE 128, FNCE 129*, FNCE 143, ECON 156, and ENVS 128\nNonbusiness students also need to take at least three additional courses (prerequisites for finance real estate electives): FNCE 121, ACTG 11, and BUSN 70 or BUSN 170.\n*Note: FNCE 118, FNCE 127, and FNCE 129 will NOT meet upper-division elective requirements for finance majors, and will not be included in the finance major GPA.\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Operations Management and Information Systems",
        "description": "The department&aposs majors and minors may pursue a variety of careers after graduation, including management consulting, systems administration, technical sales and marketing, operations management, and roles as business analysts in public, private, service, and nonprofit sectors. Past graduates have also gone on to various master&aposs degree or doctoral programs, as well as law school.",
        "programs": [
            {
                "title": "Management Information Systems (MIS) Major",
                "type": "Undergraduate Major",
                "requirements": "OMIS 30\nOMIS 105, 106, and 107\nThree courses from OMIS 110, 111, 114, 113, 116, 117, 120, 135, 137, 150, 170, 173\n"
            },
            {
                "title": "Accounting and Information Systems (AIS) Major",
                "type": "Undergraduate Major",
                "requirements": "ACTG 20, 130, 131, 132, 135, 136, and 138\nOMIS 30\nOMIS 105, 106, and 150 (or ACTG 155)\nOne course from OMIS 107, 111, 113, 120, 135, 137\nAccounting and information systems majors may use either OMIS 30 or 31 to satisfy the information systems requirement in the Leavey School of Business curriculum. OMIS 150 is cross-listed with ACTG 155. Accounting and information systems majors may enroll in OMIS 150 or ACTG 155.\n"
            },
            {
                "title": "Management Information Systems Minor",
                "type": "Undergraduate Minor",
                "requirements": "Nonbusiness majors and non-MIS majors in the Leavey School of Business may pursue the MIS minor, enabling them to apply a deeper understanding of technology to their major.\nThe MIS minor has the following requirements:\nOMIS 30\nOMIS 105\nThree courses from OMIS 106, 107, 110, 111, 114, 113, 116, 117, 120, 135, 137, 150, 170, 173\nNonbusiness students minoring in MIS must also complete the following requirements:\nOne course in mathematics from MATH 11 or 30\nOne course in statistics and data analysis from OMIS 40, MATH 8, MATH 122, PSYC 40, COMM 110\nThree courses in business from BUSN 70, MGMT 160, MGMT 161, MKTG 181, FNCE 121, OMIS 108\n"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Graduate",
        "description": "",
        "programs": [
            {
                "title": "Evening MBA",
                "type": "Graduate Program",
                "degree": "Master of Business Administration Degree (MBA)",
                "description": "Evening MBA. When we say Northern California innovation walks through our doors after hours, we mean it. Working professionals are attending our evening MBA program and earning degrees in two years. It’s a part-time program that harnesses the influence of global business models to deliver an exceptional education based on real-world applications. Our MBA gives you unprecedented access to a rich network of peers, professionals, and professors in leadership roles. They are today’s entrepreneurial vanguard who work in some of the world’s most innovative companies.",
                "requirements": "Program Overview:\n1. Program duration: Two years, from full-time to part-time.\n2. Time/schedule: Evening classes meet twice per week.\n3. Course delivery: Core courses are cohort style; elective courses are flexible.",
                "admission": "",
                "program link": "https://www.scu.edu/business/evening-mba/",
                "admission link": ""
            },
            {
                "title": "Executive MBA",
                "type": "Graduate Program",
                "degree": "Master of Business Administration Degree (MBA)",
                "description": "SCU’s Executive MBA program fast tracks your path to leadership. Our 20-month cohort-based program, designed specifically for experienced professionals, creates innovative leaders who will impact Silicon Valley's future.",
                "requirements": "Our program has 5 thematic terms where students will be intellectually challenged and work on intensive team projects, case assignments, simulations and workshops.",
                "admission": "",
                "program link": "https://www.scu.edu/business/executive-mba/",
                "admission link": ""
            },
            {
                "title": "Business Analytics",
                "type": "Graduate Program",
                "degree": "MS in Business Analytics",
                "description": "Data Science and Business Analytics. Do you want a data-driven advantage? Analytics.Big data. The Internet of everything. The ability to collect and make sense of a vast amount of data that has transformed the industry—and you can be part of the transformation with our MS in Business Analytics program. Through an expertly designed curriculum that blends business acumen with data analysis, we prepare you for careers in one of the fastest growing, most in-demand fields in tech.",
                "requirements": "Program Overview:\n1. Program duration: Five quarters full-time; two years part-time.\n2. Time/schedule: Evening and Saturday classes.\n3. Course delivery: Cohort style with elective options.",
                "admission": "",
                "program link": "https://www.scu.edu/business/ms-business-analytics/",
                "admission link": ""
            },
            {
                "title": "Financial Analytics",
                "type": "Graduate Program",
                "degree": "Masters of Science in Financial Analytics (MSFA)",
                "description": "Finance is at the core of successful innovation. Because without financial leadership, ideas don’t get funded, products don’t get to market, and profitability is elusive. Our targeted MS in Finance program has helped countless professionals push their personal envelopes to excel in the corporate world, master in investment management, and command capital markets. We have part time programs to get you on a fast track to financial proficiency.",
                "requirements": "Program Overview:\n1. Program duration: 10 month full-time program; a part-time option is also available.\n2. Time/schedule: Evening and Saturday classes.\n3. Course delivery: Cohort style with elective options.",
                "admission": "",
                "program link": "https://www.scu.edu/business/ms-finance/",
                "admission link": ""
            },
            {
                "title": "Information Systems",
                "type": "Graduate Program",
                "degree": "Masters of Science in Information Systems (MSIS)",
                "description": "Information systems drive business. All the way from the companies that build the technology itself to disparate disciplines such as construction, education, and banking—the speed of business is dependent on IS. Our MSIS is born of and lives in Silicon Valley. Led by faculty recruited from top companies, our project-based curriculum draws from real-world challenges that you can put to use immediately.",
                "requirements": "Program Overview:\n1. Program duration: Flexible program length from 16 to 24 months.\n2. Time/schedule: Evening/Saturday classes to balance work, life, and study.\n3. Course delivery: Tailored class schedule to build foundations and to meet your interest and needs.\n4. STEM-approved",
                "admission": "",
                "program link": "https://www.scu.edu/business/ms-information-systems/",
                "admission link": ""
            },
            {
                "title": "Marketing (Online)",
                "type": "Graduate Program",
                "degree": "Online Master of Science (MS) in Marketing",
                "description": "The Leavey School of Business is proud to offer a new Online Master of Science (MS) in Marketing, a degree program designed to accommodate and anticipate ongoing innovative change in the 21st-century marketing environment. This novel marketing master’s degree, which can be completed in as little as one year, can put you on the fast track toward a leadership role in the agile and dynamic marketing organizations that define the field today.",
                "requirements": "Program Overview:\n1. 36 units\n2. 15 courses\n3. Four 10-week quarters\n4. Complete in as little as one year\n5. One on-campus bootcamp residency weekend\n6. Two annual starts, fall (September) and spring (March)\n7. Part-time and full-time enrollment options",
                "admission": "All applicants to the Online MS in Marketing must possess a four-year bachelor’s degree from an accredited college or university.",
                "program link": "https://onlinemba.scu.edu/academics/marketing-masters",
                "admission link": "https://onlinemba.scu.edu/admissions/marketing-masters-admissions"
            }
        ]
    }
]
