[
    {
        "university": "Santa Clara University",
        "school": "School of Law",
        "department": "Graduate",
        "programs": [
            {
                "title": "Juris Doctor Program (Full-Time)",
                "type": "Graduate Program",
                "degree": "Juris Doctor Degree (J.D.)",
                "description": "The first year of law school introduces students to the fundamentals of legal analysis and to the substantive law in several basic subjects. Coursework totaling 28 units is prescribed for full-time students.",
                "requirements": "To be eligible for the Juris Doctor degree, students must satisfy the requirements set forth below:\n1. Complete 86 semester units\n2. Maintain a cumulative grade point average that places the student in academic good standing\n3. Complete the required course of study\n4. Have no pending question of academic dishonesty or moral turpitude that would preclude granting of the degree\n5. Complete at least 64 credit hours in regularly scheduled class session at the law school\n6. FOR STUDENTS WHO BEGAN PRIOR TO THE FALL OF 2016: Complete the Professional Skills Requirement\n7. FOR STUDENTS WHO BEGAN IN THE FALL OF 2016 OR THEREAFTER: Complete the Experiential Course Requirement\n8. File a completed petition to graduate\n9. Earn at least 4 upper division proficiency points",
                "admission": "To be considered for admission as a first-year student, applicants must (i) register with the Law School Admission Council’s (LSAC) Credential Assembly Service (CAS), and (ii) take the Law School Admission Test (LSAT) or other ABA-approved admission test. (These steps are preferred but not required for applicants seeking admission as transfer students.) All applicants must demonstrate that they have earned (or will earn prior to matriculation) a bachelor’s degree that has been awarded by an institution that is accredited by an accrediting agency recognized by the United States Department of Education. Applicants who have graduated from an institution outside the United States may apply if the quality of the program of education of their degree-granting institution is equivalent to that of institutions accredited by an accrediting agency recognized by the United States Department of Education.\nForeign applicants who have earned a bachelor’s degree or its equivalent and are proficient in English are eligible to apply. Applicants who have completed all of their undergraduate work at institutions outside of the United States, its territories, or Canada must have those institutions send their transcripts directly to LSAC.",
                "program link": "https://law.scu.edu/bulletin/juris-doctor-program-of-study/",
                "admission link": "https://law.scu.edu/admissions/apply/"
            },
            {
              "title": "Juris Doctor Program (Part-Time)",
              "type": "Graduate Program",
              "degree": "Juris Doctor Degree (J.D.)",
              "description": "The first year of law school introduces students to the fundamentals of legal analysis and to the substantive law in several basic subjects. All part-time students, including those who transfer to full-time status after the first year must take their remaining first-year classes at night.",
              "requirements": "To be eligible for the Juris Doctor degree, students must satisfy the requirements set forth below:\n1. Complete 86 semester units\n2. Maintain a cumulative grade point average that places the student in academic good standing\n3. Complete the required course of study\n4. Have no pending question of academic dishonesty or moral turpitude that would preclude granting of the degree\n5. Complete at least 64 credit hours in regularly scheduled class session at the law school\n6. FOR STUDENTS WHO BEGAN PRIOR TO THE FALL OF 2016: Complete the Professional Skills Requirement\n7. FOR STUDENTS WHO BEGAN IN THE FALL OF 2016 OR THEREAFTER: Complete the Experiential Course Requirement\n8. File a completed petition to graduate\n9. Earn at least 4 upper division proficiency points",
              "admission": "To be considered for admission as a first-year student, applicants must (i) register with the Law School Admission Council’s (LSAC) Credential Assembly Service (CAS), and (ii) take the Law School Admission Test (LSAT) or other ABA-approved admission test. (These steps are preferred but not required for applicants seeking admission as transfer students.) All applicants must demonstrate that they have earned (or will earn prior to matriculation) a bachelor’s degree that has been awarded by an institution that is accredited by an accrediting agency recognized by the United States Department of Education. Applicants who have graduated from an institution outside the United States may apply if the quality of the program of education of their degree-granting institution is equivalent to that of institutions accredited by an accrediting agency recognized by the United States Department of Education.\nForeign applicants who have earned a bachelor’s degree or its equivalent and are proficient in English are eligible to apply. Applicants who have completed all of their undergraduate work at institutions outside of the United States, its territories, or Canada must have those institutions send their transcripts directly to LSAC.",
              "program link": "https://law.scu.edu/admissions/part-time/",
              "admission link": "https://law.scu.edu/admissions/apply/"
            },
            {
                "title": "JD/MBA Combined Program",
                "type": "Graduate Program",
                "degree": "JD/MBA Combined Degree",
                "description": "Santa Clara Law and the Leavey School of Business offer two joint degree programs for eligible law students. The J.D./MBA and J.D./MSIS joint degree programs are designed to be primarily 3.5- to 4-year full-time programs. The programs are available only to SCU School of Law and Leavey School of Business students who have been accepted by both schools for participation in one of the programs. Law students must apply to the Leavey School of Business during their first year of law studies. Students must enter the program before they have completed 45 law school units.",
                "requirements": "While enrolled in the program, students must:\n1. Maintain a satisfactory grade point average in each school\n2. Satisfy the academic requirements of each school\n3. Complete the same number of courses in the business school and semester units of credit in the law school as other recipients of the respective degrees\n4. Complete all courses identified as required by both schools\n5. Work out a specific, individualized academic program with the senior assistant dean for student services and the business school program director",
                "admission": "Candidates for the combined program must make separate application to both the School of Law and the M.B.A. Program. It is unnecessary to apply to both programs simultaneously. Because the first year of the program is entirely in the law school, candidates typically apply to the M.B.A. Program after they have completed the first semester of law school.",
                "program link": "https://law.scu.edu/academics/jdmba/",
                "admission link": "https://law.scu.edu/academics/jdmba/"
            },
            {
                "title": "JD/MSIS Combined Progam",
                "type": "Graduate Program",
                "degree": "JD/MSIS Combined Degree",
                "description": "Santa Clara Law and the Leavey School of Business offer two joint degree programs for eligible law students. The J.D./MBA and J.D./MSIS joint degree programs are designed to be primarily 3.5- to 4-year full-time programs. The programs are available only to SCU School of Law and Leavey School of Business students who have been accepted by both schools for participation in one of the programs. Law students must apply to the Leavey School of Business during their first year of law studies. Students must enter the program before they have completed 45 law school units.",
                "requirements": "While enrolled in the program, students must:\n1. Maintain a satisfactory grade point average in each school\n2. Satisfy the academic requirements of each school\n3. Complete the same number of courses in the business school and semester units of credit in the law school as other recipients of the respective degrees\n4. Complete all courses identified as required by both schools\n5. Work out a specific, individualized academic program with the senior assistant dean for student services and the business school program director",
                "admission": "Candidates for the combined program must make separate application to both the School of Law and the M.B.A. Program. It is unnecessary to apply to both programs simultaneously. Because the first year of the program is entirely in the law school, candidates typically apply to the M.B.A. Program after they have completed the first semester of law school.",
                "program link": "https://law.scu.edu/academics/jdmsis/",
                "admission link": "https://law.scu.edu/academics/jdmsis/"
            },
            {
                "title": "Intellectual Property Law",
                "type": "Graduate Program",
                "degree": "LL.M. Degree in Intellectual Property Law",
                "description": "Earn your LLM at one of the top IP schools in the nation. Our High Tech Law Institute is a leader in promoting and advancing the study and development of IP law and related laws, and our Santa Clara High Technology Law Journal is one of the most widely cited in the field.",
                "requirements": "Students may enroll in the LL.M. in Intellectual Property program on a full-time or part-time basis. The program requires a minimum of 2 semesters in residence at the Santa Clara University main campus.",
                "admission": "We welcome applicants who have either:\n1. A degree in law from a law school approved by the American Bar Association, or\n2. A degree in law from a law school, not approved by the American Bar Association, but accredited by the State of California and:\na. Graduated in the upper one half of their class, and\nb. Admitted to practice law in any United States jurisdiction.",
                "program link": "https://law.scu.edu/admissions/llm-programs/#1",
                "admission link": "https://law.scu.edu/admissions/llm-application/"
            },
            {
                "title": "International and Comparative Law",
                "type": "Graduate Program",
                "degree": "LL.M. Degree in International and Comparative Law",
                "description": "Explore our abundant array of international law courses and take advantage of one of the oldest and most extensive summer abroad programs of any U.S. law school. Our Center for Global Law and Policy promotes scholarship in the field of international and comparative law and provides a variety of educational opportunities for law students.",
                "requirements": "Participants seeking the LLM degree in International and Comparative Law must complete 24 semester hours of credit. These units must include:\n1. Successful completion of the academic portion of at least one Santa Clara University School of Law summer study abroad program; OR enrollment as a full-time law student for one semester at a law school with which the School of Law has a cooperative agreement. These classes will satisfy part of the 24 units required for the degree, and satisfy one or more of the area of study requirements outlined below.\n2. To achieve a well-balanced background in international and comparative law, students should take at least one course from each of the following categories of classes: (i) public international law; (ii) private international law; and (iii) comparative law. The specific list of approved courses may be found on the International Law Certificate website under the heading “Current List of Approved International Law Certificate Courses.” The student’s overall course of study must be approved by the Director of Graduate Legal Programs. Courses outside this list, unless taken on one of our study abroad programs, must also be approved in advance by the Director of Graduate Legal Studies.\n3. Students must complete a written research paper either in conjunction with a class approved by the Director of Graduate Legal Programs or as Independent Research (course # 298) under the supervision of a faculty member.\nElective Courses: Most upper-division courses are open to enrollment by LLM candidates. The program assumes as a minimum one academic year plus one summer in residence. The requirements for the degree must be completed within two academic years from matriculation.",
                "admission": "We welcome applicants who have either:\n1. A degree in law from a law school approved by the American Bar Association, or\n2. A degree in law from a law school, not approved by the American Bar Association, but accredited by the State of California and:\na. Graduated in the upper one half of their class, and\nb. Admitted to practice law in any United States jurisdiction.",
                "program link": "https://law.scu.edu/admissions/llm-programs/#2",
                "admission link": "https://law.scu.edu/admissions/llm-application/"
            },
            {
                "title": "United States Law",
                "type": "Graduate Program",
                "degree": "LL.M. Degree in United States Law",
                "description": "Choose from our numerous and diverse courses to create a program that matches your professional needs and goals. We offer four options: general studies, or a specialization for Intellectual Property Law, Human Rights Law, or International and comparative Law.",
                "requirements": "All participants seeking the LL.M. degree must do the following:\n1. Successfully complete 24 semester hours of class credit\n2. Successfully complete Introduction to US Law (LAW 700). This course is designed to give participants an intensive overview of the basic elements of the United States substantive and structural law.\n3. Complete a 2 or 3 unit course in the area of international or comparative law. If such a course has been taken previously, this requirement may be waived and the participant may enroll in another course from his/her selected curriculum. Students requesting a waiver should submit a written petition to the Law Student Services Office.\n4. Writing Requirement. Students must complete a written research paper either in conjunction with a 2 – 3 unit class or as an independent research paper (LAW 298) under the supervision of a faculty member.\n5. Be in residence for a minimum of two regular semesters (not including summer sessions).\n6. Enroll in a minimum of 8 units per semester and complete the degree requirements within a maximum of two academic years from the date of matriculation.\nCompletion of the course, Legal Research, Analysis, and Writing for U.S. Law LL.M.s (LAW 376) is highly recommended, but not required. The purpose of this course is to enhance the students’ skills in the area of legal research and writing.\nWhile students are not required to declare a specialization, Santa Clara Law does provide a variety of coursework that would allow for the student to enhance and develop his or her understanding of a specific area of law.",
                "admission": "We welcome applicants who have a degree in law from an institution outside of the United States that is accredited by the appropriate authority in that country. Additionally, applicants must have either:\n1. Graduated in the upper one half of their law-school class, or\n2. Demonstrated above average or superior academic performance, or, alternatively, work experience, post graduate education, or standardized test, which demonstrate the ability to undertake advanced legal studies.",
                "program link": "https://law.scu.edu/admissions/llm-programs/#3",
                "admission link": "https://law.scu.edu/admissions/llm-application/"
            }
        ]
    }
]
