[{"description": ["Get hands-on training and high tech skills on the latest vehicles and technologies at Santa Monica College. Apply basic diagnostic techniques, maintenance procedures, and repair skills to automotive, electrical, braking and suspension, and steering systems. Learn how to troubleshoot and repair electronic, mechanical and hybrid-electric vehicles. Gain an understanding of alternative fuels and other emerging technologies as well as learn how each performs as potential solutions to transportation-related energy and air pollution problems.", "Employees in these essential positions in today’s automotive maintenance shop operate sophisticated tools and equipment and practice safe work procedures under the guidance of more experienced technicians."], "department": "Automotive Technology", "university": "Santa Monica College", "programs": [{"title": "Automotive Technology", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The ESL Department offers credit courses designed to prepare students whose first language is not English for the reading, writing, listening, speaking, and study skills needed for college success and career enhancement. The department also offers non-credit community and continuing education courses free to adult residents."], "department": "ESL Department", "university": "Santa Monica College", "programs": [{"title": "ESL Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Photography majors learn the dynamics of visual communication to illustrate an idea, record an event, articulate a story, capture a mood, sell a product, or interpret someone’s character. Photographers often specialize in a particular type of subject matter or genre, such as advertising, architecture, editorial, fashion, food, people or photojournalism.", "Photography offers both an Associate of Arts degree and a comprehensive Certificates of Achievement in photography."], "department": "Photography", "university": "Santa Monica College", "programs": [{"title": "Photography", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Step into an exciting and rewarding career path that prepares you to work in cosmetology including hair care, skin care, and nail care. Our established programs feature experienced and accomplished faculty who bring the classroom to life, teaching you the essential skills required for a professional career in cosmetology.", "Gain practical experience in our professional salon on campus, work toward your cosmetology license and prepare to launch your cosmetology career. Our hands-on approach to learning includes up-to-date interactive demonstrations and training on clients in a salon setting. Industry partners include Dermalogica, Wella, Bio Elements, Poise Makeup Professional and more."], "department": "Cosmetology Department", "university": "Santa Monica College", "programs": [{"title": "Cosmetology", "degree": "Associate Degree - Cosmetology", "requirements": "25.5 units + General Education", "description": "Upon completion of the program, students will be able to demonstrate professional level skill in hair cutting, hair coloring, hair styling, nail care, and skin care. Additionally, the student will be proficient in health and safety procedures in common use in salons. Upon completion, the student will be eligible to take the California State Board of Cosmetology and Barbering licensure exam.", "admission": "", "program link": "/AcademicPrograms/Cosmetology/Pages/Cosmetology.aspx", "admission link": ""}, {"title": "Cosmetology", "degree": "Certificate of Achievement - Cosmetology", "requirements": "25.5 units", "description": "", "admission": "", "program link": "/AcademicPrograms/Cosmetology/Pages/Cosmetology.aspx", "admission link": ""}, {"title": "Esthetics (Skin Care)", "degree": "Department Certificate - Esthetics (Skin Care)", "requirements": "", "description": "Upon completion of the program, students will demonstrate professional-level skill in client consultation, skin analysis, and manual, chemical, and electrical facials, as well as eyebrow shaping, waxing, the application of strip and individual eyelashes, and makeup application. Additionally, the student will be proficient in health and safety procedures in common use in salons and spas.", "admission": "", "program link": "/AcademicPrograms/Cosmetology/Pages/Skin-Care.aspx", "admission link": ""}, {"title": "Nail Care", "degree": "Department Certificate - Nail Care", "requirements": "", "description": "The Nail Care program provides students with professional-level skill in manicures, pedicures, nail tips, acrylics, gel nails, and 3-D nail art. Additionally, students will become proficient in health and safety procedures commonly practiced in salons and spas. Upon completion, the student will be eligible to take the State Board of Cosmetology and Barbering/NIC Manicure licensure exam.", "admission": "", "program link": "/AcademicPrograms/Cosmetology/Pages/Nail-Care.aspx", "admission link": ""}, {"title": "Salon Business", "degree": "Department Certificate - Salon Business", "requirements": "", "description": "A Department Certificate in Salon Business will aid cosmetologists, estheticians, and manicurists in establishing and running their own business/salon.", "admission": "", "program link": "/AcademicPrograms/Cosmetology/Pages/Salon-Business.aspx", "admission link": ""}]}, {"description": ["The Early Childhood/Education program prepares students for careers in early care and education, including transfer to a four-year college/university. Our program values and builds upon the diverse work experiences of our students, both aspiring early educators and other professionals working in the field.", "In collaboration with our community partners, our program provides students with opportunities to construct their identity as a teacher, by developing knowledge and skills and connecting theory to practice. Through coursework, site observations, fieldwork, mentoring, tutoring and professional development, students build their capacity for reflective practice and global citizenship, in order to serve the unique needs of children, families, and communities."], "department": "Education   Early Childhood Department", "university": "Santa Monica College", "programs": [{"title": "Preschool", "degree": "Associate in Science for Transfer - Early Childhood Education", "requirements": "", "description": "This degree is intended for students who are interested in Early Childhood Education and are planning on transferring to a four-year university. Early Childhood Education professionals adhere to the guidelines as well as the Professional Code of Ethics of the National Association for the Education of Young Children (NAEYC) providing developmentally appropriate learning opportunities for the enhancement of the physical, intellectual, social, emotional and creative domains of young children. Completion of this degree will likely give you priority admission consideration in the majors at the CSU campuses listed below. In addition, you will need to complete no more than 60 semester/90 quarter CSU units of coursework after transfer to complete your degree. If you are considering transfer to a UC, private, or out-of-state university, please consult a counselor before applying to transfer, as that institution’s transfer requirements might be different from those required for the AS-T in Early Childhood Education.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Preschool.aspx", "admission link": ""}, {"title": "Preschool", "degree": "Associate Degree of Science - Early Childhood Studies", "requirements": "", "description": "The Early Childhood Studies program focuses on educational practices that emphasize interpersonal relationships, cultural diversity, child-centered curriculum and the inclusion of children with special needs in all educational opportunities. The curriculum prepares students to teach or administer programs for young children that include: private early childhood programs, public programs such as school district children centers and Head Start Programs, Head Start, Infant and School Age Programs. The Early Childhood Studies program is geared toward students wishing to prepare for employment in early childhood programs. Emphasis is placed in preparing students for early entry into the workforce. The program provides a sequential path that allows students to obtain the academic requirements for various state permits – Associate Teacher, Assistant Teacher, and Teacher. Students may build on the courses provided by the Early Childhood Studies program to later transfer. However, the AS-T in ECE is the recommended option for students desiring to transfer.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Preschool.aspx", "admission link": ""}, {"title": "Preschool", "degree": "Certificate of Achievement- Early Childhood Education", "requirements": "", "description": "Upon completion of the program, students will demonstrate the knowledge,\nskills, and dispositions to meet the entry-level requirements for early childhood professionals working in\nprograms regulated by the California Department of Social Services (Title 22). This certificate is designed to\nmeet the Early Childhood Education course work, which is one of the two requirements needed to qualify for\nthe California Child Development Associate Teacher permit.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Preschool.aspx", "admission link": ""}, {"title": "Transitional Kindergarten", "degree": "Certificate of Achievement - Transitional Kindergarten", "requirements": "24 units", "description": "The goal of the Transitional Kindergarten certificate is to provide a strand of unit bearing curriculum specifically designed to meet the needs of current Transitional Kindergarten (TK) teachers as well as Multiple Subject credential holders needing the Early Childhood unit required to be a TK teacher.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Transitional-Kindergarten.aspx", "admission link": ""}, {"title": "Elementary Education", "degree": "Associate in Arts for Transfer - Elementary Teacher Education", "requirements": "60 Units (Including General Education)", "description": "Our Associate of Arts for Transfer (AA-T) degree in Elementary Teacher Education is the perfect fit if you plan to transfer and complete a Liberal Studies degree and/or a multiple-subject teaching credential in preparation to teach at the elementary school level. This preliminary degree fulfills lower-division requirements for a degree in Liberal Arts.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Elementary-Education.aspx", "admission link": ""}, {"title": "Early Intervention", "degree": "Associate in Science - Early Intervention Assistant", "requirements": "33 units + General Education Requirements", "description": "The Early Intervention Assistant program will prepare students for career placements in public and/or private early intervention and educational settings that serve typically and atypically developing young children. Specific jobs and responsibilities may include serving as an early childhood educator with a specialization in working with children with exceptionalities, special education assistant for children birth to eight years of age, a one-to-one aide for a child (e.g., “inclusion facilitator”), classroom aide with expertise in special needs, or as an assistant on the early intervention team serving infant", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Early-Intervention.aspx", "admission link": ""}, {"title": "Early Intervention", "degree": "Certificate of Achievement - Early Intervention Assistant", "requirements": "33 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Early-Intervention.aspx", "admission link": ""}, {"title": "Child & Adolescent Development", "degree": "Associate in Arts for Transfer - Child and Adolescent Development", "requirements": "19 Units + General Education Requirements", "description": "The Child and Adolescent Development degree provides a comprehensive understanding of a broad range of human development domains including social, cognitive, physical, and culture from birth thru adolescence. The degree provides broad undergraduate preparation for students interested in child and adolescent care, as well as a variety of youth-related social service careers.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/ECE/Pages/Child-and-Adolescent-Development.aspx", "admission link": ""}]}, {"description": ["Sustainability-focused courses map to ILO #4 and are included in a degree in Environmental Studies or Environmental Science.", "Environmental Politics (Pol Sc 22)", "Environmental Ethics (Philo 20)", "Environmental Psychology (Psych 40)", "Global Environmental History (Hist 14)", "Environmental Studies (Geog 7)", "Environmental Biology (Bio 9)", "Recycling and Resource Management (RRM 1)", "Stop by the Center for Environmental and Urban Studies to find out more about environmental internships. You can intern at the CEUS or find more information on local businesses and organizations offering environmental internships.", "These faculty have embedded principles of ecological literacy and sustainability into a variety of general education courses. Look for their name and / or the sustainability flag under their sections in the class schedule to develop your own"], "department": "Environmental Studies", "university": "Santa Monica College", "programs": [{"title": "Environmental Studies", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Welcome to the Department of History at Santa Monica College.", "Our department is notable both for the quality of its members' teaching and for the breadth of its course offerings. This depth and diversity is set within a framework of traditional humanistic skills, the chief being critical reading, good writing, and the analyses of historical texts. We offer expertise in such areas as the history of the Middle East, East and South Asia, Africa, and US social history, including Latino/as and African-Americans – as well as the traditional survey courses in U.S., Western, and World History. Our lively departmental culture includes scholarship awards, a history club, and active faculty participation in local, state, regional and international academic organizations.", "We invite you to browse our website and to contact us for further information about course offerings, our instructors, and careers in history and its sister fields."], "department": "History Department", "university": "Santa Monica College", "programs": [{"title": "History Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Counseling Department offers a wide array of special services and programs to assist students in achieving their educational goal at SMC. The Counseling Department also offers courses which assist students with student success strategies, learning and study skills, AA degree and transfer planning, career development and internships, conflict resolution skills and behavior management. Disabled Student Services offers several such courses and more which provide specialized information for disability-related concerns."], "department": "Counseling Department", "university": "Santa Monica College", "programs": [{"title": "Counseling Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Presidents Day", "Staff Development Day", "Staff Development Day", "Spring Break", "Memorial Day", "Santa Monica College Library"], "department": "Library", "university": "Santa Monica College", "programs": [{"title": "Library", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Welcome to the English department, where courses in reading, writing, literature, and creative writing support students in developing critical thinking and articulate expression—skills essential for engaged global citizenship. Whatever academic and professional goals students may choose, strong language skills are necessary for success and participation. Reading courses help students to expand their vocabularies and meet the challenges of college study, while composition courses guide them to be more thoughtful, curious, and confident writers and researchers.", "Survey courses in American, English, Asian, and world literatures reveal major themes and motifs in cultures both ancient and modern so that students can appreciate the diversity and rich inter-relatedness of the human family. Students may also discover their voices and explore their imaginations in creative poetry and fiction writing courses. English faculty employ a range of teaching methods to meet students’ varied learning styles. In their English instructors, students will find mentors committed to helping them reach their goals and to pursue lifelong learning."], "department": "English Department", "university": "Santa Monica College", "programs": [{"title": "English Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Santa Monica College Theatre Arts Department has a widely known and highly regarded reputation, nationally and internationally. Situated in an ideal geographical location, our students have easy access to numerous film and theatre communities nearby while enjoying the beach city atmosphere and climate on campus.", "The department offers overall theatre training required to complete the A.A. Degree and transfer requirements to universities. Santa Monica College is the leading transfer school to the University of California system, USC and Loyola Marymount and the leading transfer school to the combined UC and CSU systems. In past years we have had an exceptional transfer rate of students accepted into Juilliard -- 8 of our students were accepted and 2 students waitlisted in 8 consecutive years with only 20 acceptances nationwide per year! Our students have been accepted at NYU, Columbia University, and other prestigious institutions nationwide and abroad. Many of our alumni work as professional actors and theatre technicians on and off-Broadway, as well as in National Tours, Regional Theatres, London’s West End and other international theatrical venues. Our alumni also work in film, television, and commercials.", "The department’s curriculum focuses on providing education and experience towards mounting theatrical productions. Performance related classes hone skills enabling the actor to audition and perform with confidence. Technical Theatre classes provide students with the knowledge and skills to tackle all aspects of technical theatre. Department productions are student cast and run by student crews."], "department": "Theatre Arts Department", "university": "Santa Monica College", "programs": [{"title": "Theatre Arts Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The goal of the dance program at Santa Monica College is to prepare students for future careers in performance, choreography, teaching and related careers in dance. The Dance Department is dedicated to nurturing versatile dance artists, cultivating technique, creativity, and performance skills, while enhancing self-confidence, expression, and critical thinking. Students are encouraged to think independently, to value creative thought and diversity, and to be responsible global citizens.", "As an independent department, the SMC dance program is considered a unique gem in two-year training programs. In Spring of 2017, SMC unveiled the new Core Performance Center, a state of the art facility with four spacious sunlit studios dedicated to the Dance Department. The dance program also features a relationship with the Eli and Edythe Broad Stage at the Santa Monica College Performing Arts Center, where our students perform in four full-length dance concerts per year.", "Ideally situated in the heart of Santa Monica, SMC students benefit from rigorous and immersive training in beautiful facilities near the ocean while gaining invaluable access to the professional opportunities and connections in Los Angeles."], "department": "Dance Department", "university": "Santa Monica College", "programs": [{"title": "Dance Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The music curriculum at Santa Monica College provides educational opportunities designed to meet the needs of students who wish to explore and expand their knowledge, performance skills and appreciation of music. This is fulfilled through a program that includes applied and group music instruction, history, vocal and instrumental ensembles, theory and musicianship. The curriculum is intended to serve music majors, general education transfer students, vocationally oriented students, and the community."], "department": "Music Department", "university": "Santa Monica College", "programs": [{"title": "Music Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["At Santa Monica College, our students are the change agents who will bring the next wave of design technology to fruition. Courses across entertainment technology, interaction design, graphic design and interior architectural design draw insight from experienced faculty including industry professionals, who use current technology to solve real world problems.", "Located in the heart of Silicon Beach, the new Center for Media & Design unites all SMC programs focused on preparing students for careers in the rapidly evolving media, design, and technology fields.", "Instructors focus on job-specific skills that employers value including:", "We offer a range of education options including Associate of Science degrees and certificate programs across many concentrations."], "department": "Design Technology Department", "university": "Santa Monica College", "programs": [{"title": "Entertainment Technology", "degree": "Animation - Associate of Science", "requirements": "50 units + General Education Requirements", "description": "Upon completion of the program, students will be able to develop original and effective animation projects using industry-standard tools and methodologies.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Animation - Certificate of Achievement", "requirements": "50 units", "description": "This program provides students with a comprehensive, hands-on education using industry-standard digital media tools. Focusing on the design and implementation of digital media for the entertainment industry, this program covers a range of real-world audio and video production and post-production techniques as well as traditional principles of storytelling and visual communication.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Digital Media - Associate of Science", "requirements": "44 units + General Education Requirements", "description": "This program provides a comprehensive understanding of the 2D animation process used in the entertainment industry. Students learn to create professional-quality character animations for a variety of entertainment projects using art styles that may range from realistic to stylized.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Digital Media - Certificate of Achievement", "requirements": "44 units", "description": "This program provides an understanding of the 3D animation process used in the entertainment industry. Students learn to animate 3D characters and props for a variety of entertainment projects that range from realistic to stylized.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "2D Animation - Department Certificate", "requirements": "16 units", "description": "This program provides an understanding of the 3D modeling process used in the entertainment industry. Students learn to create a 3D character, prop and environment models for a variety of entertainment projects that range from realistic to stylized.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "3D Animation - Department Certificate", "requirements": "16 units", "description": "This program provides an understanding of the 3D rendering process used in the entertainment industry. Students learn to shade, texture and light 3D scenes for a variety of entertainment projects that range from realistic to stylized.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "3D Modeling - Department Certificate", "requirements": "16 units", "description": "The Design Technology Department offers a specialized Department Certificate in Digital Effects for students who successfully complete the required courses listed below. *Students must complete the area of emphasis (major) requirements in effect at the time enrollment begins or the requirements in effect at graduation as long as continuous enrollment is maintained. *Continuous enrollment is defined as enrollment in each Fall and Spring semester until graduation. At least 50% of the units required for Department Certificates must be completed at Santa Monica College. Students must receive a grade of C or higher in each course to successfully complete the Department Certificate.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "3D Rendering - Department Certificate", "requirements": "16 units", "description": "This program provides an understanding of the game development process used in the entertainment industry. Students learn to effectively analyze gameplay elements and to develop original 2D and 3D game prototypes.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Digital Effects - Department Certificate", "requirements": "15 units", "description": "This program provides a comprehensive understanding of the visual development process used in the entertainment industry. Emphasis is placed on form, composition, color, value, and lighting. Students learn to design professional quality characters and worlds for a variety of entertainment projects using art styles that range from realistic to stylized.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Game Development - Department Certificate", "requirements": "16 units", "description": "", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Entertainment Technology", "degree": "Visual Development - Department Certificate", "requirements": "16 units", "description": "", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Entertainment-Technology.aspx", "admission link": ""}, {"title": "Graphic Design", "degree": "Graphic Design - Associate of Science", "requirements": "40 units + General Education Requirements", "description": "Upon completion of the program, students will be able to solve a variety of communication problems utilizing imagery and typography, will possess fundamental graphic design skills as well as a working knowledge of current technology, and will have the ability to work successfully as an entry-level graphic designer.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Graphic-Design.aspx", "admission link": ""}, {"title": "Graphic Design", "degree": "Graphic Design - Certificate of Achievement", "requirements": "40 units", "description": "The User Experience Design Department Certificate provides a thorough study of user experience design and interaction design. Focusing on designing for the user, research, user experience design, interface design, prototyping, and user-testing, students will learn the methodologies and tools for UX and to design and prototype for multiple platforms. A Department Certificate in User Experience Design will prepare the students for entry-level positions such as User Experience Designer, Interface Designer, Interaction Designer, Mobile App Designer, and Web Designer.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Graphic-Design.aspx", "admission link": ""}, {"title": "Graphic Design", "degree": "User Experience - Department Certificate", "requirements": "12 units", "description": "The Web Design Department Certificate provides a thorough study of the design and production of websites at an advanced level. Focusing on design processes, user experience, and visual design, students will learn how to design and develop commercial-quality websites. A Department Certificate in Web Design will prepare the students for entry-level positions such as Web Designer, Web Developer, User Experience Designer, Interface Designer, and Interactive Designer.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Graphic-Design.aspx", "admission link": ""}, {"title": "Graphic Design", "degree": "Web Design - Department Certificate", "requirements": "24 units", "description": "", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Graphic-Design.aspx", "admission link": ""}, {"title": "Interior Architectural Design", "degree": "Associate of Science - Interior Architectural Design", "requirements": "48 units + General Education requirements", "description": "This program provides a thorough and analytical foundation of the Interior Architectural Design field that will enable students to practice professionally and serve their community with safe, functional, and innovative interior spaces. Students will develop employment skills in hand sketching and visualization, digital production skills using software such as CAD and Revit, specifications of surface materials and furniture. Significant academic and professional career focused electives are offered in green design, lighting design, interior codes, production design for Film and TV. A wide range of digital modeling and rendering courses are offered using software such as Photoshop, SketchUp, Rhino, and 3D Studio Max.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Interior-Architectural-Design.aspx", "admission link": ""}, {"title": "Interior Architectural Design", "degree": "Certificate of Achievement - Interior Architectural Design", "requirements": "48 units", "description": "This program provides students with hands-on education using industry-standard digital tools. The coursework focuses on the skills necessary for digital production and design using CAD technology, BIM technology, solid modeling techniques, rendering, animation, and digital image enhancement. Students will be prepared to work in a wide range of design disciplines, including interior design firms, architecture firms, ficture and furnishing design firms, and 3D rendering firms.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Interior-Architectural-Design.aspx", "admission link": ""}, {"title": "Interior Architectural Design", "degree": "Department Certificate - Digital Production and Design", "requirements": "15 Units", "description": "This program provides students with hands-on skills necessary in the Motion Picture Industry as it relates to the Art Department of Film and TV. Students will be prepared as an entry-level designer for a Production Designer, Art Director, Set Decorator or Set Designer, developed skills may include research, design analysis, development and presentation of a set design for Film and TV.", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Interior-Architectural-Design.aspx", "admission link": ""}, {"title": "Interior Architectural Design", "degree": "Department Certificate - Set Design & Art Direction for Film & TV", "requirements": "18 Units", "description": "", "admission": "", "program link": "/AcademicPrograms/DesignTechnology/Pages/Interior-Architectural-Design.aspx", "admission link": ""}]}, {"description": ["Our mission is to give our students the best possible preparation in chemistry and physics, enabling them to transfer seamlessly to four-year institutions. Towards that end, we employ a highly dedicated and knowledgeable faculty supported by an excellent technical staff.  The departmental facilities are state of the art and include such instrumentation as FT-NMR and FT-IR spectrometers. Join us for what we think is the best Physical Science Department at the best Community College in the country!"], "department": "Physical Sciences Department", "university": "Santa Monica College", "programs": [{"title": "Physical Sciences Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Mathematics Department of Santa Monica College and the Math Lab are located in the Math Complex (MC). The department has full-time faculty members, part-time faculty members, as well as a student support staff which work together to serve the mathematical needs of the students at SMC. We offer developmental mathematics classes as well as the standard lower division (first and second year) college-level classes. Classes start as early as 6:45 a.m. and end as late as 10 p.m. We also offer accelerated classes wherein one semester students complete the material traditionally offered in two separate classes. SMC offers classes on its main campus as well as five satellite campuses.", "Our Math Lab offers a range of free services to current students to help them succeed in their math courses."], "department": "Mathematics Department", "university": "Santa Monica College", "programs": [{"title": "Mathematics Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Art Department of Santa Monica College offers an extensive and very well-received program in Studio Art, Art History and Design. The primary mission of our program is to prepare students for upper division study at a four-year, two-year, university or art school and/or to earn an Associate of Arts degree. Secondary objectives include portfolio preparation for students seeking admission to the Arts and Entertainment Academy and other two year vocational training programs.", "We are well known as one of the best foundation art programs in the state, and our students are regularly recruited and given scholarships by the most prominent art schools in the country. These include Cal Arts, Art Center College of Art and Design, San Francisco Art Institute, the Chicago Art Institute, Rhode Island College of Art and Design, and the California College of Arts and Crafts.", "There are a large variety of career opportunities in the Fine Arts, Art History, Design and Illustration including: Fine Artists,  gallery owners and managers, curators, installers, web and digital artists, art critics and all Sciences requiring art materials backgrounds (eg. Ceramic and Glass engineering).", "Art History: career opportunities include: museum related careers such as museum curators, installers, restorers, archivists, librarians, registrars, Art acquisitions and loans, Art Law, etc.", "Design: careers in all media, such as web design, environmental design, entertainment design, product design, graphic design, architectural design, and illustration for all media.  Other career options could be advertising artist, art administrator, furniture designer, courtroom sketcher, medical illustrator, animator and toy designer.", "Some organizations that typically employ art majors include: studios, museums, auction houses, art councils, educational institutions, hospitals, interior design departments, advertising agencies and film and media productions companies.", "1 p.m. - 5 p.m.", "ART 114", "(310) 434-4230", "Ronn Davis", "davis_ronald@smc.edu"], "department": "Art Department", "university": "Santa Monica College", "programs": [{"title": "Art Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Psychology Department is a \"safe space,\" in that diversity of all kind is respected and honored.", "Find out more by talking to one of our faculty!"], "department": "Psychology Department", "university": "Santa Monica College", "programs": [{"title": "Psychology Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Department of Kinesiology establishes a foundation and understanding of practices of well-being and movement across the lifespan within the context of a diverse and changing society.", "We aspire to be a premier kinesiology department known for our craft of explanation, demonstration and application of high quality knowledge related to human physical activity, health and wellness across the subdisciplines of kinesiology.", "The Department of Kinesiology & Athletics provides a multi-disciplinary program, which educates through movement and physical activity. This program serves as a fundamental component to the comprehensive college experience with regard to values in self-awareness and practice. The curriculum develops and nurtures the “whole” student and supports them in exploring life tools for activity and wellness. The intent is that students will be empowered through their educational experience to make decisions throughout their lives that support a balanced and holistic lifestyle.", "NOTE: The majority of career options the field of Kinesiology require additional education; 4-year or graduate degrees and agency specific certifications. Please speak with a KIN faculty member for more insight to the areas below.", "Health Educator, Teacher, K-12, Community College, University", "Group Exercise Instructor, Personal Trainer, Corporate Fitness and Wellness, Special Populations", "Exercise Physiologist, Nurse, Dietitian, Physican’s Assistant, Osteopathic Physician, Chiropractor", "Athletic Trainer, Certified Prosthetist, Ergonomics R&D, Physical/Occupational Therapist, Recreation Therapist.", "Coaching (high school, community college, university), Strength & Conditioning, Athletic Director, Sports Marketing, Public Relations, Sports Officiating"], "department": "Kinesiology and Athletics Department", "university": "Santa Monica College", "programs": [{"title": "Kinesiology and Athletics Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Santa Monica College business students are the face of transformation and change. Curious and innovative, our students are ahead of the curve when it comes to engagement, critical thinking, and creative solutions. Situated in the heart of Silicon Beach, industry leaders recognize our programs and our graduates for taking cutting edge approaches to real-world problems.", "Whether you are a first-time student or changing careers, our business programs equip you with the expert knowledge, current tools and applied training you need to build or advance your career.", "Instructors focus on job-specific skills that employers value including:", "We offer a range of education options including Associate in Science degrees and certificate programs across many concentrations."], "department": "Business Department", "university": "Santa Monica College", "programs": [{"title": "Accounting", "degree": "Associate of Science Degree - Accounting", "requirements": "28 units + General Education Requirements", "description": "This program is for bookkeepers and accounting clerks who want to advance to a higher professional level. Business owners can strengthen their businesses with best ethical practices and compliance with current accounting standards and laws. Accountants may acquire specialized knowledge of accounting which includes the setting up and designing of an effective accounting system, the interpretation, and preparation of financial and tax information, the reporting for business executives, partnerships, nonprofit and governmental agencies.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Accounting.aspx", "admission link": ""}, {"title": "Accounting", "degree": "Certificate of Achievement - Staff Accountant", "requirements": "16 units", "description": "This program is for bookkeepers and accounting clerks who want to advance to a higher professional level. Business owners can strengthen their businesses with best practices and compliance with current accounting standards and laws. Accountants may acquire specialized knowledge of accounting which includes the setting up and designing of an effective accounting system, and the interpretation and preparation of financial and tax information. Students completing this Certificate of Achievement may wish to pursue the Accounting Associate Degree by satisfying additional requirements.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Accounting.aspx", "admission link": ""}, {"title": "Accounting", "degree": "Certificate of Achievement - CPA Track Candidate", "requirements": "24 units", "description": "After completing this program, students possess a range of accounting skills and an understanding of all the concepts tested on the Certified Public Accounting exam. These include GAAP, cost accounting, accounting for income taxes, accounting ethics, professional auditing responsibilities and analysis of complex and advanced accounting topics. For information on the CPA exam, please see the California Board of Accountancy website (www.dca.ca.gov/cba/).", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Accounting.aspx", "admission link": ""}, {"title": "Accounting", "degree": "Department Certificate - Business Bookkeeping", "requirements": "12 units", "description": "The bookkeeping certificate program is designed to provide students with basic accounting skills and knowledge necessary to obtain entry-level accounting and other accounting support positions in small and medium-sized businesses.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Accounting.aspx", "admission link": ""}, {"title": "Business", "degree": "Associate in Science for Transfer - Business Administration", "requirements": "23 units + General Education Requirements", "description": "If you are considering a transfer to a UC, private, or out-of-state university, please consult a counselor before applying to transfer, as that institution’s transfer requirements might be different from those required for the AS-T in Business Administration.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Business.aspx", "admission link": ""}, {"title": "Business", "degree": "Associate in Science Degree - Business", "requirements": "24 units + General Education Requirements", "description": "Your early courses will be in accounting and business fundamentals, then you’ll prepare yourself for a career in global or domestic business by focusing on a particular area of study, such as:", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Business.aspx", "admission link": ""}, {"title": "Business", "degree": "Associate in Science Degree - Management/Leadership", "requirements": "24 units + General Education Requirements", "description": "You’ll develop solid analytical skills, receive training in methods for resolving problems, and learn to plan and execute strategies in pursuit of large-scale organizational goals.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Business.aspx", "admission link": ""}, {"title": "Business", "degree": "Certificate of Achievement - Management/Leadership", "requirements": "24 units", "description": "This certificate is a short-term program designed to expose you equally to Accounting, Business, and Management Fundamentals.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Business.aspx", "admission link": ""}, {"title": "Business", "degree": "Department Certificate - Business Management", "requirements": "12 units", "description": "", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Business.aspx", "admission link": ""}, {"title": "Marketing", "degree": "Associate of Science - Sales and Promotion", "requirements": "24 units + General Education Requirements", "description": "This program will prepare you for careers in sales and other contemporary marketing responsibilities. Sales promotion techniques are examined as you develop skills in the modern sales process. Developing a strategic approach to customer relationship management and the lifetime value of the customer will equip you with the mindset to succeed in today’s dynamic marketplace.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Marketing.aspx", "admission link": ""}, {"title": "Marketing", "degree": "Certificate of Achievement - Sales and Promotion", "requirements": "24 units", "description": "Learn the skills needed in traditional advertising and social media to start a career in marketing.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Marketing.aspx", "admission link": ""}, {"title": "Marketing", "degree": "Certificate of Achievement - Marketing", "requirements": "21-24 units", "description": "Our department certificate is a focused short-term version  of the Certificate of Achievement designed to expose  students to the various aspects of Sales and Promotion and job opportunities.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Marketing.aspx", "admission link": ""}, {"title": "Marketing", "degree": "Department Certificate - Sales and Promotion", "requirements": "12 units", "description": "Our department certificate is a focused short-term version  of the Certificate of Achievement designed to expose  students to the various aspects of Marketing  and job opportunities.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Marketing.aspx", "admission link": ""}, {"title": "Marketing", "degree": "Department Certificate - Business Marketing", "requirements": "12 units", "description": "", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Marketing.aspx", "admission link": ""}, {"title": "Global Trade and Logistics", "degree": "Associate of Science - Logistics and Supply Chain Management", "requirements": "24 units + General Education Requirements", "description": "This program provides students the opportunity to develop skills in the growing field of logistics and supply chain management. Students will learn about the flow and movement that organizations utilize to produce and deliver their products and services. Logistics and supply chain touches all aspects of a company’s operations—from the movement of raw materials, energy, goods, money, [people, satellites, information and an array of operational tools. Our logistics’ and supply chain management degree will prepare you for a career in the growing field of Global Trade and Logistics/Supply Chain.  Our program partners with PRO-GTL to enhance education and business partnerships for optimal job opportunities.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Global-Trade-and-Logistics.aspx", "admission link": ""}, {"title": "Global Trade and Logistics", "degree": "Certificate of Achievement - Logistics/Supply Chain Management", "requirements": "24 units", "description": "Our department certificate is a focused short-term version  of the Certificate of Achievement designed to expose  students to the various aspects of Logistics and Supply Chain Management and job opportunities.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Global-Trade-and-Logistics.aspx", "admission link": ""}, {"title": "Global Trade and Logistics", "degree": "Department Certificate - Business Logistics", "requirements": "12 units", "description": "After successful completion of the International Business Certificate program, the student demonstrates the skills, knowledge, and training for entry-level positions in multinational companies and incorporates the global business perspective into their current assignment. The student's knowledge and skills will include the ability to analyze global business opportunities as well as interact with others from different cultures. Individuals are able to prepare basic international commercial and shipping documents as well as to understand the issues that are involved in a global business operation. To gain a competitive edge in today's emerging marketplace, companies need professionals who know how to streamline diverse, supply-side activities on a global scale. If your aim is to extend your professional influence to the international market, the International Business Department certificate can help. Our program consists of, hybrid, online and on-ground classes to optimize your time and energy for a degree at Santa Monica College.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Global-Trade-and-Logistics.aspx", "admission link": ""}, {"title": "Global Trade and Logistics", "degree": "Certificate of Achievement - International Business", "requirements": "24 units", "description": "Our department certificate is a focused short-term version  of the Certificate of Achievement designed to expose  students to the various aspects of Internation Business and to enhance their global perspectives and competencies in the global business environment.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Global-Trade-and-Logistics.aspx", "admission link": ""}, {"title": "Global Trade and Logistics", "degree": "Department Certificate - International Business", "requirements": "12 units", "description": "", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Global-Trade-and-Logistics.aspx", "admission link": ""}, {"title": "Insurance", "degree": "Associate of Science - Insurance Professional", "requirements": "26-28 units + General Education Requirements", "description": "This program prepares students for highly skilled positions in the insurance industry, such as claims adjuster, examiner, investigator, salesperson, legal support worker or insurance underwriter. Course offerings include personal insurance, property and liability insurance, commercial insurance and ethics, among others.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Insurance.aspx", "admission link": ""}, {"title": "Insurance", "degree": "Certificate of Achievement - Insurance Professional", "requirements": "26-28 units", "description": "Our department certificate is a focused short-term treatment  designed to expose  students to the various aspects of Insurance  and job opportunities.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Insurance.aspx", "admission link": ""}, {"title": "Insurance", "degree": "Certificate of Achievement - Insurance Specialist", "requirements": "11 units", "description": "", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Insurance.aspx", "admission link": ""}, {"title": "Tax", "degree": "Small Business Tax Practice Department Certificate", "requirements": "16 credits", "description": "This program is intended for individuals to enter the tax profession and enable them to prepare tax returns for the general public. In addition, hands-on experience in the form of supervised tax preparation through an internship or SMC's Volunteer Income Tax Assistance (VITA) program provides real-world knowledge.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Tax.aspx", "admission link": ""}, {"title": "Administration of Justice", "degree": "Associate in Science for Transfer in Administration of Justice", "requirements": "18 units + General Education Requirements", "description": "This degree will prepare you for an entry-level position as a police officer, police assistant, community service officer, or a police reserve officer. Other options include positions in private security, parole, or federal law enforcement agencies.", "admission": "", "program link": "/AcademicPrograms/BusinessDepartment/Pages/Administration-of-Justice.aspx", "admission link": ""}]}, {"description": ["The Life Sciences Department offers background courses for students interested in careers in biological, medical, environmental, nutrition, and biotechnological sciences. We also offer a number of courses fulfilling general education requirements, as well as provide general interest courses to the community."], "department": "Life Sciences Department", "university": "Santa Monica College", "programs": [{"title": "Life Sciences Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["Welcome to the Communication & Media Studies Department", "At Santa Monica College, our students are award winning leaders across disciplines including communication studies, journalism, media and film. Our diverse and comprehensive programs provide students with many opportunities to learn, sharpen and apply real world skills. Students work under the direction of highly skilled instructors, many of whom are also industry professionals.", "We study various forms of communication including speech, news writing, media production, and broadcasting, and filmmaking and screenwriting, with an emphasis on career training.", "Instructors focus on transferable skills that both universities and employers value including:", "We offer a range of education options including Associate of Science degrees and certificate programs across many concentrations."], "department": "Communication and Media Studies Department", "university": "Santa Monica College", "programs": [{"title": "Film", "degree": "Associate of Arts in Film Production", "requirements": "24 units + General Education Requirements", "description": "This program will prepare you for careers in film production. You will learn about all the technical aspects of the field, including directing, editing, cinematography, sound design, and more. All of the production classes infuse theory throughout the curriculum.", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Film-Production.aspx", "admission link": ""}, {"title": "Film", "degree": "Certificate of Achievement in Film Production", "requirements": "24 units", "description": "In this program, you will approach cinema from several academic, theoretical, and critical approaches. The Film Studies program will empower you to explore the cultural, economic, and political implications of film as an art form.", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Film-Production.aspx", "admission link": ""}, {"title": "Film", "degree": "Associate of Arts in Film Studies", "requirements": "24 units + General Education Requirements", "description": "", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Film-Production.aspx", "admission link": ""}, {"title": "Film", "degree": "Certificate of Achievement in Film Studies", "requirements": "24 units", "description": "", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Film-Production.aspx", "admission link": ""}, {"title": "Journalism", "degree": "Journalism - Multimedia Storytelling - Associate in Arts", "requirements": "19 units + General Education Requirements", "description": "Upon completion of the program, students will be able to produce essential\nnonfiction storytelling techniques in print and multimedia formats, demonstrate the ability to work as a\nteam member to collaborate on media production across several formats and demonstrate an\nunderstanding of the ethical and legal issues affecting journalists.", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Journalism.aspx", "admission link": ""}, {"title": "Journalism", "degree": "Journalism - Associate in Arts for Transfer", "requirements": "18 units + General Education Requirements", "description": "This program teaches students the methods and techniques for gathering, processing and delivering news,\nand prepares students to be professional print and multimedia journalists. Included is instruction in news\nwriting and editing, reporting and multimedia story production, professional standards and ethics, and\njournalism history and research. Careers in this field include book editor, copywriter, film critic, foreign\ncorrespondent, freelance writing, online editor, multimedia story producer, journalist, magazine editor, news\nanchor, newspaper editor, publicist, sportswriter, and technical writer.", "admission": "", "program link": "/AcademicPrograms/Communication/Pages/Journalism.aspx", "admission link": ""}]}, {"description": ["Learn in-demand skills across computer programming, mobile app development, cloud computing, databases and networking, and cybersecurity", "Master Windows or Adobe application suites, become dexterous at managing social media SAAS programs or learn SEO applications", "Develop a competitive edge by learning current business software programs to help you move into office technology and administrative roles", "The CSIS Department site was designed by students of", "."], "department": "Computer Science & Information Systems Department", "university": "Santa Monica College", "programs": [{"title": "Computer Science", "degree": "Associate of Science Degree - Computer Programming", "requirements": "27 units + General Education Requirements", "description": "This program covers a broad spectrum of courses ranging from core computer science to a variety of branch fields of computer science. This major provides the student with the basic skills required of core computer science. Courses include programming in low-level and essential languages, Database Theory, Operating Systems Fundamentals, Computer Hardware, and Data Structures. Students finishing this major are well equipped to work in the field of computer science as well as transfer to a four-year degree program in this area.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Certificate of Achievement - Computer Programming", "requirements": "27 units", "description": "This program covers a broad spectrum of courses ranging from core computer science to a variety of branch fields of computer science. This major provides the student with the basic skills required of core computer science. Courses include programming in low-level and essential languages, Database Theory, Operating Systems Fundamentals, Computer Hardware, and Data Structures. Students finishing this major are well equipped to work in the field of computer science as well as transfer to a four-year degree program in this area.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Associate of Science Degree - Computer Science", "requirements": "34 units + General Education Requirements", "description": "This program develops user-friendly interfaces to database applications. A database application is made of data, a database engine to store the data, and an interface to extract and display the data. The skills needed to build a database application range from database theory and design, using a database engine such as SQL Server, or Oracle, to programming in ADO technologies to extract the data, as well as programming in Windows and Web applications on a client and server-side basis to present the data. In addition, with increasing concerns over security, a database developer must also be able to write secure code that runs with minimum risk of attacks.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Certificate of Achievement - Computer Science", "requirements": "34 units", "description": "This program helps to design and develop applications and scripts for the World Wide Web (WWW). Web programmers need to be knowledgeable on a variety of Internet technologies (HTML, CSS, XML, JavaScript, Perl/CGI, Java, JSP, PHP, and the Microsoft .Net platform), networking and database management. They are chiefly responsible for providing the programming which makes webpages interactive or allows users to interact with back-end applications and databases. Web programmers are instrumental in making electronic commerce on the Internet possible.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Associate of Science Degree - Database Applications Developer", "requirements": "33 units + General Education Requirements", "description": "This program provides the student with the basic skills needed to enter the world of programming. It covers a range of programming language courses that expose the student to the spectrum of different languages that are popular today.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Certificate of Achievement - Database Applications Developer", "requirements": "33 units", "description": "This program provides the industry standard skills to understand and develop applications for the cloud. Students learn a range of topics that cover the technical principals of the hardware and software requirements to run systems in the cloud including storage, database management, and software systems while maintaining secure access.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Associate of Science Degree - Web Programmer", "requirements": "30 units + General Education Requirements", "description": "This program aims to provide Computer Science students with the knowledge needed to develop Information Systems in a real-world setting. Students learn how to develop medium to large scale applications while applying the skills needed to plan and budget resources in development projects from conceptual design to deployment.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Certificate of Achievement - Web Programmer", "requirements": "30 units", "description": "This program provides students with the knowledge and skills necessary to work in the emerging mobile career field. Students learn how to design and write apps for the Android platform. In addition to programming courses, the program includes courses that teach the fundamentals of mobile app and icon design.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Computer Programming", "requirements": "12 units", "description": "This program provides students with the knowledge and skills necessary to work in the emerging mobile career field. Students learn how to design and write apps for the iPhone/iPad/iPod platform. In addition to programming courses, the program includes courses that teach the fundamentals of mobile app and icon design.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Cloud Computing", "requirements": "15 units", "description": "The IT world is integrated by networks. Success in IT disciplines like database, website, or e-commerce development demands a supporting grasp of the network environment. Major technologies are the networks themselves, their fit within the operating platforms they connect to, specific network applications, and measures to achieve networks security.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Information Systems Management", "requirements": "13 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Mobile Apps Development - Android", "requirements": "15 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Mobile Apps Development - iPhone", "requirements": "12 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Science", "degree": "Department Certificate - Networking", "requirements": "17 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Science.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Associate of Science - Business Information Worker", "requirements": "21 units", "description": "The Business Information Worker (BIW) program prepares students for entry-level office and administrative support in a variety of job positions, including general office clerks, retail salespersons, customer service representatives, receptionists, and information clerks. Students learn basic oral and written communications, basic computer application skills, including beginning Excel, Word, and Outlook, and the fundamentals of computer systems. Graduates of this program bring critical thinking and problem-solving skills as well as interpersonal skills essential to the workplace. With a solid foundation in Microsoft Windows and Office, as well as strong digital and web literacy skills, students will be prepared to meet the workforce demands of today's business environment.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Certificate of Achievement - Business Information Worker", "requirements": "21 units", "description": "The core of this certificate program provides advanced computer skills and business concepts that can be applied in nearly every industry. Students will learn to use Microsoft Office products, as well as other computer software applications, that can be applied in business situations to create, edit, format and publish documents, spreadsheets, presentations, and databases.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Associate of Science in Computer Business Applications", "requirements": "30 units + General Education Requirements", "description": "Students can select from three specializations within the Computer Business Applications Certificate program:", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Certificate of Achievement in Computer Business Applications", "requirements": "30 units", "description": "A Website Software Specialist needs to be knowledgeable in a variety of Internet technologies (HTML, CSS, JavaScript, and server-side scripting), as well as Web authoring applications such as Dreamweaver, Photoshop, and WordPress. They are primarily responsible for developing user-friendly and interactive Web pages, integrating and optimizing different multimedia components, and implementing hosting, publishing, and development workflow strategies.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Associate of Science - Website Software Specialist", "requirements": "31 units + General Education Requirements", "description": "This program provides students with the basic skills needed to create websites. Students will use Web authoring programs for Web page creation and site management. They will extend their skills in the development of websites through the use of XHTML, cascading style sheets, and client and server-side scripting. The focus will be on the creation of effective user interfaces and website design principles using various state-of-the-art technologies used for the Web. Upon completing this certificate, students will be ready to plan, build, promote, and maintain a personal website.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Certificate of Achievement - Website Software Specialist", "requirements": "31 units", "description": "This program provides students with the knowledge needed to develop website projects in a real-world setting. Students learn how to develop websites while applying the skills needed to plan and budget resources in development projects from conceptual design to deployment.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Department Certificate - Website Creator", "requirements": "15 units", "description": "This program provides students with specific skills that make them job ready for the publishing industry, whether it is for printing or the web. Digital Publishing Specialists use Adobe Photoshop, InDesign, and Illustrator programs, along with Microsoft Word, to format and combine text, numeral data, photographs, charts, drawings, and other visual graphic elements to produce digital and/or printed publication-ready materials.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Department Certificate - Website Development Management", "requirements": "13 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Computer Information Systems", "degree": "Department Certificate - Digital Publishing", "requirements": "17 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Computer-Info-Systems.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Associate of Science in General Office", "requirements": "27 units + General Education Requirements", "description": "This program provides training in common skills used in the business office - keyboarding, computer applications, English, accounting, and business communications. General office workers obtain employment in many environments: corporate settings, government, schools, and hospitals. Related job titles include administrative assistant, executive assistant, executive secretary, office assistant, and secretary. After gaining some work experience or specialized skills, many workers transfer to jobs with higher pay or greater advancement potential.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Certificate of Achievement in General Office", "requirements": "27 units", "description": "Legal administrative assistants perform the administrative tasks in a law office, such as answering the telephone, managing files, preparing law office correspondence and legal documents, and maintaining the calendar. Legal administrative assistants are in great demand. Qualified legal administrative assistants who have strong skills can find lucrative opportunities with law firms and corporate legal departments, government agencies, and a variety of business and industries -- such as banks, insurance companies, investment firms, and real estate companies.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Associate of Science - Legal Administrative Assistant", "requirements": "27 units + General Education Requirements", "description": "The certificate program prepares students to pursue employment as a legal administrative assistant. Training is provided in legal terminology, law office procedures, legal research, computer technology, machine transcription document preparation, keyboarding, and written and verbal communications.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Certificate of Achievement - Legal Administrative Assistant", "requirements": "27 units", "description": "This program prepares students for employment in a medical environment. Students develop skills and knowledge to perform a variety of duties to aid in the efficient workflow and operations of a medical-related facility. Coursework indicates medical terminology, computer technology, medical law and ethics, and “front office” tasks — such as patient scheduling, reception, coding and billing, transcription, and records management.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Associate of Science - Medical Administrative Assistant", "requirements": "33 units + General Education Requirements", "description": "Medical Coding and Billing Specialists are primarily responsible for submitting documentation of patient medical care to insurance companies. Duties include billing insurance companies and patients; collecting payment for services; and documenting tests, treatments, and procedures, using correct medical terminology—referred to as “coding.” This program provides the training that is required to perform these duties.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Certificate of Achievement - Medical Administrative Assistant", "requirements": "33 units", "description": "Organizations need to process a rapidly growing amount of information. Data entry workers help ensure the efficient handling of information processing. Duties include inputting data into computers and performing editing, proofreading, and clerical tasks. This certificate program provides training in the essential skills to carry out these tasks. Job opportunities exist in part-time, full-time, and work-at-home positions. Data entry workers are known by various job titles, such as data entry clerk, data entry operator, data entry specialist, and clerk. Data entry jobs frequently serve as stepping stones to higher paying positions with increased responsibilities.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Associate of Science - Medical Coding and Billing Specialist", "requirements": "36 units + General Education Requirements", "description": "This program prepares students for entry-level clerical positions involving Electronic Health Records. Training is provided in computer basics, medical terminology, and electronic records technology. EHR clerks work in hospitals, physicians’ offices, and nursing homes—typically under the direction of a manager or supervisor.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Certificate of Achievement - Medical Coding and Billing Specialist", "requirements": "36 units", "description": "Coding is the transformation of healthcare diagnoses, procedures, medical services, and equipment into universal medical alphanumeric codes for statistical reporting and reimbursement purposes. A Hospital Inpatient Coder reviews and codes information for patients who stay at least overnight in a hospital facility. This certificate program provides training in medical terminology, inpatient coding, and billing, reimbursement, and collection procedures.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Clerical/Data Entry", "requirements": "12 units", "description": "Medical Billing/Coding workers are primarily responsible for submitting documentation of patient medical care to insurance companies. Duties include billing insurance companies and patients; collecting payment for services, and documenting tests, treatments and procedures, using correct medical terminology - referred to as \"coding\". The Medical Billing/Coding Certificate program provides the training that is required to perform these duties.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Electronic Medical Records Clerk", "requirements": "9 units", "description": "This program is ideal for students who want to learn the basic skills needed to become employed in a healthcare setting. This certificate prepares students for entry-level records management/receptionist positions in hospitals, nursing homes, physician offices, and service agencies. Coursework includes training in storing, retrieving, and maintaining medical records; front desk procedures; medical vocabulary; computer technology; keyboarding; and written and verbal communications. With experience and additional education, medical records clerk/receptionists may advance to senior clerks, registered health information technicians (RHIT's) registered health information administrators (RHIA's), consultants, and educators.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Hospital Inpatient Coder", "requirements": "9 units", "description": "This program prepares students to listen to dictated recordings made by physicians and other healthcare professionals and transcribe them into medical reports, correspondences, and other administrative material. Medical transcription is a particularly flexible career that easily lends itself to many different work styles. Medical transcriptionists work in hospitals, physicians' offices, transcription service offices, clinics, laboratories, and at home. With experience, medical transcriptionists can advance to supervisory positions, home-based work, editing, or consult.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Medical Billing/Coding", "requirements": "15 units", "description": "This program prepares students for both entry-level and advanced word processing positions in a variety of office settings. It also serves as a foundation for specialization in fields such as legal transcription and desktop publishing. The Word Processing Certificate includes courses in rapid and accurate keyboarding, document editing and formatting, advanced word processing techniques, English Skills for the Office and an overview of the Microsoft Office Suite.", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Medical Records Clerk/Receptionist", "requirements": "15 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Medical Transcription", "requirements": "15 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}, {"title": "Office Technology", "degree": "Department Certificate - Word Processing", "requirements": "12 units", "description": "", "admission": "", "program link": "http://www.smc.edu/AcademicPrograms/CSIS/Pages/Office-Technology.aspx", "admission link": ""}]}, {"description": ["Santa Monica College's Fashion Design and Merchandising department offer an exciting and rapidly growing program with the enormous application and design potential within the industry. Our program meets the needs of a diverse student body with means to such goals as A.A. degrees, transfers to major universities, and skills development and updating."], "department": "Fashion Design Department", "university": "Santa Monica College", "programs": [{"title": "Fashion Design Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["include linguistics and 14 different modern languages for you to choose from. We provide a wide array of courses for beginning to advanced levels, that will allow you to develop and enhance your language skills, and study literature, culture, and even business practices. Our courses prepare students for transfer to the UC and CSU systems as well as other public and private colleges in and out of California. They address a wide range of our students’ interests and goals, from personal fulfillment to pursuing a major or minor in a language discipline. We also offer", "in Asian Studies, African and Middle Eastern Studies, and Latin American Studies. These certificates serve as launching pads for our students to further their education in a chosen area or to be better positioned to meet the demands of today's multilingual workplace."], "department": "Modern Language and Cultures", "university": "Santa Monica College", "programs": [{"title": "Modern Language and Cultures", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Health Sciences Department at Santa Monica College offers programs that prepare students for careers in Nursing and Allied Health Professions.", "Currently, the two programs offered are an Associate Degree Nursing Program that prepares students to meet the standards of the California Board of Registered Nursing and an Associate Degree Respiratory Therapy Program that prepares students to meet Advanced Practice standards of the National Board for Respiratory Care.", "For more information about our graduation rates, the median debt of students who completed the program, and other important information regarding gainful employment, visit", "."], "department": "Health Sciences Department", "university": "Santa Monica College", "programs": [{"title": "Health Sciences Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}, {"description": ["The Philosophy and Social Science Department includes courses that focus on the scientific study of human thought and behavior, interpersonal relationships, and the institutional structure and functioning of human society.", "The Department hopes to produce liberally educated students who not only think critically but also consider the ethical implications of their decisions. The department is distinctive in its interdisciplinary approach to understanding, analyzing and critiquing the historical, social, political, economic, and cultural condition of women and people of color in our local community, California, the U.S. and globally.", "The department is committed to race/ethnic, class and gender equitable learning, teaching and community engagement. Many of our courses rely on Service Learning, which is a teaching and learning strategy through which students apply their academic skills and knowledge to address real-life needs in their own communities. Service Learning provides a compelling reason to learn and teaches the skills of civic participation and develops an ethic of service and civic responsibility."], "department": "Philosophy and Social Sciences Department", "university": "Santa Monica College", "programs": [{"title": "Philosophy and Social Sciences Department", "degree": "", "requirements": "", "description": "", "admission": "", "program link": "", "admission link": ""}]}]