[
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Accounting",
        "abbr": [
            "ACTG"
        ],
        "courses": [
            {
                "abbr": "ACTG",
                "type": "Lower-Division",
                "id": "5",
                "title": "Personal Financial Planning",
                "description": "Overview of the tools and information necessary for personal business decision making. Includes analysis of financial services, credit and borrowing, taxes, compensation planning, consumer purchases, housing decisions, the time value of money, savings, and investments. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ACTG",
                "type": "Lower-Division",
                "id": "11",
                "title": "Introduction to Financial Accounting",
                "description": "Overview of the role of financial information in economic decision making. Includes topics such as the dissemination of accounting information and its impact on capital markets, and the analysis of corporate annual reports. Coverage of financial statements and their use in determining profitability and the financial condition of a business entity. Prerequisites: Must be a second-year student and have completed BUSN 70 or 170. Seniors who have not completed BUSN 70 may take this class with department permission on a space-available basis. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ACTG",
                "type": "Lower-Division",
                "id": "12",
                "title": "Introduction to Managerial Accounting",
                "description": "Introduction to the role of financial information in the decision making of business managers. The objective is to investigate the use of business data in typical managerial functions such as planning, control, and making operational decisions. Prerequisite: ACTG 11. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ACTG",
                "type": "Lower-Division",
                "id": "20",
                "title": "Recording Financial Transactions",
                "description": "Insight into the basic principles and mechanics behind the preparation of financial statements. Focus is on the accounting model, accrual versus cash accounting, and the accounting processing cycle. Prerequisites: ACTG 11 and must have 70 completed units or department&aposs permission prior to enrollment. Course may not be taken before spring quarter of the sophomore year. For fall and winter enrollment, students must be concurrently enrolled in ACTG 130. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "130",
                "title": "Intermediate Financial Accounting I",
                "description": "An in-depth study of the concepts underlying external financial reporting, along with expanded coverage of basic financial statements. Detailed analysis of the measurement and reporting of current assets, operational assets, and investments, including the treatment of related revenues and expenses. Significant attention is given to income statement presentation and revenue recognition. Prerequisites: Open to business majors only. ACTG 12 and 20, and must have 96 completed units or department&aposs permission prior to enrollment. (ACTG 20 may be taken concurrently.) (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "131",
                "title": "Intermediate Financial Accounting II",
                "description": "Intensive analysis of generally accepted accounting principles as applied to accounting for liabilities, stockholders&apos equity, and the statement of cash flows. Accounting for income taxes, pensions, leases, and the reporting of corporate earnings per share. Prerequisite: Open to business majors only. ACTG 130. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "132",
                "title": "Advanced Financial Accounting",
                "description": "The main subject is accounting for business combinations, and the consolidation of financial statements of a parent company and its subsidiaries. A broad spectrum of financial reporting issues in the context of consolidated financial statements is examined. The course also covers partnership accounting and other advanced financial accounting topics. Prerequisite: Open to business majors only. ACTG 131. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "134",
                "title": "Accounting Information Systems",
                "description": "Introduction to procedures by which accounting data is captured, processed, and communicated in computerized information systems. The course describes the ways that accounting information systems are designed, used, and maintained by accounting professionals with an emphasis on the internal controls over such systems. Prerequisites: Open to business majors only. ACTG 11 and 12. (ACTG 12 may be taken concurrently.) (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "135",
                "title": "Auditing",
                "description": "Introduction to the basic concepts of auditing. Discussion of applicable regulations, the audit risk model, and client risk assessment. Focus is on an overview of the audit process. Auditors&apos professional and ethical responsibilities, sampling, and historical cases will also be discussed. Prerequisite: Open to business majors only. ACTG 131. (ACTG 131 may be taken concurrently.) (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "136",
                "title": "Cost Accounting",
                "description": "Analysis of cost accounting with a strategic emphasis. Selected topics include process costing, activity-based costing, variance analysis, joint cost allocations, and the Theory of Constraints. Prerequisite: Open to business majors only. ACTG 130. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "138",
                "title": "Tax Planning and Business Decisions",
                "description": "A basic introduction to the tax treatment of transactions and events affecting both individuals and businesses and the conceptual framework underlying taxation. Includes issues of importance for successful tax planning with an emphasis on income and expense recognition, individual taxation, and property transactions. Assumes no prior knowledge of the tax law. Prerequisites: Open to business majors only. ACTG 11 and 12. (ACTG 12 may be taken concurrently.) (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "140",
                "title": "Government and Nonprofit Accounting",
                "description": "Accounting and reporting requirements used by government and not-for-profit (NPO) entities. For governmental accounting, the class focuses on the categorization of the major government fund types and the terminology associated with Governmental Accounting Standards Board (GASB) Generally Accepted Accounting Principles (GAAP). For NPO accounting, the class focuses on the provisions of FAS 116 and FAS 117. Recommended for students taking the Certified Public Accountant (CPA) Exam. Prerequisites: Open to business majors only. ACTG 131. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "142",
                "title": "Business Law for Accountants",
                "description": "Legal theory and mechanisms designed to facilitate commercial transactions within our society. Areas covered include those dealing with integral aspects of business transactions: business organizations; contract and sales law; commercial paper; and secured transactions. Recommended for students taking the CPA Exam. Prerequisite: ACTG 131. Restricted to junior- and senior-declared accounting majors. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "144",
                "title": "Accounting Ethics",
                "description": "This course is designed with a particular focus on the roles and ethical responsibilities of the accounting, auditing, and tax professions; ethical behavior by management; and the legal guidelines that address behavior in a business setting. Prerequisites: Open to business majors only. ACTG 11 and 12, and either PHIL 26 or MGMT 6. This course must be taken for a letter grade. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "148",
                "title": "Taxation of Business Entities",
                "description": "An advanced tax course covering the income tax treatment of transactions involving various types of business entities. Topics include the taxation of corporate entities (both C and S corporations) as well as partnerships. Addresses tax issues related to estates and trusts. Includes calculation of current and deferred taxes and the study of common tax issues arising in multinational transactions. Prerequisites: Open to business majors only. ACTG 131 and 138. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "150",
                "title": "Financial Fraud: Detection and Investigation",
                "description": "Forensic accounting deals with the application of accounting methods to legal problems, and comprises investigative accounting and litigation support activities. Investigative accounting (usually referred to as fraud accounting) refers to the role of the accountant in determining the existence and extent of asset misappropriation and/or financial statement fraud. Litigation support activities include those professional services provided by accountants to attorneys in support of civil or criminal litigation. In addition to examining both aspects of forensic accounting, the legal system and the role of the forensic accountant as an expert witness will be discussed. Prerequisite: Open to business majors only. ACTG 131. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "151",
                "title": "Financial Statement Analysis",
                "description": "Provides a framework for analyzing financial statements and develops skills useful in evaluating company performance, liquidity, solvency, and valuation in the context of the company&aposs strategy and competitive environment from a user perspective. Prerequisites: Open to business majors only. ACTG 11 and FNCE 121 or 121S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "152",
                "title": "International Accounting and Financial Reporting",
                "description": "Understanding similarities and differences in financial reporting practices globally is vital for all organizations involved in international business. The course takes a user perspective to international financial reporting. It examines economic and social factors that affect financial reporting practices, classifies global patterns in financial reporting, and studies the effect of the diversity in financial reporting on corporate investment and financing decisions. Technical issues covered include accounting for foreign currency transactions, accounting for the effects of inflation, international transfer pricing, and international financial statement analysis. Prerequisites: Open to business majors only. ACTG 130 and MGMT 80. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "155",
                "title": "Financial Information Systems",
                "description": "Course focuses on computer-based financial information systems that allow finance and accounting professionals to acquire and manage a company&aposs financial system. Topics include the business functions of a financial information system, the technical aspects of the system, and the management issues of implementing such a system. Students will acquire hands-on experience using ERP systems. Students who receive credit for OMIS 150 may not take this course for credit. Also listed as OMIS 150. Prerequisites: OMIS 30 or 31, and OMIS 105. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "161",
                "title": "Junior Contemporary Business Seminar Series I",
                "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor, attend seminars sponsored by the Department of Accounting, or choose additional acceptable seminars and presentations offered throughout the University. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 12 and 20. (ACTG 20 may be taken concurrently.) (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "162",
                "title": "Junior Contemporary Seminar Series II",
                "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor, attend seminars sponsored by the Department of Accounting, or choose additional acceptable seminars and presentations offered throughout the University. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 12 and 20. (ACTG 20 may be taken concurrently.) (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "171",
                "title": "Senior Contemporary Business Seminar Series I",
                "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor, attend seminars sponsored by the Department of Accounting, or choose additional acceptable seminars and presentations offered throughout the University. Prerequisite: Open only to senior-declared accounting and accounting and information systems majors. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "172",
                "title": "Senior Contemporary Business Seminar Series II",
                "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor, attend seminars sponsored by the Department of Accounting, or choose additional acceptable seminars and presentations offered throughout the University. Prerequisite: Open only to senior-declared accounting and accounting and information systems majors. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "191",
                "title": "Peer Educator in Accounting",
                "description": "Work closely with the department to help students in core accounting classes, understand course material, think more deeply about the material, and feel less anxious about testing situations. Prerequisites: Declared accounting major and permission of instructor and chair required prior to enrollment. (1 or 2 units)",
                "units": "1 or 2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "194",
                "title": "Accounting Case Analysis",
                "description": "A practicum in which students form teams, research accounting issues, present the results of their research, and explain their research recommendations before a panel of judges. This course may be repeated for credit. Prerequisite: Enrollment is by permission of the department chair. (1 or 2 units)",
                "units": "1 or 2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "197",
                "title": "Special Topics in Accounting",
                "description": "Offered occasionally to introduce new topics not covered by existing electives. Consult quarterly schedule of classes for description. Prerequisite: ACTG 131. (2--5 units)",
                "units": "2--5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "198",
                "title": "Accounting Internship",
                "description": "Opportunity for upper-division students to work in local accounting or corporate firms. Two written reports and the employer&aposs evaluation of the student&aposs work will be required. This course may be repeated for credit depending on nature of assignment. Prerequisites: Declared accounting major and permission of instructor and chair. (2--5 units per quarter, up to a maximum of 10 units)",
                "units": "2--5 units per quarter, up to a maximum of 10 units"
            },
            {
                "abbr": "ACTG",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Prerequisites: Declared accounting major and permission of instructor and chair. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "2300",
                "title": "Financial Accounting",
                "description": "Introduces the roles, concepts, principles, legal requirements, and impacts of external financial reporting. Covers basic financial statements and the analysis and recording of transactions, with a focus towards interpretation of reported results. Studies the more common and significant transactions impacting firms. Open to MSF students only. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "2301",
                "title": "Financial and Managerial Accounting",
                "description": "This course combines an introduction to financial and managerial accounting to assist students in understanding how these disciplines contribute to the success of the firm. It will focus on the interpretation of reported financial information and how these disciplines contribute to decision-making in the firm. Open to MSIS students only. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3000",
                "title": "Financial Accounting",
                "description": "Introduces the roles, concepts, principles, legal requirements, and impacts of external financial reporting. Covers basic financial statements and the analysis and recording of transactions, with a focus towards interpretation of reported results. Studies the more common and significant transactions impacting firms. Prerequisites: None (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "2303/3303",
                "title": "Corporate Financial Reporting",
                "description": "An in-depth study of the concepts underlying external financial reporting, along with expanded coverage of basic financial statements, detailed analysis of measuring and reporting assets, liabilities, shareholders&apos equity, and related revenues and expenses. Takes a decision-making perspective by framing the financial reporting function of accounting in the context of the decision-support role it serves. Prerequisite: ACTG 2300 or ACTG 3100 or ACTG 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3317",
                "title": "Taxation and Personal Business Strategy",
                "description": "Builds a strong foundation of basic principles, transactions, and concepts for the taxation of individuals. Includes analysis of various tax policies and procedures and their economic impact. Does not include coverage of the taxation of business entities (e.g., corporations). Assists in providing the competitive advantage that comes from understanding the importance of tax provisions applicable to successful personal tax planning and minimization. Prerequisite: ACTG 2300 or ACTG 3100 or ACTG 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3319",
                "title": "Financial Statement Analysis",
                "description": "Analyzes financial statements and footnote disclosures. Focuses on (1) developing a framework that interprets financial statements as a reflection of a company&aposs industry, business strategy, and competitive environment; and (2) showing how decision makers can use financial data to evaluate a company&aposs performance, liquidity, solvency, and valuation. Prerequisite: FNCE 451 or FNCE 3452 or FNCE 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3321",
                "title": "Fundamental Value Analysis",
                "description": "Provides a framework for forecasting financial statements and using these forecasts to determine the fundamental value of the company. Emphasizes relating a firm&aposs business strategy, growth prospects, and the sustainability of its competitive advantage to its financial ratios and intrinsic value. Prerequisite: FNCE 451 or FNCE 3452. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3701",
                "title": "Accounting for Financial Planning and Analysis",
                "description": "This course focuses on the operational side of financial planning and analysis, including new product introduction, product costing, relevant costing decisions, and the systems and tools used to support a production environment. Prerequisite: ACTG 2300 or ACTG 3100 or ACTG 3000 (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "3702",
                "title": "Business Planning and Analytics",
                "description": "This course focuses on the operational side of financial planning and analysis, including new business planning, cost management, margin analysis, and performance management. Prerequisite: ACTG 2300 or ACTG 3100 or ACTG 3000. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ACTG",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "Covers special topics. Offered on an occasional basis. (3 units)",
                "units": "3 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Management",
        "abbr": [
            "MGMT"
        ],
        "courses": [
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "6",
                "title": "Business Ethics",
                "description": "A normative inquiry into the ethical issues that arise in business and how they should be managed. Attention is given to current moral issues in business, to ethical theories and their implications for these issues, and to the managerial implications. Topics may include truth in advertising, corporate social responsibility, affirmative action, government regulation of business, quality of work-life, environmental and resource issues, and ethical codes of conduct. Students who take PHIL 26 may not take this course for credit. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "6H",
                "title": "Business Ethics",
                "description": "Honors section. A normative inquiry into the ethical issues that arise in business and how they should be managed. Attention is given to current moral issues in business, to ethical theories and their implications for these issues, and to the managerial implications. Topics may include truth in advertising, corporate social responsibility, affirmative action, government regulation of business, quality of work-life, environmental and resource issues, and ethical codes of conduct. Students who take PHIL 26 may not take this course for credit. Prerequisite: Enrollment restricted to students in the University Honors or Leavey Scholars programs. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "40",
                "title": "Foundational Knowledge of Managing for Sustainability",
                "description": "This course examines the foundational knowledge required of individuals who seek to effectively manage organizations meet the triple bottom line: social, economic, and environmental sustainability. Students will learn the concepts critical for understanding sustainability from biological, economic, and social perspectives. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "41",
                "title": "Foundational Skills of Managing for Sustainability",
                "description": "This course reviews and teaches students the foundational skills required of individuals who seek to effectively manage organizations meet the triple bottom line: social, economic, and environmental sustainability. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "42",
                "title": "Leading from the Triple Bottom Line",
                "description": "The focus of this 4-unit course is the successful application of the required knowledge and skills found to be necessary for professionals to successfully advance sustainability in organizations and communities. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Lower-Division",
                "id": "80",
                "title": "Global and Cultural Environment of Business",
                "description": "An examination of the basic conceptual vocabulary and theories regarding the economic, political, and social influences on international business today. Topics may include international trade, financial systems, political institutions, cultural factors, corporate structure, and market entry. Students who take this class may not receive credit for MGMT 80L taken in the Santa Clara London Program, or any equivalent course taken in a study abroad program. Prerequisites: BUSN 70 or 170, and ECON 3. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "160",
                "title": "Management of Organizations",
                "description": "Introduction to organization theory and practice with an emphasis on organizational behavior, inclusive of the contexts of the individual, the group, and the organization as a whole. Prerequisite: Students must have completed 60 units. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "160S",
                "title": "Management of Organizations",
                "description": "Introduction to organization theory and practice with an emphasis on organizational behavior, inclusive of the contexts of the individual, the group, and the organization as a whole. Prerequisites: Open only to students in the Leavey Scholars Program. Students must have completed 60 units. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "162",
                "title": "Strategic Analysis---The Business Capstone",
                "description": "Focuses on the processes by which managers position their businesses or assets to maximize long-term profits in the face of uncertainty, rapid change, and competition. Covers various frameworks for analyzing an industry&aposs structure and a firm&aposs competitive position, and for developing a coherent, viable, and defensible firm strategy. Requires students to integrate and extend the knowledge and skills that they have developed throughout their coursework (i.e., marketing, finance, economics, organizational behavior, ethics, information systems, statistical analysis, operations management, accounting, etc.) into a \"total\" business perspective. Prerequisites: ECON 41 and 42 or OMIS 41; FNCE 121 or 121S; MGMT 80, 160, or 160S; MKTG 181 or 181S; and senior standing. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "162S",
                "title": "Strategic Analysis---The Business Capstone",
                "description": "Focuses on the processes by which managers position their businesses or assets to maximize long-term profits in the face of uncertainty, rapid change, and competition. Covers various frameworks for analyzing an industry&aposs structure and a firm&aposs competitive position and for developing a coherent, viable, and defensible firm strategy. Requires students to integrate and extend the knowledge and skills that they have developed throughout their coursework (i.e., marketing, finance, economics, organizational behavior, ethics, information systems, statistical analysis, operations management, accounting, etc.) into a \"total\" business perspective. Enrollment restricted to students in the Leavey Scholars Program. Prerequisites: ECON 41 and 42 or OMIS 41; FNCE 121 or 121S; MGMT 80, 160, or 160S; MKTG 181 or 181S; senior standing; and a minimum 3.5 cumulative GPA. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "164",
                "title": "Introduction to Entrepreneurship",
                "description": "The practice of business innovation and entrepreneurship with an emphasis on assessing needs, developing products or services, and communicating ideas. Prerequisites: ACTG 11 and MKTG 181. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "165",
                "title": "Building a Business",
                "description": "Extends notions of entrepreneurship to building a viable business by focusing on developing business plans and identifying opportunities for growth. Prerequisite: MGMT 164. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "166",
                "title": "Human Resource Management",
                "description": "Comprehensive review of the role and functions of human resource management departments in business organizations, with particular emphasis on selection and placement, training and development, and compensation systems. Prerequisite: MGMT 160 or 160S, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "169",
                "title": "Business and Public Policy",
                "description": "The impact of public policy on business and how businesses adapt to and influence public policies. Includes ideology, corporate social responsibility, government regulations, and business political activity. Lectures/discussions; case analyses. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "170",
                "title": "International Management",
                "description": "The international framework for trade and international investment, a critical discussion of the idea of globalization, the design and staffing of multinational organizational structures, and multinational strategies. Prerequisite: MGMT 80. MGMT 160 or 160S recommended. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "171",
                "title": "Managerial Communication",
                "description": "Interpersonal and small-group communication. Negotiating behavior. Oral and written communication. Integrates theory and skill-building through reading, case analysis, and practice. Prerequisite: MGMT 160 or 160S, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "172",
                "title": "Social Entrepreneurship",
                "description": "This course focuses on emerging models of enterprise at the interface of the public, private, and nonprofit sectors. It examines theories of change and the dynamics of social innovation and develops both conceptual and practical tools for creating high performance organizations that are capable of addressing seemingly intractable problems in a financially sustainable manner. Analysis of exemplary social business ventures, including alumni cases from the Global Social Benefit Incubator, will illustrate how the discipline of business planning can contribute the development of social ventures that are economically viable at scale. Students will apply this knowledge to the writing and analysis of a case on an actual social business. Prerequisite: Students must have completed 87.5 units. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "173",
                "title": "Resources, Food, and the Environment",
                "description": "Exploration of relationship among food production, resource use, and the environment. Topics include biotechnology, the green revolution, resource depletion, environmental degradation, and food safety. Also listed as ECON 101. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "174",
                "title": "Social Psychology of Leadership",
                "description": "A conceptual framework for understanding leadership and opportunities for developing leadership skills. This interactive course requires personal reflection into leadership experiences and fieldwork with executives. Note: This course is required for those completing the Leadership Studies Certificate Program. Prerequisite: Students must have completed 87.5 units. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "175",
                "title": "Managing Family Businesses",
                "description": "Issues include managerial and ownership succession, conflicts between family and nonfamily members, and conflicts between family and business cultures. Students will apply organizational behavior concepts to family business issues and develop a useful framework for analyzing and anticipating those issues. Class design incorporates cases, videos, and guest speakers. Prerequisite: MGMT 160 or 160S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "177",
                "title": "Globalization and the Cultures of Innovation and Entrepreneurship",
                "description": "This course introduces students to the skills, practices, and processes for understanding and managing innovation and entrepreneurship activities that span cultures throughout the world. These cultural challenges include developing a deep understanding of the needs of customers in emerging markets, producing goods and services with global teams, and outsourcing manufacturing operations. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "179",
                "title": "Project Management",
                "description": "Students will learn how to plan and manage a project. The course covers methods for creating a work breakdown structure and project schedule; estimating a project&aposs budget; and managing a project&aposs quality, schedule, and financial targets. Course activities include a project management computer simulation, and a directed team project that connects the students with a practicing project manager for applying the methods learned. Much of the course materials will be based on the Project Management Institute&aposs (PMI) Body of Knowledge, which is used for PMI certification. This course can be a first step toward certification. Prerequisite: MGMT 160 or 160S, or permission of the instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "180",
                "title": "Negotiation Skills in Business",
                "description": "We negotiate every day, at work, and in our personal lives. The overall goal of this course is to create a learning community where we can all improve our understanding of both the art and the science of negotiation. By learning about the research-based theories of negotiation, students will gain analytic skills in understanding negotiation principles. In preparing for the role plays assigned, students will practice selecting appropriate negotiation strategies for different contexts. By practicing negotiation in a number of different behavioral simulations, and reflecting critically on simulation outcomes, students will gain practical skills in influencing others to secure productive agreements through negotiation. Prerequisite: MGMT 160, may be taken concurrently with instructor permission. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "181",
                "title": "Conscientious Capitalism",
                "description": "The foundation of Conscientious Capitalism is: \"To lead others, I will first learn to lead myself.\" The course is designed to inspire and teach students the role of Purpose, Virtue, Intentionality, Tenacity, and Accountability in their leadership journey. The course uses three distinct but related activities to achieve this goal. Nationally renowned business, military, and civic leaders share the experiences and challenges that shaped them, their careers, and major decisions. The goal of having iconic leaders share with honesty and vulnerability is to inspire students to do the same in the course and their lives. Harvard Business School cases give students the opportunity to learn from the most critical business and policy decisions of our times. Putting students in the role of decision-maker challenges them to understand the complexity of decision making and leadership, and begins to train them for their careers post SCU. Leadership Development Teams (LDTs) are small mentored groups. The goal is for students to explore and share their authentic selves and develop the courage to live as their authentic selves in their careers and lives. Note: We seek evidence of a student&aposs ambition to make an impact and the hunger and maturity to pursue the journey of self-awareness, authenticity, and courageous action. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "197",
                "title": "Special Topics in Management",
                "description": "Offered occasionally to introduce new topics not covered by existing electives. Topics generally reflect the research interests of the faculty teaching the course. Prerequisite: MGMT 160 or 160S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "198",
                "title": "Internship/Practicum",
                "description": "Opportunity for selected upper-division students to work in local organizations. Prerequisites: MGMT 160 or 160S, and two courses from the following list: MGMT 166, 169, 170, 171, 172, 173, 174, 175, 177. Students must have completed 60 units and have the approval of the undergraduate committee one week prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "198E",
                "title": "Entrepreneurship Internship",
                "description": "An extended opportunity for students accepted into the entrepreneurship minor program to apply their entrepreneurial knowledge and skills in emerging or growing companies through a structured placement in Silicon Valley. Prerequisites: MGMT 164 and must have a declared entrepreneurship minor. MGMT 165 may be taken concurrently. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Prerequisites: MGMT 160 or 160S, and a written proposal must be approved by instructor and chair one week prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2501",
                "title": "Building and Leading High-Performance Teams and Organizations",
                "description": "Explores the dimensions underlying interpersonal and team performance, and how to work effectively within particular organizational designs. Provides students with the background to be successful managers and the foundations for building successful teams and organizations. Open to M.S. students only. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2504/3504",
                "title": "Innovation in Silicon Valley and Beyond",
                "description": "The course will cover the skills, practices and processes for understanding and managing technology and innovation in fast paced environments. The course delivery is informed by extant foundational and emerging empirical work in innovation. This course will complement content in elective courses (product marketing, product development, and intellectual property, small business entrepreneurship) and core courses in strategy. Prerequisite: MGMT 503 or MGMT 2501 or MGMT 3502 or MGMT 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2505",
                "title": "Business, Integrity and Society",
                "description": "This course focuses on the interplay between business and society, and examines managerial decision-making. The course challenges students to think about the role that business plays in society, and examines how organizations can help improve people&aposs lives across the globe. The course also analyzes the root causes of corporate disasters and failures and looks at the role of human psychology therein. Students will be stimulated to think critically about their own ethical reasoning and will learn intervention strategies that may help to mitigate ethical risk factors in their own organization. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3200",
                "title": "Ethics for Managers.",
                "description": "This course is an introductions to business ethics that focuses specifically on the kinds of ethical issues that managers typically encounter. Course topics include the psychological factors that influence moral decision-making, normative approaches for dealing with ethical issues in management, and application of these concepts to cases describing real life ethical dilemmas managers have faced in a variety of organizational and environmental settings. Prerequisites: None. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3519/3050",
                "title": "Strategic Analysis",
                "description": "This course focuses on the processes by which managers position their businesses to develop and sustain an advantage relative to rivals in the face of uncertainty, rapid change, and competition. Strategy involves understanding the utility of different choices and tradeoffs – choosing what not to do is as important as choosing what to do. As a result, the course covers a variety of tools, frameworks, theories and concepts for analyzing a firm&aposs strategic position and the environment in which it is operating. By focusing on the factors that make some strategic positions strong and viable, students will develop the ability to evaluate the effects of changes in resources & capabilities, industry forces, macro environmental forces, and technology on industry structure and firm behavior and, in turn, on a firm&aposs opportunities for establishing and sustaining a superior position relative to rivals. The course also requires that students integrate and extend the knowledge and skills they have developed throughout their MBA program course work (i.e. marketing, finance, economics, organizational behavior, ethics, information systems, accounting, etc.) into a \"total\" business perspective. Analyzing real world situations best facilitates this activity; therefore, case analysis plays a large role in the course. Students will develop skills in developing a coherent, social responsible, viable and defensible strategic position that will carry a firm into the future. Prerequisites: Completion of all core courses. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "Practice",
                "title": "and Morality of Leadership",
                "description": "Investigates and examines priorities of exemplary leaders. Emphasizes developing conceptual understanding of the leadership process and on building leadership skills. Classes are often experiential and highly reflective, using written and video case studies. Some team assignments may be made. Prerequisite: MGMT 2501 or MGMT 3500 or MGMT 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3514",
                "title": "International Management",
                "description": "Encourages an understanding of the complexities of the global landscape and teaches the skills to analyze cross-border competition. While some argue that globalization has eliminated differences between nations and made the world one large market so that, as one journalist asserts, the \"world is flat,\" this course will show that the reality is far more complicated. To deal with this complexity, firms, first, require leaders who are sensitive to and can bridge differences in culture and systems of government and, second, must innovate in new ways that leverage differences in economics and culture. Prerequisite: MGMT 2501 or MGMT 3502 or MGMT 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3516",
                "title": "Organizational Politics",
                "description": "Explores the use of influence and political skills in leadership and organizational decision-making. Emphasizes innovation and the politics of change. Prerequisite: MGMT 2501 or MGMT 3500 or MGMT 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3526",
                "title": "Strategic Talent Management",
                "description": "Focuses on the strategic role of talent management–especially (1) designing and managing the human context of organizations; (2) talent selection, development, and deployment; and (3) developing organizational execution capabilities by ensuring the right people are in the right positions in organizations. Analytical topics include: business strategy and environment, risk-optimization frameworks, linking human resource (HR) management to strategy and performance, HR communication techniques, employee engagement, HR strategy, forces and trends driving HR strategy, and HR analytics through \"big data.\" Prerequisite: MGMT 2501 or MGMT 3500 or MGMT 3000. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3532",
                "title": "Managerial Communications",
                "description": "Focuses on three important aspects of managerial communications: interpersonal (building on concepts introduced in MGMT 3500), cross- cultural, and corporate. The communication skills addressed are especially useful in a rapidly changing environment. Emphasizes implementation, and expectations are for a high level of student involvement. Evaluation is based on several papers and participation.Prerequisite: MGMT 2501 or MGMT 3502 or MGMT 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3538",
                "title": "Leading Teams and Projects",
                "description": "This course focuses on building and leading project teams in dynamic environments. The course covers tools and concepts for effective project management and techniques for creating high performing temporary teams. Prerequisite: MGMT 2501 or MGMT 3502 or MGMT 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3540",
                "title": "Food Industry Management",
                "description": "Focuses on the key issues and management decisions necessary to effectively lead food and agribusiness firms in the competitive, global food system. Includes topics on the principal regulations and regulatory bodies governing the food industry, food safety and crisis management, ethical issues in food production and distribution, and resource and environment issues. Prerequisite: MGMT 2505 or MGMT 3505. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3541",
                "title": "Strategy Development in Food and Beverage Industries",
                "description": "Focuses on analysis of the strategic options facing food and agribusinesses worldwide. Emphasis is on developing an understanding of industry segments and value chains, food branding strategies, and new product development. Particular attention is placed on innovation in the agricultural production (AgTech) and food (FoodTech) sectors. Teams work together to prepare case analyses for presentation to the class. Students receive feedback and are coached on how to enhance their performance. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3544",
                "title": "Strategic Business Negotiations",
                "description": "Studies the behavior of individuals, groups, and organizations in the context of cooperative and competitive situations. Examines the theory and processes of negotiation so the student can negotiate successfully in a variety of settings. Designed to be relevant to the broad spectrum of negotiation problems faced by leaders in innovative organizations. Considers that while a leader needs analytical skills to discover optimal solutions to problems, a broad array of negotiation skills is needed to get these solutions accepted and implemented. Gives students the opportunity to develop these skills experientially and to understand negotiation in useful analytical frameworks. Prerequisite: MGMT 503 or MGMT 2501 or MGMT 3502 or MGMT 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2548/3548",
                "title": "Social Benefit Entrepreneurship",
                "description": "Introduces students to social benefit entrepreneurship through readings, case study analysis, and participation in assessing business plans for existing social benefit ventures. Considers that social benefit entrepreneurship is the management and leadership of innovative social ventures that produce a social benefit and that these ventures typically innovate to produce products and/or services that help alleviate important social problems in areas such as economic development (poverty), health, equality, education, and environment. Emphasizes understanding management techniques for maximizing the financial sustainability and scalability of an SBE. Prerequisites: MKTG 2552 or MKTG 3552 and ACTG 2300 or ACTG 3100. Prerequisites may be waived by permission of the instructor. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2549/3549",
                "title": "Legal Fundamentals for Entrepreneurs",
                "description": "This course introduces students to some of the fundamental legal issues typically encountered by entrepreneurs and startup companies. These include restrictions arising when leaving a current employer, selecting the best company structure and ownership, raising money and securities regulation, human resources concerns, contracts and leases, liability relating to the sale of goods and services, operational liability, intellectual property, creditor&aposs rights and bankruptcy, and others. Prerequisite: None. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3550",
                "title": "IP Strategies for Tech Start Ups",
                "description": "Identification and management of intellectual property (IP) assets is a significant strategic tool for every level of management. This course is designed to demystify intellectual property rights that are present in technology companies, and to give them a working understanding of IP rights relevant to technology. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "2752/3716",
                "title": "Crowdsourcing and Expert-sourcing: Strategies for Innovation",
                "description": "Firms are rapidly adopting internet-based collaboration technologies (CT) to involve a wide range of participants in joint product innovation or co- innovation. Broadly defined, these technologies include software tools and applications that leverage social activity within an online platform to facilitate interaction and collaboration among members of an online community and between members of a community and a firm. As such, they help firms engage the creativity and problem solving skills of firm-hosted online communities of users, employees, and other experts in the creation, development and refinement of products or services. As a result, their use may yield innovations that strongly fit user preferences while also, accelerating the pace and lowering the cost of product innovation. Despite the rapid adoption, many firms struggle with how to create value from CT-based co-innovation. Building on literature on user innovation, open innovation, and demand side value creation, this course explores the conditions for creating value when engaging online communities in co-innovation. The content focuses on non-open source contexts and community engagements that yield private gains for a host firm. Prerequisites: MGMT 503 or MGMT 2501 or MGMT 3500 and ECON 401 or ECON 2401 or ECON 3402, and MKTG 551 or MKTG 2552 or MKTG 3552. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "Covers special topics. Offered on an occasional basis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3801",
                "title": "Management Consulting",
                "description": "This course is designed for students who are interested in learning about consulting including tools and techniques to gain a consulting mindset. The course requires students to complete a series of case readings, assignments, classroom discussions, and a team project. Students will have the opportunity to understand the consulting process right from sourcing and starting engagements to closure and follow up engagements. Further, with the help of some practical execution in the classroom, students will also learn how to manage client needs and situations, articulating client needs in a succinct proposal, planning and executing consulting assignments, managing client interactions and in the process, learn to leverage some common frameworks for consulting. Prerequisites: ECON 3000 and MKTG 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MGMT",
                "type": "Graduate",
                "id": "3802",
                "title": "Entrepreneurship",
                "description": "This course looks as the practice of business innovation and entrepreneurship with an emphasis on how entrepreneurs recognize opportunities, communicate ideas, innovate, develop products, and build organizations. This course provides students with the skills, tools, and mindsets to enable them to discover other peoples problems upon which entrepreneurial ventures may be built and to use their own creativity to generate solutions to these problems. The techniques and skills apply to both start-ups and established ventures. This course is an introductory course intended to provide a foundation regarding the role of entrepreneurship and entrepreneurs in society and economy. As such, this class will explore what entrepreneurship means from several angles including how a person can be entrepreneurial in his or her own life - right now. This is an energized course about discovering entrepreneurship in and out of the firm. Prerequisites: MGMT 3000. (4 units)",
                "units": "4 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Economics",
        "abbr": [
            "ECON"
        ],
        "courses": [
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "1",
                "title": "Principles of Microeconomics",
                "description": "Introduction to microeconomics and its applications to business decisions and public policy. Topics include supply, demand, and the coordinating role of prices in a market economy; the behavior of business firms, including output and pricing decisions; competition and monopoly; government policies and regulations affecting markets. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "1E",
                "title": "Principles of Microeconomics",
                "description": "Special section of ECON 1 emphasizing environmental applications of economics. Introduction to microeconomics and its applications to business decisions and public policy. Topics include supply, demand, and the coordinating role of prices in a market economy; the behavior of business firms, including output and pricing decisions; competition and monopoly; government policies and regulations affecting markets. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "2",
                "title": "Principles of Macroeconomics",
                "description": "Determinants of national income and product in the long run and short run; inflation, unemployment, and business cycles; monetary and fiscal policies; and economic growth. Prerequisite: ECON 1. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "3",
                "title": "International Economics, Development, and Growth",
                "description": "Analysis of international trade theory and policy, balance-of-payments adjustments and exchange-rate regimes, and economic development. Prerequisites: ECON 1 and 2. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "3H",
                "title": "International Economics, Development, and Growth",
                "description": "Honors section. Analysis of international trade theory and policy, balance-of-payments adjustments and exchange-rate regimes, and economic development. Must be in the University Honors or Leavey Scholars Program, or have permission of instructor. Prerequisites: ECON 1 and 2. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "41",
                "title": "Data Analysis and Econometrics",
                "description": "Introduction to statistical methods for analyzing economic data. Emphasis on applications of multiple regression and establishing causality in observational data. Prerequisites: A grade of C− or better in ECON 1 and 2, and MATH 11 or 30, and MATH 8, or MATH 122, or OMIS 40, or AMTH 108, or equivalent. Economics majors only, or by permission of instructor. Must enroll simultaneously in ECON 42. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "42",
                "title": "Data Analysis Applications",
                "description": "Hands-on course in obtaining and analyzing data using statistical software. Prerequisites: A grade of C− or better in ECON 1 and 2, and MATH 11 or 30, and MATH 8, or MATH 122, or OMIS 40, or AMTH 108 or equivalent. Economics majors only, or by permission of instructor. Must enroll simultaneously in ECON 41. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ECON",
                "type": "Lower-Division",
                "id": "43",
                "title": "Data Wrangling and Visualization",
                "description": "Data acquisition, manipulation, and visualization using statistical software, with hands-on applications to economics. Prerequisites: Grade of C− or better in ECON 41 and 42; or OMIS 30, 40, and 41. (2 units)",
                "units": "2 units"
            },
            {
                "description": "Prerequisites: Unless otherwise noted, a grade of C− or better in ECON 1, 2, and 3 is required for all upper-division economics courses.",
                "units": "Prerequisites: Unless otherwise noted, a grade of C− or better in ECON 1, 2, and 3 is required for all upper-division economics courses"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "101",
                "title": "Resources, Food, and the Environment",
                "description": "Exploration of the relationship among food production, resource use, and the environment. Topics include biotechnology, the green revolution, resource depletion, environmental degradation, and food safety. Also listed as MGMT 173. Prerequisite: None. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "111",
                "title": "Economics of the Environment",
                "description": "Economic analysis of environmental issues and government policies for environmental protection. Applications to important environmental issues, such as global climate change, water and air pollution, hazardous wastes, biodiversity, and endangered species. Prerequisite: A grade of C− or better in ECON 1. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "113",
                "title": "Intermediate Microeconomics I",
                "description": "Theory of rational individual choice and its applications to decision making, consumer demand, and social welfare; economics of uncertainty and information. Additional prerequisite: A grade of C− or better in MATH 11 or 30. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "114",
                "title": "Intermediate Microeconomics II",
                "description": "Theory of the firm; determination of price and quantity by profit-maximizing firms under different market structures; strategic behavior; general equilibrium; market failure and government policies. Additional prerequisite: A grade of C− or better in ECON 113 and MATH 11 or 30. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "115",
                "title": "Intermediate Macroeconomics",
                "description": "Macroeconomic analysis, emphasizing modern economic models for explaining output, employment, and inflation in the short and long run. Macroeconomic policymaking, including fiscal and monetary policy. Additional prerequisite: A grade of C− or better in MATH 11 or 30. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "120",
                "title": "Economics of the Public Sector",
                "description": "Microeconomic analysis of the role of government in the market economy. Supply of public goods and services, government&aposs role in controlling externalities and regulating private industry, and the economics of the political process. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "122",
                "title": "Money and Banking",
                "description": "Theoretical, institutional, and historical approach to the study of money and banking, with particular emphasis on the relationship between the monetary and banking system and the rest of the economy. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "126",
                "title": "Economics and Law",
                "description": "Economic analysis of law and legal institutions focusing on the common law areas of property, contracts, and torts. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "129",
                "title": "Economic Development",
                "description": "Causes and consequences of economic growth and poverty in less developed countries; analysis of the role of government policies in economic development. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "134",
                "title": "African Economic Development",
                "description": "Examination of the economic development of sub-Saharan African countries, with particular emphasis on the relationships between economic growth and their social, political, and economic structures. Additional prerequisite: A grade of C− or better in ECON 41 and 42 or by permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "135",
                "title": "Gender Issues in the Developing World",
                "description": "Explores the gendered nature of poverty in the developing world, with special focus on sub-Saharan Africa, using applied statistical analysis, and economic theory. Also listed as WGST 121. Additional prerequisite: A grade of C− or better in ECON 41 and 42 or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "136",
                "title": "20th-Century Economic History",
                "description": "The development of the U.S. economy during the 20th century. Topics include the causes and consequences of economic growth, the Great Depression, the rise of government regulation, the changing role of women in the workforce, and the increasing internationalization of markets during the postwar period. Additional prerequisite: A grade of C− or better in ECON 115. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "137",
                "title": "World Economic History",
                "description": "Development of Western and non-Western economies since the late 19th century. Topics include globalization and economic integration, convergence and divergence in economic growth across countries, international monetary systems, and the impact of alternative policies and institutional regimes on economic performance. Additional prerequisite: A grade of C− or better in ECON 115 or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "138",
                "title": "History of Economic Thought",
                "description": "Origins and evolution of economic ideas in their historical and philosophical context. Emphasis on the theories of Adam Smith, David Ricardo, and Karl Marx, as well as the emergence of modern microeconomics and macroeconomics in the 19th and 20th centuries. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "139",
                "title": "American Economic History",
                "description": "Macroeconomic history of the United States since 1869. Productivity, economic growth, inflation, and recession in the United States from the end of the Civil War to the present. Particular emphasis on the Great Depression and the Great Recession. Additional prerequisite: A grade of C− or better in ECON 115. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "142",
                "title": "Economics of Sports",
                "description": "Tools of economic analysis applied to sports in pursuit of broader lessons and insights. Topics will include labor market discrimination, cartel theory, cognitive biases, strategy, labor unions, public policy, and profit maximization. The overriding objective is to use the observability of sports to help us understand economic decision-making in non-sports environments. Additional prerequisites: A grade of C− or better in ECON 41, 42, 113, and 114. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "150",
                "title": "Labor Economics",
                "description": "This course covers topics related to the labor market including theory of labor supply and demand, determination of wages and employment in the labor market, human capital theory, income inequality, unemployment, and labor market discrimination. The course will cover basic institutional background and statistics on each issue, and develop economic models important to the evaluation of each topic. Applications to policy issues including minimum wage, negative income tax, unionization, and unemployment insurance. Emphasis on data analysis and empirical methods applied to the labor market. Additional prerequisites: A grade of C− or better in ECON 41, 42, and 113. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "160",
                "title": "The Economics of Poverty and Inequality",
                "description": "Examines theories and evidence regarding poverty and economic inequality in the United States. Evaluates alternative public policies aimed at combating poverty. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "165",
                "title": "Economics and Justice",
                "description": "Study of theories of economic justice with applications to economic issues and policy. Alternative theories to be considered include utilitarian, libertarian, welfare-economic, egalitarian, feminist, and religious moral perspectives. Topics include poverty and income distribution; economic inequality and mobility by class, gender, and race; the role of the government in promoting justice; effects of globalization; and justice under different economic systems. Additional prerequisite: A grade of C− or better in ECON 113. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "166",
                "title": "Race, Ethnicity, and Gender in the U.S. Economy",
                "description": "Analysis of current and historical differences in economic status by race, ethnicity, and gender; theory and evidence of discrimination; role of government policies. Additional prerequisite: A grade of C− or better in ECON 41 and 42. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "170",
                "title": "Mathematical Economics: Static Optimization",
                "description": "The standard classical models of microeconomic and macroeconomic theory are generalized and reformulated as mathematical systems. The primary goal of the course is to extract empirically testable propositions that would permit testing model veracity. Linear algebra and the tools of calculus including power series, the implicit function theorem, envelope theorems, and duality are used as the basis of analysis. Additional prerequisites: A grade of C− or better in MATH 11 or 30, and MATH 12 or 31, and ECON 113, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "171",
                "title": "Mathematical Economics: Dynamic Optimization",
                "description": "The course will discuss the mathematical tools needed to analyze dynamic situations in economics. Applications to optimal decision-making over time with respect to natural resource allocations, manufacturing and storage paths, consumption/investment decisions, and stability of economic systems are discussed. Topics include optimal control, dynamic programming, and calculus of variations. Additional prerequisites: A grade of C− or better in MATH 11 or 30, and MATH 12 or 31, and ECON 113, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "172",
                "title": "Game Theory",
                "description": "This course introduces game theoretical concepts and tools. Theoretical topics include Nash equilibrium, Sub-game perfection, Bayesian-Nash equilibrium, Harsanyi transformation, commitment, and Perfect Bayesian Equilibrium. Applications to topics such as oligopoly, strategic investment, and agency theory are discussed. Additional prerequisites: A grade of C− or better in MATH 11 or 30, and MATH 12 or 31, and ECON 113, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "173",
                "title": "Applied Econometrics",
                "description": "Statistical analysis of cross-section and panel data, with economic applications. Topics include identification of causal effects using panel methods, instrumental variables, and quasi-experimental techniques; models with binary outcomes; sample selection. Hands-on analysis of data using statistical software. Additional prerequisites: A grade of C− or better in MATH 11 or 30, and MATH 12 or 31, and ECON 41 and 42, and ECON 113. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "174",
                "title": "Applied Time Series Analysis",
                "description": "Methods to forecast and interpret hypotheses about time-varying economic variables. Topics include stationary and non-stationary series; characterizing time series in tractable ways; separating regular (trend and seasonal) and irregular parts of a time series; and examining identification and estimation strategies. Synthesize, present, and evaluate time series analysis to assess credibility. Additional prerequisites: A grade of C− or better in ECON 41, 42, and 115. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "181",
                "title": "International Trade",
                "description": "Analysis of the theories of international trade and strategic interactions; assessment of the empirical patterns of trade; analysis of the political economy of protection, and applications to policies guiding international competition. Additional prerequisite: A grade of C− or better in ECON 113. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "182",
                "title": "International Finance and Open Economy Macroeconomics",
                "description": "Analysis of the monetary aspects of international economics, including the balance of payments, exchange rates and foreign exchange markets, speculative attacks and currency crises, and the implications of international trade and capital flows for macroeconomic activity and policy. Additional prerequisite: A grade of C− or better in ECON 115. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "185",
                "title": "Economics of Innovation and Intellectual Property",
                "description": "The economic determinants and consequences of innovation. Topics include research and development, joint ventures, patents and other intellectual property, university-industry and government-industry collaboration, and the relationship between antitrust and other regulatory policies and technological advances. Additional prerequisite: A grade of C− or better in ECON 113 and 114. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "186",
                "title": "Economics of Digitization",
                "description": "Digitization has dramatically reduced the costs of data storage and transmission. The transformative force of the Internet has, in many areas, fundamentally changed the ways consumers and companies interact. This course explores the impact of different digital technologies on the behavior of markets and market outcomes. It combines tools and insights from a number of fields, including industrial organization, labor economics, the economics of innovation, and applied econometrics. Topics covered include big data, copyright and online piracy, apps markets, online retailers, social media, online gaming, and virtual currencies. Additional prerequisite: A grade of C− or better in ECON 41, 42, 113 and",
                "units": "Digitization has dramatically reduced the costs of data storage and transmission. The transformative force of the Internet has, in many areas, fundamentally changed the ways consumers and companies interact. This course explores the impact of different digital technologies on the behavior of markets and market outcomes. It combines tools and insights from a number of fields, including industrial organization, labor economics, the economics of innovation, and applied econometrics. Topics covered include big data, copyright and online piracy, apps markets, online retailers, social media, online gaming, and virtual currencies. Additional prerequisite: A grade of C− or better in ECON 41, 42, 113 an"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "187",
                "title": "Dynamic Macroeconomics",
                "description": "Dynamic macroeconomic models are artificial economies that are designed for doing applied time-series analysis and policy simulation. This course provides an introduction to such models. Topics include a review of analytical and numerical tools for dynamic optimization; quantitative analysis of business cycle using the neoclassical growth theory; monetary policy analysis and projection using new Keynesian models; and other selected topics of economic dynamics. Problem sets include both theoretical and computer exercises. Additional prerequisites: A grade of C-- or better in ECON 41, 42, 113, and 115.",
                "units": "Dynamic macroeconomic models are artificial economies that are designed for doing applied time-series analysis and policy simulation. This course provides an introduction to such models. Topics include a review of analytical and numerical tools for dynamic optimization; quantitative analysis of business cycle using the neoclassical growth theory; monetary policy analysis and projection using new Keynesian models; and other selected topics of economic dynamics. Problem sets include both theoretical and computer exercises. Additional prerequisites: A grade of C-- or better in ECON 41, 42, 113, and 115"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "188",
                "title": "Advanced Macroeconomics: Theory and Empirics",
                "description": "Designed to provide students with a deeper understanding of macroeconomics and useful rigorous analytical and statistical skills. Topics covered include economic growth, and monetary and fiscal policies in business cycles. Analyze these topics in theoretical models, and validate the theories using actual data with R. Additional prerequisites: A grade of C− or better in ECON 41, 42, and 115. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "190",
                "title": "Economics Seminar",
                "description": "Seminar on contemporary economic theories and problems. Admission by invitation only. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "ECON",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Independent studies are normally permitted only under special circumstances. Prerequisite: Written proposal must be approved by instructor and chair at least one week prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "ECON",
                "type": "Graduate",
                "id": "2401",
                "title": "Economics for Business Decisions (Managerial Economics)",
                "description": "Introduces the use of microeconomics in making better business decisions. Includes topics on determinants of demand, role of demand elasticities in an optimizing firm, identification of costs which are relevant to business decisions, estimation and forecasting of demand and costs using regression analysis, differences between various market structures and consequences for business decisions, and optimal pricing in segmented and non-segmented markets. An integral part of the course is the use of current business articles to integrate and illustrate topics. Emphasizes applications of microeconomic theory. Open to MSF and MSE students only. Prerequisite: OMIS 2353. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "ECON",
                "type": "Graduate",
                "id": "3000",
                "title": "Managerial Economics",
                "description": "This course will introduce economics foundation for managerial decisions. The course analyzes the economic behavior of individuals and firms and explores how their interactions in markets affect managerial decisions. Basic concept of market, price elasticity, theory of consumer and theory of firm will be studies to incorporate economic theories in managerial decision making. How key managerial decisions are made in different industrial structures will be discussed. Prerequisites: OMIS 3202 (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "ECON",
                "type": "Graduate",
                "id": "3430",
                "title": "Game Theory and Strategic Behavior",
                "description": "Studies theoretical concepts and tools for analyzing issues in the business environment such as conflict, bargaining, pretending and shirking in organizations and markets, agenda construction, and strategic commitment. Teaches game theoretical topics such as Nash-equilibrium, Sub game perfection, Bayesian Nash-equilibrium, Harsanyi transformation, commitment, and Perfect Bayesian Equilibrium. Prerequisites: ECON 401 or ECON 2401 or ECON 3400 or ECON 3000 and working knowledge of calculus. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ECON",
                "type": "Graduate",
                "id": "3436",
                "title": "Applied Time Series Analysis",
                "description": "This course focuses on economic forecasting. Many decisions made in business, economics, finance and government depend on the forecasts that are constantly generated in these and other disciplines. This course will introduce the students to econometric time-series models and methods that can be used to generate forecasts. A wide range of topics will be covered, including basic concepts of time-series forecasting, trends and seasonality, ARIMA processes, and evaluation of forecasts. Illustrative examples applying these techniques to actual data will be presented in class, and students will perform a variety of data analyses on the computer. Upon completion of this course, students will have mastered basic properties of time-series forecasting models, and be able to skillfully select appropriate forecasting models to fit real world data sets and generate their own forecasts. Prerequisites: ECON 3400 and ECON 3402 or ECON 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "ECON",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "Covers special topics. Offered on an occasional basis. (3 units)",
                "units": "3 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Marketing",
        "abbr": [
            "MKTG"
        ],
        "courses": [
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "165",
                "title": "Customer-Centric Retailing",
                "description": "The design and management of store, catalog, and Internet-based retail channels. Topics include how retailers create value for the producer and the end user, the financial and marketing strategies that underlie retailing formats, target marketing decisions, merchandise management, how retail price promotions work, managing customer service, and the execution of retail marketing decisions. Mini cases, video cases, an applied project, and guest speakers from industry will be utilized to provide practical illustration of various concepts and stimulate class discussion. Prerequisites: ACTG 11 and MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "168",
                "title": "and 169. Advanced Retail Seminars",
                "description": "In-depth examination of a number of topics critical to future executives in a retailing environment. Focus is on the use of consumer information and information technology to improve managerial decision making. Topics include consumer trends, multichannel retail models, analysis of high-performance retailers, category management, building information-centric organizations, mobile marketing, social media, sales promotion and online advertising, and supply chain management. Prerequisites: MKTG 165, 181, or 181S, and declared retail studies minor. MKTG 168 must be taken prior to 169. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "175",
                "title": "Internet Marketing",
                "description": "Focuses on several important areas impacting the dynamic nature of Internet marketing by addressing these questions: What is the role of mobile, social, and local marketing in today&aposs environment? How are marketers integrating e-commerce into their marketing activities? What are some of the major problems and opportunities that e-commerce activities pose for the marketing manager? Project required. Prerequisite: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "177",
                "title": "Social Media Marketing",
                "description": "This experimental course examines the role of social media in business and brand strategy, digital advertising, and overall marketing mix. This class introduces students to the current social media landscape, explores how it can be used for maximum results (for both corporate and individual branding), and evaluates which social platforms are the best fit for an organization&aposs strategic business and marketing goals. Topics to be covered will include an overview of platforms, current social media trends and their implications, developing social media strategy, measurement, and challenges. Prerequisites: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "178",
                "title": "Marketing Across Cultures",
                "description": "Success in global markets requires developing marketing programs that are sensitive to cultural differences. This course emphasizes the cultural factors that drive consumption behavior in international markets. A socio-cultural perspective is applied to traditional marketing concepts to develop programs to successfully address international markets. Mechanisms for participating in foreign markets such as exports, licensing, and joint ventures are evaluated. Ethical marketing issues in international contexts are explored. Students who take this class may not receive credit for MKTG 178L taken in the Santa Clara London Program, or any equivalent course taken in a study abroad program. Prerequisites: MKTG 181 or 181S and MGMT 80. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "181",
                "title": "Principles of Marketing",
                "description": "Introduction to the fundamental principles of contemporary marketing. Covers the role of marketing in society, marketing strategy and planning, segmentation, product policy, pricing decisions, promotion, and distribution. The course stresses topical examples. Emphasizes application of basic principles, information sourcing, analytical thinking, and communication skills. Prerequisite: Must have 60 units or greater, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "181S",
                "title": "Principles of Marketing",
                "description": "Introduction to the fundamental principles of contemporary marketing. Covers the role of marketing in society, marketing strategy and planning, segmentation, product policy, pricing decisions, promotion, and distribution. Stresses topical examples. Emphasizes application of basic principles, information sourcing, analytical thinking, and communication skills. Prerequisite: Enrollment restricted to students in the Leavey Scholars Program. Must have 60 units or greater, or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "182",
                "title": "Analysis for Marketing Decisions",
                "description": "An analytical approach toward understanding consumers and markets to support profitable marketing decisions in such areas as market segmentation, new product development, positioning, and promotions. The focus is on frameworks for structuring marketing problems, and techniques for using data to improve marketing decisions. Cases and projects are emphasized. Prerequisites: OMIS 41 or ECON 42 and MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "183",
                "title": "Customer Behavior",
                "description": "How consumers process information and make buying decisions. Investigation of influence factors, such as attitudes, personality, culture, motivation, perception, and reference groups on consumer decision making. Decision-making processes of industrial buyers in business-to-business markets are also studied and compared to those of individuals in consumer markets. Particular emphasis on understanding the decision-making process (both consumer and industrial) and its application to the development of sound marketing strategy. An applied project, videos, and mini-cases are used to illustrate the practical application of various concepts. Prerequisites: OMIS 41 or ECON 42 and MKTG 181 or 181S or permission of instructor. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "185",
                "title": "Sales Management",
                "description": "This course puts the student in the role of being a prospective sales or marketing manager. The objective is to provide students with user-level knowledge of sales concepts and management methodologies necessary to effectively perform and manage the sales function. The format of the course enables the student to apply these concepts to selling both consumer high-tech and industrial products and services. Project required. Prerequisite: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "186",
                "title": "Integrated Marketing Communications",
                "description": "Integration of the marketing mix, brand message, and media is essential to successfully meeting corporate objectives. The course arms students with an understanding of new media plus the skills to plan, develop, execute, coordinate, and measure integrated marketing communications (IMC) programs. Personal attributes, demeanor, and business ethics are addressed in preparation for moving from the classroom to the boardroom. Interaction with business practitioners, industry-experienced instruction, and a service/learning project for an actual company are integral to the course. Prerequisite: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "187",
                "title": "Innovation and New Product Marketing",
                "description": "Focuses on both quantitative and qualitative techniques associated with identifying, researching, and analyzing new product opportunities. Exposes students to important tools for designing, testing, and introducing profitable new products and services. Prerequisite: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "189",
                "title": "Sustainability Marketing",
                "description": "The course is designed to explore the relationship between sustainability and marketing, especially for students interested in business and society and the environmental concerns that affect marketing managers. Key areas include understanding the economic foundation of sustainability marketing and its place in contemporary society, sustainability marketing standards and strategies, and global and ethical considerations. Prerequisite: MKTG 181 or 181S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "197",
                "title": "Special Topics in Marketing",
                "description": "Occasional current and interdisciplinary courses offered on a one-time or infrequent basis or cross-listed with offerings in other departments. Consult quarterly schedule of classes for description. Prerequisites: MKTG 181 or 181S and declared marketing major. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "198",
                "title": "Internship",
                "description": "Opportunity for upper-division students to work in local firms and complete a supervised academic project in that setting. Prerequisites: Declared marketing major, MKTG 181 or 181S, 182, and permission of faculty coordinator. (1--3 units)",
                "units": "1--3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Independent studies are normally permitted only under special circumstances. Prerequisite: Written proposal must be approved by instructor and chair at least two weeks prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "2552/3000",
                "title": "Marketing Strategies and Decisions",
                "description": "Focuses on decisions faced by managers concerning market segmentation, targeting, and positioning. Covers concepts such as new product development, pricing strategies, distribution channels, customer relationships, and performance metrics within a strategic planning framework. Students apply these key concepts and frameworks to cases and to formulating a comprehensive marketing plan centered on sustainable profitability and capabilities. Cases cover various environments and industries, especially those of concern to Silicon Valley firms. Prerequisite: ECON 401 or ECON 2401 or ECON 3400. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3554",
                "title": "Analyzing Customers and Markets",
                "description": "Topics include frameworks for understanding how customers make decisions and adopt innovations, metrics for assessing customer attitudes, satisfaction and loyalty, methods for segmenting a market, and measures of brand equity. The focus throughout is on techniques for gathering and analyzing data on customers and markets in both on-line and traditional channels. Addresses B-to-B and B-to-C decision processes in rapidly changing markets. Prerequisite: MKTG 551 or MKTG 3552 or MKTG 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3569",
                "title": "Small Business Entrepreneurship",
                "description": "Entrepreneurship focuses on evaluating ideas for venture opportunities and the conversion of these ideas into viable businesses. Course includes discussion of cases, lectures, and presentations by guest speakers who have played a role in starting new enterprises (e.g. bankers, attorneys, risk capital investors, and entrepreneurs). Students develop a five-year business plan for a new enterprise and make an investor presentation to a panel of investors. Knowledge of accounting/finance must be sufficient to build viable financial statements. Prerequisite: MKTG 3552 or MKTG 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3572",
                "title": "New Product Innovation",
                "description": "Presents the product manager or marketer as a generalist with responsibility for the multifunctional, multidisciplinary approach required to develop, launch, and manage successful products. Includes in-depth treatments of product life cycle analysis, buyer utility, competitive set, customer and market analysis, pricing, and the product launch process. Appropriate for those interested in high-technology and/or consumer product markets. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3574",
                "title": "Sales Force Management",
                "description": "Provides the student with user-level knowledge of sales concepts and management methodologies necessary to effectively perform and manage the sales function. In the role of a sales or marketing manager, enables the student to apply these concepts to selling consumer products as well as high-tech industrial products. Includes concepts related to organizational structuring, territory plans and reviews, resource management, sales incentives, and compensation programs. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3588",
                "title": "Topics in Profit Maximizing Pricing",
                "description": "Company strategies to approximate the profit maximizing price of microeconomic theory using only information that is readily available to the company. Topics include: costs relevant for pricing decision; financial analysis for determining change in sales needed to make price changes profitable; analysis of customers and customer price sensitivity; pricing in segmented markets; anticipating and influencing competitor pricing decisions; and competitive advantages and disadvantages in profit focused pricing decisions. Topics are integrated to provide a real-world path to profit maximizing pricing. Class is run as a seminar with student interaction and student research projects. Cross-listed as ECON 3422. Prerequisites: ECON 401 or ECON 2401 or ECON 3400 or ECON 3000 and MKTG 551 or MKTG 2552 or MKTG 3552 or MKTG 3000, differential calculus, and a working knowledge of hypothesis testing and regression analysis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3590",
                "title": "Designing and Managing Dynamic Marketing Channels",
                "description": "Focuses on understanding current theory and development of the analytical skills required for effective management and strategic deployment of multi-channel marketing decisions. Includes topics on channel planning, design; management of power and conflict and coordination in channel relationships; role of strategic alliances; and managing indirect channels. Requires creation of an in-depth case analyses and a channel audit project. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3592",
                "title": "Internet Marketing and eCommerce",
                "description": "Provides the background and analytical skills to effectively manage Internet marketing and e-commerce strategies. Examines winners & losers in internet marketing, SEM, SEO, affiliate and viral marketing, use of social media and online advertising. Analyzes how the Internet is being leveraged into the core marketing activities of a business. Requires the development of an Internet marketing plan for an existing business. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3594",
                "title": "Business to Business Marketing",
                "description": "Through core readings and selected case analysis, this course encompasses the marketing activities that enable a supplier firm to create, deliver, and capture value when engaging with other businesses, governments, or institutional customers. In the context of these target segments, value is analyzed in terms of the benefits the customer may receive and which the vendor firm may monetize. Typically covered are various market approaches to the business organization, which often uses a \"buying center\" framework incorporating different roles for decision-making participants. This course builds on an understanding of dynamic relationships and value chains to provide analytical tools and problem solving skills for effective marketing. Prerequisite: MKTG 3000 (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3596",
                "title": "Integrated Market Communications",
                "description": "Introduces the concept of integrated marketing communications (IMC). Provides a basic understanding of communication theory, marketing, branding, integrating marcom tactics, planning and coordinating IMC programs. Addresses marcom tactics of advertising, public relations, direct response, collateral, the Internet, and digital media. Addresses business-to-business and high-technology marketing communications.Incorporates a thorough understanding of objectives, strategies, tactics and budgeting. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3597",
                "title": "Marketing Analytics",
                "description": "Prepares managers to (1) identify the competitive advantages that come from leveraged analytics; (2) apply the tools, and evaluate the advantages and limitations of each; (3) implement these tools, ask relevant business questions that could be solved with them; and (4) interpret the input and communicate the output from such tools and models to achieve more profitable business decisions. Prerequisite: MKTG 553 or MKTG 3552 or MKTG 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3708",
                "title": "Financially Effective Market Positioning Strategies",
                "description": "Focuses on the issues in creating financially viable and effective market positioning strategies. Examines how traditional market-based measures–such as awareness, understanding, trial, ongoing usage, customer satisfaction, distribution levels, and market share–can be linked to financial outcomes. Discusses how to connect marketing expenditures directly to short-term and long-term results by examining the investment and expense requirements of different segmentation and market entry strategies. Connects customer value propositions to competitive marketing strategies and shareholder value-creation outcomes. The success of a company depends on the extent to which the marketing and financial disciplines work together. Prerequisite: MKTG 553 or MKTG 3552. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3709",
                "title": "Developing Product and Services for the Boomer Marketplace",
                "description": "Presents an overview of the baby boomer marketplace. Explores major demographic and psychographic variables that characterize this market, as well as how the boomer market is becoming an ever more important economic, social, political, and cultural force influencing consumption. (Households headed by someone 40+ hold 91% of America&aposs net worth.) Identifies and evaluates new product/service opportunities for the boomer market, and develops an understanding of how to create customer value in this segment via exposure to several sources, including marketing officers from large consumer products firms, and venture capitalists who have successful track records in funding innovative products/ services targeted to this sector. Features hands-on experience in developing a proposal for a new product or service targeting the boomer market, together with the marketing strategy. The proposal will reflect criteria previously identified by organizations and venture capitalists as relevant to marketplace success. Prerequisite: MKTG 553 or MKTG 3552. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3710",
                "title": "Tech Marketing: Winning Strategies for Effective Messaging",
                "description": "The success of a marketing campaign or overall strategy ultimately depends on how a company&aposs end customers perceive, accept and adopt a products value proposition/ positioning/resulting messaging. Especially in high technology markets, where new purchases are capital investments measured by impact to the business and return on investment, a products value proposition has to be extremely clear, tangible and differentiated in order to achieve vendor preference, as well as maintain desired pricing and margin levels. This two credit-hour course focuses on proven, effective strategies for understanding customer requirements and translating them into clear, digestible and differentiated messaging statements. We will provide strategies and examples to achieve strong competitive positioning, as well as how and when to (re-)define an entire market vs. just differentially position your products. Specific topics will include best practices for positioning and messaging creation, competitive landscape modeling and developing differentiation, translating customer requirements into effective positioning/messaging, and wholesale market (re-definition). Additional focus will include an overview of core media assets to effectively drive adoption of positioning/ messaging in today&aposs increasingly Web 2.0 world. Prerequisite: MKTG 553 or MKTG 3552. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3712",
                "title": "Achieving Brand Leadership",
                "description": "Brand development and brand management are not only a potentially powerful weapons in the marketing arsenal but also they are a major business resource and a key intangible financial asset for beating the competition.. Yet many Silicon Valley marketers rely only on technology, attributes and/or price and overlook the strategic and tactical benefits that a well-managed brand provides. Achieving Brand Leadership provides a framework and tools for marketers to successfully brand products and services and add an additional layer of advantage with in the competitive environment. The course defines and examines the concept of branding through a theoretical and conceptual framework and in number of business contexts. Beginning with a fundamental review of the core branding elements, we weigh the importance of both the promise and the experience aspects of branding in building and sustaining trust. An examination of brand measurements illuminates the power of metrics and highlights different aspects of branding strategies. A look at past cases of successful and unsuccessful branding brings out variations in approaches to such issues as master brands, sub-brands, and the branding of services. Finally, the impact of branding architectures and creative positioning on brand equity are considered. The course will use both management readings and current articles to provide a solid foundation for analysis. A series of cases drawn from both the product and service arenas will enable students to apply this analytical framework to actual situations. Brand equity and its related metrics provide a standard basis in evaluating various strategies for establishing and growing brands. A final individual course project offers an opportunity to integrate various facets of branding for a specific product or service. Prerequisite: MKTG 3552. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3713",
                "title": "Business Model Frameworks",
                "description": "Covers different types of business opportunities available to lifestyle, opportunistic, and innovating entrepreneurs, distinguished in general categories that encompass virtually all business ideas. In each case, develop a framework for an entrepreneur to use to identify an opportunity potential; understand and take the appropriate first steps toward building the business; and evaluate the early trajectory of the business to maximize learning and decide whether the opportunity is worth continuing. Prerequisite: None. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3801",
                "title": "Social Media Marketing",
                "description": "Examines the role of social media in business and brand strategy, digital advertising and overall marketing mix. This class introduces students to the current social media landscape, explores how it can be used for maximum results for both corporate and individual branding, and evaluates which social platforms are the best fit for their organization&aposs marketing goals. Topics to be covered will include an overview of platforms, current social media trends and their implications, developing social media strategy, measurement, and challenges. Prerequisites: MKTG 3552 or MKTG 3000 (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3802",
                "title": "Mobile Marketing",
                "description": "Presents a set of useful concepts, frameworks and strategies to help students to better understand a new world that is built with the mobile device at its center. Students will analyze key aspects of M-Commerce and Mobile Marketing, and learn a set of strategies and tools, using which they can (i) create economically valuable M-Commerce products/services, and (ii) market products (both traditional and digital) to the mobile consumer via the mobile medium. The course primarily focuses on understanding: (a) new digital product business models and their underlying technologies, (b) mobile consumer behavior, © new mobile marketing techniques - including search, social media, geo-local, & omni- channel, and (d) mobile marketing metrics. Prerequisites: MKTG 3552 or MKTG 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "Covers special topics. Offered on an occasional basis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3803",
                "title": "Fundamentals of B2B Account Based Marketing",
                "description": "This course introduces the concepts critical understanding of contemporary B2B marketing and the emergence of Account-Based Marketing (ABM) as a Go-to-Market strategy. You will learn why account-based marketing has recently become important and you will gain the understanding of when it&aposs appropriate to employ an ABM strategy and what types of companies utilize this approach. You will gain hands on knowledge and experience in developing and evaluating effective ABM strategies. By successfully completing this course you will be able to use cutting edge marketing technologies in the implementation of an account-based marketing strategy including their use for measuring the effectiveness of the program. Prerequisite: MKTG 3000 (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MKTG",
                "type": "Graduate",
                "id": "3804",
                "title": "Programmatic Advertising",
                "description": "Programmatic advertising is the software-driven, algorithmic transaction of display advertising space in real time. As advertising rapidly shifts from traditional to digital formats, and as more transacts programmatically within digital advertising, the industry needs technologists who are able to harness this constantly evolving and complex domain. This course will transform programmatic novices into experts who can apply knowledge and experience to real-life scenarios. The course will provide foundational knowledge of the programmatic advertising landscape, an understanding of how it fits into marketing strategy, and the necessary skills to be able to navigate the space from various perspectives. Prerequisite: MKTG 3000 (2 units)",
                "units": "2 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Finance",
        "abbr": [
            "FNCE"
        ],
        "courses": [
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "115",
                "title": "Quantitative Methods for Finance",
                "description": "The goal of this course is to teach finance majors the most important quantitative tools they will need for the finance curriculum. Students will learn to (1) comprehend important concepts, techniques, and tools used in mathematics and statistics that are relevant for modern finance; (2) understand where these tools are applied in practice; and (3) learn widely-used software to implement these techniques. The course goal is to make sure that all finance majors reach a baseline level of competence in various quantitative methods, and is especially intended for those students who fear math, yet have a desire to come to grips with it. A previous math course (e.g., MATH 31 or the MATH 11 and 12 sequence) is strongly recommended. Prerequisites: FNCE 121. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "116",
                "title": "Mathematical Finance",
                "description": "Introduction to Ito calculus and stochastic differential equations; discrete lattice models; models for the movement of stock and bond prices using Brownian motion and Poisson processes; pricing models for equity and bond options via Black-Scholes and its variants; optimal portfolio allocation. Solution techniques will include Monte Carlo and finite difference methods. Prerequisites: Either FNCE 115 or MATH 122 or AMTH 108. MATH 53 or permission of the instructor is required if FNCE 115 has not been taken. Cross-listed with MATH 125 and AMTH 367. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "118",
                "title": "Real Estate Principles",
                "description": "A foundational course that provides students with a general overview of real estate and practical applications of the material. The course covers a broad range of topics including the historical and legal basis of regulations and customs that govern real estate today, real estate service industries, real estate market analysis, the principles in real estate transactions, and the unique characteristics of real estate as an investment asset class. The course will lay a solid foundation for students to pursue specific areas in greater depth through more focused courses in the future. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisites: 88+ units (junior/senior standing) or ACTG 11. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "121",
                "title": "Financial Management",
                "description": "Introduction to the basic concepts of financial risk and return, the valuation of uncertain future cash flows, working capital and fixed asset management, and cost of capital. Topics include time value of money, financial analysis and forecasting, valuing corporate securities (stocks and bonds), capital budgeting, short- and long-term financing, and cash management. Prerequisites: OMIS 40, ACTG 11 and proficiency with spreadsheets. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "121S",
                "title": "Financial Management",
                "description": "Introduction to the basic concepts of financial risk and return, the valuation of uncertain future cash flows, working capital and fixed asset management, and cost of capital. Topics include time value of money, financial analysis and forecasting, valuing corporate securities (stocks and bonds), capital budgeting, short- and long-term financing, and cash management. Prerequisites: Restricted to students in the Leavey Scholars Program. OMIS 40, ACTG 11, and proficiency with spreadsheets. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "124",
                "title": "Investments",
                "description": "Introduction to the nature and functions of securities markets and financial instruments. The formulation of investment goals and policies, trading strategies, and portfolio management. Coverage of security analysis and valuation, evaluating portfolio performance, diversification, alternative investments. Prerequisite: FNCE 121 or 121S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "125",
                "title": "Corporate Financial Policy",
                "description": "In-depth examination of the interrelationships between corporate investment and financing decisions and their impact on a firm&aposs pattern of cash flows, return, and risk. Special emphasis on the development of analytical techniques and skills for analyzing performance reflected in financial statements. Case studies are used. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "126",
                "title": "Money and Capital Markets",
                "description": "Examines the role and function of financial institutions, financial flows, and interest rate structures in the money and capital markets. Viewed primarily from the perspective of a corporate issuer, explores the mechanisms by which value is created by financial markets, the roles of players in the system, the securities in each market, the flows of information, and the design and incentive features that manage risk in a practical manner. Common themes and concepts will be developed by the exploration of a new market in each class, examining a corporate issuer&aposs funding alternatives, and incorporating current news events. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNCE 125. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "127",
                "title": "Introduction to Real Estate Transactions",
                "description": "This course uses real-life investments as a comprehensive means of exploring all phases of the real estate investment life cycle, from identifying potential transactions, examining various valuation methods, conducting due diligence, determining financing alternatives, implementing property management strategies, and analyzing disposition timing. Students will explore various types of real estate investments: multi-family, office, hotel, and ground-up development. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisite: FNCE 121 or 121S, and FNCE 118. (5 unit)",
                "units": "5 unit"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "128",
                "title": "Real Estate Finance",
                "description": "Exploration of the real estate market, including investments in residential and commercial real estate by individuals, partnerships, and trusts. Emphasis is on the valuation and cash flow analysis of these projects and an understanding of financing alternatives. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "129",
                "title": "Real Estate Development",
                "description": "Examines the complex and interdisciplinary process of real estate development, including conceptual planning, feasibility studies, financing, legal documentation, and project management. Explores ways that developers mitigate risks throughout the development process. Describes different types of commercial real estate products and the roles of key players in today&aposs real estate profession. Students will also gain exposure to the ethical issues frequently encountered in real estate development. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisites: FNCE 121 or 121S, and FNCE 118. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "130",
                "title": "Ethics and Finance",
                "description": "Exploration of the ethical dimension of financial markets. Each week focuses on a different job function (investment manager, research analyst, trader, fund manager, corporate controller, bank officer, etc.) and explores the intersection between legal responsibility and ethical action. Topics include fiduciary responsibility, insider trading, moral hazard, agency, predatory lending, and financial market regulations concerning disclosure, price manipulation, suitability, etc. Current news items and regulatory activity will be incorporated in weekly discussions. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "132",
                "title": "Financial Derivatives",
                "description": "Provides an introduction to financial derivative securities, the markets in which they trade, their applications, and valuation frameworks. Securities such as equity calls/puts, forwards/futures, structured products, and fixed income derivatives will be covered. An underlying theme of the course will be valuation using dynamic replication. Applications will cover the use of derivatives in global corporate settings as well as in financial institutions and services. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "134",
                "title": "Fixed Income Securities",
                "description": "Provides an introduction to fixed income by covering the valuation and application of a range of fixed-income securities and credit derivatives. The main objective is to provide a foundation in the basic concepts and mathematics of these securities and their applications, holistically as it pertains to a means to (1) formulate investment strategies, (2) immunize investment portfolios, and (3) hedge attendant risks. Students will be able to describe basic features, pricing, and mathematics (duration and convexity) of fixed-income securities, model risk and return in fixed-income securities, describe basic similarities and differences in the deaures and bond mathematics for plain-vanilla versus more complex fixed-income securities, and describe and price basic credit derivatives and structured credit products. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "135",
                "title": "Applied Portfolio Management",
                "description": "Designed to provide a highly rigorous and analytic framework for applied work in investments and portfolio management. Students who master the course material will acquire the analytical tools and financial theory necessary to make rational investment decisions and understand the paradigms by which investment portfolios are managed. The coursework involves an analysis of contemporary theories and techniques in portfolio management available to professional portfolio managers. Significant literature that emphasizes the role of the modern portfolio manager in achieving diversification and client investment goals is reviewed and evaluated. Prerequisites: FNCE 121 or 121S, FNCE 124, and OMIS 41. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "141",
                "title": "New Venture Finance",
                "description": "Describes the financing environment for young companies and studies how the private equity market functions. Students will learn how investment funds are structured, investment contracts are written, and understand the economics of different private equity models work. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "143",
                "title": "Entrepreneurial Finance",
                "description": "Covers topics that are directly relevant to entrepreneurs, defined broadly to include all early employees in addition to founders, who are evaluating, communicating, and implementing new business opportunities. This course focuses on the start-up phase with an emphasis on venture-backed companies. The three main sections of the course are: Types of Businesses (primarily lecture and project-based), Financial Models (primarily project-based), and Investment Terms (primarily lecture-based). Types of Businesses covers the three types of entrepreneurs: lifestyle entrepreneurs, wealth-building entrepreneurs, and innovating entrepreneurs, along economic foundations that distinguish the three types of entrepreneurship. Financial Models covers the creation and uses of financial projection: revenue, costs, and profits/losses. Investment Terms covers the way investments in start-up companies are generally structured. In all three sections, we will discuss the human biases that often distort entrepreneurial efforts, along with strategies to recognize and avoid the more costly. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "146",
                "title": "Introduction to Risk Management",
                "description": "Introduction to financial risk management through its major components: credit, market, operational, legal, and reputational. Also addresses technology tools to manage risk and the role data governance and environmental policy play in risk management. Students who master the material will acquire an understanding of the major areas of risk exposure that all organizations, both public and private, face in operating in today&aposs complex global marketplace. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "148",
                "title": "Risk Management and Insurance",
                "description": "Survey of general principles of risk management. Risk management uses many tools to avoid, reduce, or offset the financial penalty of risks. The course will cover types of insurance, financial instruments used to \"insure\" a portfolio, credit default swaps, etc. The course will address the risk management function across the firm. The role of the chief financial officer (CFO) or vice president of finance as the risk management officer will be examined. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "149",
                "title": "Financial Institutions and Services",
                "description": "Analyzes the management of financial institutions and the role of financial services and institutions in the financing/restructuring of industry and government, and facilitating saving and investment. Topics such as asset/liability management, regulatory constraints, liquidity and credit risk considerations, financing and securitization, and off-balance sheet activities are discussed. Macro issues such as financial system stability, information flows, and regulatory capital are also covered. Ethical issues faced by financial industry professionals are considered. Prerequisites: FNCE 121 or 121S, and FNCE",
                "units": "Analyzes the management of financial institutions and the role of financial services and institutions in the financing/restructuring of industry and government, and facilitating saving and investment. Topics such as asset/liability management, regulatory constraints, liquidity and credit risk considerations, financing and securitization, and off-balance sheet activities are discussed. Macro issues such as financial system stability, information flows, and regulatory capital are also covered. Ethical issues faced by financial industry professionals are considered. Prerequisites: FNCE 121 or 121S, and FNC"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "151",
                "title": "International Finance",
                "description": "Examination of the functioning of the international monetary system, foreign exchange markets, and the financial problems of business firms operating internationally. Topics covered include hedging exchange rates and interest rates, international investment and financing, financial markets, banking, and financial management. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "155",
                "title": "Family Business Financial Management",
                "description": "Explores critical issues in the financial management and corporate governance of family businesses. Students will read, analyze, and discuss cases that covers a broad range of topics in family businesses, including corporate governance issues, valuations, capital structure choices, capital-raising decisions, and liquidation methods. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "163",
                "title": "Investment Practice",
                "description": "The practice of portfolio management using a portion of the University&aposs endowment fund to acquire real-life investment experience. Various investment objectives will be explored, including derivatives to protect current positions, fixed income, and equity investments. The course meets over three quarters. Students must earn 6 units in order for the course to count toward the major. Prerequisites: FNCE 121 or 121S, FNCE 124, and instructor approval. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "170",
                "title": "Business Valuation",
                "description": "Practical valuation tools for valuing a company and its securities. Valuation techniques covered include discounted cash-flow analysis, estimated cost of capital (cost of equity, cost of debt, and weighted average cost of capital), market multiples, free-cash flow, and pro-forma models. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "172",
                "title": "Corporate Treasury Management",
                "description": "Provides a comprehensive review of the corporate treasury function, including payment systems, cash forecasting, working capital metrics and management, capital structure decisions and capital markets, long-term and capital investments, risk management (primarily foreign exchange and interest rate risk), clearing and settlements, and treasury systems, and the regulatory and legal environment for corporate treasurers and CFOs. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "174",
                "title": "Mergers and Acquisitions",
                "description": "A study of corporate governance and corporate restructurings. Emphasis on how corporate ownership, control, and organizational structures affect firm value. Other topics may include valuing merger candidates, agency theory, and takeover regulation. This course generally places a heavy emphasis on case projects and/or class presentations. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNCE 125. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "180",
                "title": "Open Book Management",
                "description": "Open book management is a system that places finance and accounting at the center of management processes for decision making and monitoring. The course uses simulation techniques to teach students how to create a corporate culture around the principles of open book management, particularly the treatment of agency conflicts and the use of effective business processes. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNCE",
                "units": "Open book management is a system that places finance and accounting at the center of management processes for decision making and monitoring. The course uses simulation techniques to teach students how to create a corporate culture around the principles of open book management, particularly the treatment of agency conflicts and the use of effective business processes. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNC"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "186",
                "title": "Applying Financial Models to Financial Data",
                "description": "This course introduces students to various financial databases, accessing data from these databases, and analyzing data using quantitative techniques. Students will explore Bloomberg, Compustat, CRSP, Mergent/Investext, EDGAR, and other online sources such as Yahoo Finance. Downloaded data will be managed in Excel and analyzed using a variety of features that Excel offers, especially its Data Analysis Toolpak, as well as other analytical software. Course assignments focus on current financial events, as students access and analyze data to answer questions related to these events. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNCE 125 (or permission of instructor). (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "191",
                "title": "Peer Educators in Finance",
                "description": "Peer educators in Finance work closely with a faculty member to help students in a course understand course material, think more deeply about course material, benefit from collaborative learning, feel less anxious about testing situations, and/or to help students enjoy learning. Enrollment is by permission of the instructor. (1 or 2 units)",
                "units": "1 or 2 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "197",
                "title": "Special Topics in Finance",
                "description": "Offered occasionally to introduce new topics not covered by existing electives. Topics generally reflect the research interests of the faculty teaching the course. Prerequisite: FNCE 121 or 121S. (5 units)",
                "units": "5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "198",
                "title": "Internship",
                "description": "Opportunity for selected upper-division students to work in companies and nonprofit organizations. Prerequisites: Finance major, junior or senior standing, successful completion of FNCE 121 or FNCE 121S, and permission of instructor and chair required one week prior to registration. Anything less than 5 units will not count toward major requirements. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Independent studies are normally permitted only under special circumstances. Prerequisites: Declared finance major, junior or senior standing and a written proposal must be approved by instructor and chair one week prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "2452/3000",
                "title": "Financial Management",
                "description": "This course provides an introduction to finance. It addresses the theory and practice of financial management, the generation and allocation of financial resources. The main objective is to provide a foundation in the basic concepts of finance, including the time value of money, cash and working capital management, the role of financial markets, portfolio theory, asset pricing, and the risk-return tradeoff, and to expand awareness of institutions and practices in business and finance. Prerequisites: ACTG 3000 (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "2453/3453",
                "title": "Corporate Finance",
                "description": "Deals with the basic and advanced concepts of corporate finance, particularly the role of the financial manager and the goal of financial management. For this purpose, the course focuses on agency conflicts and corporate governance, capital structure, payout policy, financial distress, options (real and executive), derivatives/hedging, and international issues. Prerequisite: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "2455/3455",
                "title": "Investments and Capital Markets",
                "description": "Explores investment securities and markets; reviews valuation tools; analysis of stocks, bonds, and derivatives. Introduces constructing portfolios and controlling investment risks. Focuses on learning how to value assets given forecasts of future cash flows. Concentrates on the",
                "units": ""
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3457",
                "title": "International Financial Management",
                "description": "Studies financial issues specific to firms operating internationally. Examines the global financial environment, agency problems and corporate governance, international financial markets, exchange rate behavior, and corporate hedging decisions using currency options, currency futures, forward & cross-currency interest rate swaps by the multinational corporation (MNC) and understanding international parity relations. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3459",
                "title": "Financial Markets and Institutions",
                "description": "Studies financial service companies such as commercial banks, investment banks, and insurance companies from the perspective of a corporate issuer. Reviews valuation tools. Emphasizes the analysis of a corporation&aposs funding alternatives under regulatory constraints, interest rate risk management, and the relation between financial institutions and financial markets. Other topics may include evolution of financial intermediaries and current developments in financial regulation. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3460",
                "title": "Mergers, Acquisitions, and Corporate Restructuring",
                "description": "Examines corporate governance and corporate restructurings. Emphasizes how corporate ownership, control, and organizational structures affect firm value. Other topics include valuing merger candidates, agency theory, and takeover regulation. Places a heavy emphasis on case projects and/or class presentations. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3462",
                "title": "Behavioral Finance",
                "description": "Explores behavioral paradigms as they relate to investments. Considers psychological biases that might affect investment behavior and examines empirical evidence that investors are subject to these biases. Explores the possibility that investor behavior affects asset prices. For example, do stocks held by a limited number of investors sell for less than stocks held by many investors? Before taking this course, students should have a solid understanding of the time value of money (discounting), capital budgeting, and the evaluation of multi-stock portfolios. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3464",
                "title": "Real Estate Finance",
                "description": "Focuses on the risks, practices, and problems particular to financing and investing in real property. Teaches the concepts and techniques necessary to analyze financial decisions embedded in property development and investment. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3474",
                "title": "Derivative Securities",
                "description": "Explores business risk management using futures and options. Considers the institutional features of futures and option pricing. Covers managing financial risks such as foreign currency positions, general interest rate risk management, and includes estimation of option related metrics such as hedge ratios. Exotic options are also covered as well as the mathematics of option pricing. This class offers a full introduction to derivatives trading and pricing. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "2480/3480",
                "title": "Emerging Company Finance",
                "description": "Covers financial topics most relevant to newly formed companies, with an emphasis on Silicon Valley-style startups that target large markets and raise outside capital. Includes topics on: (1) valuation, which is the course&aposs primary theme, underlying all of the topics covered, (2) evaluating business opportunities, which focuses on the underlying economic principles that differentiate large opportunities from small opportunities, (3) funding business opportunities, which covers both identifying a company&aposs needs and acquiring the capital to finance those needs, and (4) discussing how successful entrepreneurial ventures \"exit.\". Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3482",
                "title": "Business Valuation",
                "description": "Discusses implementing finance theory for valuation problems. Provides practical valuation tools for valuing a company and its securities. Covers valuation techniques including discounted cash-flow analysis, estimated cost of capital, market multiples, free-cash flow, and pro forma models. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3484",
                "title": "Financial Engineering",
                "description": "Examines the design, valuation, and risk management of derivative securities (futures, options, etc.), including structured products. Includes topics on arbitrage theory, futures, equity options, bond options, credit derivatives, swaps, and currency derivatives. Mathematical modeling of derivatives, including implementation and applications in investments, corporate finance, and risk management. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3486",
                "title": "Behavioral Corporate Finance and Risk Management",
                "description": "Identifies the key psychological obstacles to value maximizing behavior, along with steps that managers can take to mitigate their effects. Given that behavioral traps represent one of the most important obstacles to successfully implementing skills taught in traditional corporate finance courses, understanding these traps is absolutely essential. Teaches how to put the traditional tools of corporate finance to the best use and mitigate the effects of psychological obstacles that reduce value. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3488",
                "title": "Financial Instruments and Markets",
                "description": "Covers the basics of financial instruments and the markets in which these instruments trade. Consists of two sections: fixed income securities and derivative securities. Uses case studies to introduce advanced securities and institutional features of their markets in which these securities trade. Develops a framework for analyzing new financial instruments including decomposing a security into simpler pieces, analyzing (pricing, hedging, etc.) each piece separately, and putting the pieces back together for a unified analysis. Explores the security design process, and the role and motivation of financial intermediaries, including commercial banks, investment banks, insurance companies, and hedge funds. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3489",
                "title": "Mathematical Finance",
                "description": "This course will comprise an immersion into the mathematics and models of modern finance, with an emphasis on conceptual and mathematical understanding, as well as building and implementing models. It will be technology dependent since computers are essential to solving problems in this field. Prerequisites: FNCE 451 or FNCE 2452 or FNCE 3452 or FNCE 3000 (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3490",
                "title": "Machine Learning with R",
                "description": "This course introduces aspiring data scientists to quantitative techniques and algorithms that are based on numerical and textual data, and to theoretical models of big systems or optimization that are currently being used widely in business. The course will prepare participants for more rigorous analysis of large data sets as well as introduce machine learning models and data analytics for business intelligence. Prerequisites: ECON 3400 or ECON 3000 and OMIS 3350 or OMIS 3200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3491",
                "title": "Investments",
                "description": "Investment knowledge is important to investment professionals, such as portfolio managers and financial advisers. They must know how to evaluate and select stocks, bonds, options and other securities, and how to guide investors to fitting portfolios and good investment behavior. Investment knowledge is also important to all of us as individual investors. The world of investment is changing rapidly as investment responsibilities and power move into the hands of individuals. The typical retirement plan is now a 401(k) type defined contribution savings plan where individuals make investments decisions and live by their outcomes. This course is centered on evidence-­based knowledge of investments and investment behavior. It presents side by side standard and behavioral investment theory, evidence, and practice. These include analysis of wants and cognitive and emotional shortcuts and errors, portfolios, life-­cycles of saving and spending, asset pricing, and market efficiency. These also include analysis of financial markets, such as stock exchanges, and securities, such as stocks, bonds, options, and futures. Prerequisites: FNCE 3000 or FNCE 3452 or FNCE 2452. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3727/MKTG",
                "title": "3713. Business Model Frameworks",
                "description": "Covers different types of business opportunities available to lifestyle, opportunistic, and innovating entrepreneurs, distinguished in general categories that encompass virtually all business ideas. In each case, develop a framework for an entrepreneur to use to identify an opportunity potential; understand and take the appropriate first steps toward building the business; and evaluate the early trajectory of the business to maximize learning and decide whether the opportunity is worth continuing. Prerequisite: None. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "3728",
                "title": "Alternative Investments 1 | Partnerships and Venture Capital",
                "description": "This is the first in a series of two courses that cover alternative investments. Alternative investments contrast to widely-held investments like stocks, bonds, and mutual funds. This course covers how these investments are generally structured along with a closer study of a particular category, venture capital. Prerequisite: FNCE 3000. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "FNCE",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "Covers special topics. Offered on an occasional basis. (3 units)",
                "units": "3 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Operations Management and Information Systems",
        "abbr": [
            "OMIS"
        ],
        "courses": [
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "15",
                "title": "Introduction to Spreadsheets",
                "description": "Using spreadsheets to analyze business data and present the findings in tables, charts, and graphs. Topics covered will include spreadsheet formulas, functions, pivot tables, and pivot charts. Students will also learn how to retrieve data from sources such as text files, relational databases, and servers. Students may not take both OMIS 15 and 17 for credit. Students must have less than 87.5 units completed. (2 units)",
                "units": "2 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "17",
                "title": "Introduction to Business Computing",
                "description": "Using spreadsheets and database management systems to analyze business data and present the findings in tables, charts, and graphs. Topics covered will include spreadsheet formulas, functions, pivot tables and charts, and SQL queries. Students will also learn the workings of relational database management systems. Students may not take both OMIS 15 and 17 for credit. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "30",
                "title": "Introduction to Programming",
                "description": "Fundamental methodologies and approaches to computer programming, with emphasis on problem solving, top-down program design, and thinking like a programmer. Students will learn basic structures of computer programming; analyze real business problems from a computer programmer perspective; and program, test, and debug well-structured programs. Focuses on essential aspects of writing software that include good design, modularity, efficiency, documentation, clarity, portability, and style. Students will obtain hands-on programming skills through several programming assignments. This course is the basis for business application development in database design and systems programming courses. Students who receive credit for CSCI 10 (formerly MATH 10), COEN 6, COEN 11, or OMIS 31 may not take this course for credit. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "31",
                "title": "Business Applications Programming",
                "description": "Develop and implement business application programs using software tools such as Visual Studio, Visual Web Developer, and Dreamweaver. Students will develop both Windows and Web applications. Assignments will use programming frameworks such as .NET and PHP. Students who take CSCI 10 (formerly MATH 10), OMIS 30, COEN 6, or COEN 11 may not take this course for credit. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "34",
                "title": "Science, Information Technology, Business, and Society",
                "description": "Examines the complex relationship among science, information technology, business, and society. Investigates major breakthroughs in information technology, how they were influenced by business needs, and how they affect business and society. Explores social and cultural values in business science and technology, and economic challenges posed by rapid business information technology. Also examines the workings of major components of information technology used in business today. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "40",
                "title": "Statistics and Data Analysis I",
                "description": "First course in a two-course sequence. Students learn to summarize and describe sets of data using numerical and graphical methods; to quantitatively express the probability of events and utilize probability rules; to employ probability distributions to describe the probabilities associated with discrete and continuous random variables, and to compute means and variances; to evaluate sample data collection plans for quantitative and qualitative data; and to construct interval estimates for the population mean. Students analyze real-world data using spreadsheet software. Prerequisites: MATH 11 or 30, and OMIS 15 or 17. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "41",
                "title": "Statistics and Data Analysis II",
                "description": "Second course in a two-course sequence. Students learn to construct confidence intervals and test hypotheses about means, proportions, and variances for one and two populations; to formulate and test hypotheses about multinomial data; to construct both simple and multiple regression models, evaluate model quality and predict the value of dependent variables using regression. Students analyze real-world data using spreadsheet software. Prerequisites: OMIS 15 or 17, and OMIS 40. (4 units)",
                "units": "4 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Lower-Division",
                "id": "43",
                "title": "Data Wrangling and Visualization",
                "description": "Cross-listed with ECON 43. Prerequisites: MATH 30 and OMIS 40 (2 units)",
                "units": "2 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "105",
                "title": "Database Management Systems",
                "description": "This course presents issues related to databases and database management systems (DBMS). Students will acquire technical and managerial skills in planning, analysis, design, implementation, and maintenance of databases. Hands-on training in relational database design, normalization, SQL, and database implementation will be provided. Use of DBMS software is required. Emphasis is placed on the issues of managing a database environment. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "106",
                "title": "Systems Analysis and Design",
                "description": "This course presents methodologies and approaches to the analysis and design of computer-based information systems for business applications. Topics include the systems development lifecycle, development methodologies, requirements determination, use case analysis, process modeling, systems architecture, program, and interface design, systems implementation, and organizational transition. Application of the studied methodologies and techniques to a systems analysis and design project is required. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "107",
                "title": "Systems Programming",
                "description": "Discussion of the fundamental concepts of systems programming. Major focus on the overall structure and capabilities of modern operating systems (LINUX/UNIX, Windows, etc.) and how to use operating system facilities to manipulate files and processes. Also covers shells and scripting programming concepts for performing system-level programming assignments on dedicated computer systems. Development of several software assignments utilizing systems programming concepts is required. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "108",
                "title": "Operations Management",
                "description": "Survey of analysis and design methods for business systems that produce and deliver goods and services. Topics chosen from the following: process analysis, sales forecasting, production planning and scheduling, inventory management, material requirements planning, quality control, lean manufacturing, and supply chain management. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "108E",
                "title": "Sustainable Operations Management",
                "description": "This version of OMIS 108 emphasizes applications to sustainable business practices. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "108S",
                "title": "Operations Management",
                "description": "Enrollment in this version of OMIS 108 is restricted to students in the Leavey Scholars Program. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "109",
                "title": "Prescriptive Analytics",
                "description": "Mathematical methods for solving decision problems encountered in business situations. Emphasis on problem formulation and application of spreadsheet-based algorithms for solution. Linear models and linear programming. Sensitivity analysis. Network models. Integer and nonlinear programming. Decision analysis and value of information. Dynamic analysis and the principle of optimality. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "110",
                "title": "Computer Simulation Modeling",
                "description": "Examination of computer simulation modeling for the design and operation of complex processes or systems. Theory and techniques of simulation and simulation languages such as SLAM, GPSS, and GASP; inventory control; assembly and job-shop scheduling; and manufacturing process design. Prerequisites: OMIS 41 or ECON 41 and 42 and OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "111",
                "title": "Computer Communications Systems",
                "description": "Designed to provide the information systems professional with a basic literacy in communication technologies driving the digital economy. Basics of data and telecommunications, LANs, WANs, broadband, analog and digital communications, Internet architecture and concepts, wireless including cellular and WLANs, and market and regulatory issues are covered. Emphasis on being able to assess the business impact of networking technologies. Prerequisite: OMIS 30, 31, or 34. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "113",
                "title": "Data Warehousing and Business Intelligence",
                "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in\\ order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data\\ structures (e.g. time series, cross-sectional) that are frequently used in several different business contexts, (2)\\ demonstrates predictive model construction techniques on different data structures, and (3) focuses on\\ improving out-of-sample predictive performance. Topics include time series analysis and forecasting,\\ regression models, classification and prediction models, text mining and analytics, and social network\\ analysis. Prerequisite: OMIS 114. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "113",
                "title": "Data Warehousing and Business Intelligence",
                "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in\\ order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data\\ structures (e.g. time series, cross-sectional) that are frequently used in several different business contexts, (2)\\ demonstrates predictive model construction techniques on different data structures, and (3) focuses on\\ improving out-of-sample predictive performance. Topics include time series analysis and forecasting,\\ regression models, classification and prediction models, text mining and analytics, and social network\\ analysis. Prerequisite: OMIS 114. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "113",
                "title": "Data Warehousing and Business Intelligence",
                "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in\\ order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data\\ structures (e.g. time series, cross-sectional) that are frequently used in several different business contexts, (2)\\ demonstrates predictive model construction techniques on different data structures, and (3) focuses on\\ improving out-of-sample predictive performance. Topics include time series analysis and forecasting,\\ regression models, classification and prediction models, text mining and analytics, and social network\\ analysis. Prerequisite: OMIS 114. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "113",
                "title": "Data Warehousing and Business Intelligence",
                "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in\\ order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data\\ structures (e.g. time series, cross-sectional) that are frequently used in several different business contexts, (2)\\ demonstrates predictive model construction techniques on different data structures, and (3) focuses on\\ improving out-of-sample predictive performance. Topics include time series analysis and forecasting,\\ regression models, classification and prediction models, text mining and analytics, and social network\\ analysis. Prerequisite: OMIS 114. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "113",
                "title": "Data Warehousing and Business Intelligence",
                "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in\\ order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data\\ structures (e.g. time series, cross-sectional) that are frequently used in several different business contexts, (2)\\ demonstrates predictive model construction techniques on different data structures, and (3) focuses on\\ improving out-of-sample predictive performance. Topics include time series analysis and forecasting,\\ regression models, classification and prediction models, text mining and analytics, and social network\\ analysis. Prerequisite: OMIS 114. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "116",
                "title": "Applied Machine Learning",
                "description": "This course examines applications of artificial intelligence and expert systems for business. Topics include rule-based systems, data and Web mining, and other knowledge-based systems. Prerequisite: OMIS 30 and",
                "units": "This course examines applications of artificial intelligence and expert systems for business. Topics include rule-based systems, data and Web mining, and other knowledge-based systems. Prerequisite: OMIS 30 an"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "117",
                "title": "Software Development Project",
                "description": "Integration of system and programming concepts to develop a comprehensive software system. Also presents an overview of software development methodology. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "120",
                "title": "Web Programming",
                "description": "The course will focus on the design and development of Web-based applications using a number of currently popular tools and strategies, and also explore the use of databases as data repositories for Web applications. Core technologies including HTML, CSS, XML, JavaScript, PHP, MySQL, and AJAX will be emphasized. Prerequisites: OMIS 30, and",
                "units": "The course will focus on the design and development of Web-based applications using a number of currently popular tools and strategies, and also explore the use of databases as data repositories for Web applications. Core technologies including HTML, CSS, XML, JavaScript, PHP, MySQL, and AJAX will be emphasized. Prerequisites: OMIS 30, an"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "135",
                "title": "Enterprise Resource Planning Systems",
                "description": "Enterprise Resource Planning (ERP) systems are the foundation of modern business processes. Study of business process integration, ERP technology, and ERP implementation. Students will have the opportunity to work with ERP software from SAP. Includes a team project and case studies. Prerequisite: OMIS 105 or COEN 178. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "137",
                "title": "Object-Oriented Programming",
                "description": "Introduction to object-oriented design methodology. Discussion of different programming paradigms, concepts of data abstraction, inheritance, and encapsulation. Topics include an overview of Java programming language, classes and objects, data abstraction, inheritance, I/O packages, exceptions, threads, and GUI. Development of several programming assignments using Java is required. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "145",
                "title": "Competitive Quality",
                "description": "Slogans like \"Quality is Job 1\"; \"When it absolutely, positively has to be there overnight\"; and \"The Dependability People\" leave little doubt as to the importance of quality in commercial competition. This course explores how quality contributes to competitiveness. The course starts by defining quality and introducing methods for measuring quality. The course investigates variation in quality and its effect on firm performance, and studies methods for monitoring and controlling quality including quality control charts and sampling inspection. Finally, in light of new developments in operations theory and in technology for tracking and monitoring products, the course also tackles strategic supply chain issues associated with quality. Case studies and field trips are used to bolster student understanding. Prerequisites: ECON 1 and OMIS 108/108E/108S. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "150",
                "title": "Financial Information Systems",
                "description": "Course focuses on computer-based financial information systems that allow finance and accounting professionals to acquire and manage a company&aposs financial system. Topics include the business functions of a financial information system, the technical aspects of the system, and the management issues of implementing such a system. Students will acquire hands-on experience using ERP systems. Students who receive credit for ACTG 155 may not take this course for credit. Also listed as ACTG 155. Prerequisites: OMIS 30, and OMIS 105. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "170",
                "title": "Physical Database Design",
                "description": "Methodology for design of physical file structures to support single- and multiple-file applications. Query optimization using indexes. Data structures, file structures, file access methods, file manipulation, and algorithmic analysis. Prerequisite: OMIS 105. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "173",
                "title": "E-commerce Technologies",
                "description": "An integrated course discussing techniques needed to build, operate, and maintain e-businesses. Topics include scripting languages, markup languages, security, online transaction, and multimedia operation. Prerequisite: OMIS 30. (5 units)",
                "units": "5 units"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "198",
                "title": "Internship",
                "description": "Opportunity for selected upper-division students to work in local businesses or government units. Requires a faculty advisor and should be fairly well structured. Note: A student cannot use a collection of internship courses to satisfy the upper-division course requirement for any of the OMIS department&aposs major or minor programs. Prerequisites: Upper-division standing and approval of the undergraduate committee one week prior to registration. Written proposal must be approved by instructor and chair one week prior to registration. (1 unit)",
                "units": "1 unit"
            },
            {
                "ABBR": "OMIS",
                "type": "Upper-Division",
                "id": "199",
                "title": "Directed Reading/Directed Research",
                "description": "Independent projects undertaken by upper-division students with a faculty advisor. Note: A student cannot use a collection of directed reading/directed research courses to satisfy the upper-division course requirement for any of the OMIS department&aposs major or minor programs. Prerequisites: Upper-division standing and approval of the undergraduate committee one week prior to registration. Written proposal must be approved by instructor and chair one week prior to registration. (1--5 units)",
                "units": "1--5 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "2353",
                "title": "Statistical Methods",
                "description": "Introduces probability and statistical analysis, emphasizing applications to managerial decision problems. Discusses descriptive statistics, probability theory, sampling distributions, statistical estimation, hypothesis testing, and simple and multiple regressions. Additional topics may include exploratory data analysis, analysis of variance, and contingency tables. Open to MSF and MSE students only. Prerequisite: Demonstrated math analysis/calculus proficiency. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "2355",
                "title": "Computer-Based Decision Models",
                "description": "Integrative course focuses on using computer-based models to improve managerial decision-making. Treats rigorous formulation of business decision problems, computer-based solution methods, and interpretation of results. Features sensitivity and scenario analysis, mathematical programming and decision analysis. In some cases, simulation may be included. Applies techniques to problems in operations management, finance, accounting, and marketing. Prerequisites: OMIS 2353, and spreadsheet proficiency. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3200",
                "title": "Quantitative Methods",
                "description": "Introduction probability and statically analysis, emphasizing applications to managerial decision problems. Discusses descriptive statistics, probability theory, sampling distributions, statistical estimation, hypothesis testing, and simple and multiple regressions. Additional topics may include exploratory data analysis, analysis of variance, and contingency tables. Prerequisites: None (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3202",
                "title": "Analysis Decision Making",
                "description": "This course covers how to rigorously formulate decision problems, understand mathematical optimization, deal with the uncertainties inherent in real business problems, while introducing computer modeling tools like important Excel add-ons, R, Mathematica, CrystalBall, and @Risk. Prerequisites: OMIS 3200 (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3250",
                "title": "Analysis, Design, and Management of Enterprise Platforms",
                "description": "Introduces the information technology infrastructures that enable within and across firm operations, and the competitive advantages that information technology can offer various firms. Focuses on how firms effectively utilize information technology resources in their business models and operations. Prerequisites: OMIS 3200. (2 units)",
                "units": "2 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3252",
                "title": "Operations Management",
                "description": "This course introduces how firms get the right products and services to the right people, in the right place, at the right time and cost. In addition to firms that provide physical goods, this course covers information-enabled, supply-demand matching networks like Uber and AirBnB that vastly reduce cost and increase convenience in operationally intensive industries. Prerequisite: OMIS 3200 and OMIS 3202.",
                "units": ""
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3357",
                "title": "Operations Management",
                "description": "Surveys methods for planning and executing processes to achieve high quality, low cost, and timely delivery of goods and services. Topics include capacity analysis, forecasting, inventory planning, supply chain management, Lean Production, statistical quality control, aggregate planning, and MRP. Emphasizes operational knowledge that is essential for all other functions in a firm. Prerequisite: OMIS 2355 or OMIS 3352. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3362",
                "title": "Computer Simulation and Modeling",
                "description": "Uses computer simulation to design and operate complex processes or systems. Employs design, validation, operating procedures, and analyzing results of computer simulation experiments. Studies examples of computer simulation applications, including different types of scheduling, such as assembly line and job shop, distribution system design, inventory reordering design, waiting line systems, and manufacturing processing design. Cross-listed as MSIS 2626. Credit will not be given for both. Prerequisites: OMIS 353 or OMIS 2353 or OMIS 3350 or OMIS 3200 and knowledge of one programming language. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3366",
                "title": "Database Management Systems",
                "description": "Introduces database management and database management systems (DBMS). Teaches technical and managerial skills in database planning, analysis, logical design, physical design, implementation, and maintenance. Features hands-on training in database design, development, and implementation using relational DBMS software. Emphasizes designing and developing reliable databases to support organizational management. Cross-listed as MSIS 2603. Credit will not be given for both. Prerequisite: Computer experience. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3372",
                "title": "Information Systems Analysis and Design",
                "description": "Examines methodology to assist in analyzing and designing computer-based information systems for business applications. Features tools including data flow diagrams, flowcharts, Structured English, pseudo code, hierarchy charts, structure diagrams, and Warnier-Orr charts. Requires applying these tools to a systems development project. Cross-listed as MSIS 2602. Credit will not be given for both. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3374",
                "title": "Artificial Intelligence",
                "description": "Provides a survey of basic concepts in artificial intelligence and their applications to business-oriented problems. Includes production systems, search techniques, knowledge representation, and inference techniques as well as calculus, statistical and probabilistic reasoning, design and implementation of expert systems, and understanding natural languages. Entails application developments using Expert System shells. Prerequisite: OMIS 353 or OMIS 2353 or OMIS 3350 or OMIS 3200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3378",
                "title": "Information Systems Policy and Strategy",
                "description": "Studies strategic management and deployment of information systems and technologies (ISTs) to improve business competitiveness. Examines of the role of IST strategy in enabling companies to effectively manage in the turbulent and dynamic business environment brought about by the Internet. Analyzes new business opportunities in electronic commerce brought about by ISTs, including organizational redesign that these technologies require. Considers implementation and change management issues related to IST deployment in the new environment. Focuses on drawing lessons from the experiences of leading companies that are deploying ISTs to define and support their e-commerce strategies. Cross- listed as MSIS 2604. Credit will not be given for both. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3384",
                "title": "Supply Chain Management",
                "description": "Focuses on the key challenges and issues relating to design, analysis, and management of supply chains to gain competitive advantage. The goal of the course is to assess supply chain performance and improve execution by effectively managing inventory, capacity, logistics and supply chain relationships. Additional topics include the role of information technology in this context, supply chain network design, and managing supply chains in environments with product innovation and proliferation. Prerequisite: OMIS 3357 or OMIS 3252. (4 units)",
                "units": "4 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "3386",
                "title": "Business Intelligence and Data Warehousing",
                "description": "Introduces technologies and managerial issues related to data warehousing, business intelligence, decision support systems, data mining, Web mining, and customer relationship management. Teaches technical and managerial skills in using and developing decision support applications. Emphasizes learning how to derive business value from large amounts of data. Provides hands-on training using a variety of BI tools. Cross-listed as MSIS 2621. Credit will not be given for both. Prerequisite: OMIS 3366 or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "OMIS",
                "type": "Graduate",
                "id": "2390/3390",
                "title": "New Product Development",
                "description": "Introduces students to the methods companies use to develop and release new products. New product development is a challenging, rewarding activity that can make the difference between success or failure for a company, especially in technology-based industries. The traditional view that new product development is an \"art\" practiced by engineers has now given way to an understanding that it is a discipline that must be learned and practiced to be successful. Examines the sequence of activities needed to successfully develop and launch a new product or service; understand how the different functions and roles in product development interrelate and work together; learn how to balance strategic and tactical activities in successful product development; develop a better understanding of how to determine and satisfy customer needs; understand the financial aspects of product development; develop the skills to analyze and improve product development efforts within a company. (3 units)",
                "units": "3 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Information Systems",
        "abbr": [
            "MSIS"
        ],
        "courses": [
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2601",
                "title": "Object-Oriented Analysis and Programming",
                "description": "Addresses advanced topics in object-oriented programming methodology. Presents different programming paradigms and discusses object- oriented programming concepts including principles of data abstraction, inheritance, polymorphism, and encapsulation. Emphasizes problem solving using Java programming language. Includes topics on classes and objects, data abstraction, \"agents, message, and methods,\" class hierarchies and inheritance, I/O packages, applets, exceptions, and multithreaded programming. Requires developing several programming assignments using Java programming language in various computer environments. Prerequisite: Knowledge of C programming language or equivalent. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2602",
                "title": "Information Systems Analysis and Design",
                "description": "Examines methodologies to assist in analyzing and designing computer-based information systems for business applications. Features tools including data flow diagrams, flowcharts, Structured English, pseudo code, hierarchy charts, structure diagrams, and Warnier-Orr charts. Requires applying these tools to a systems development project. Cross-listed as OMIS 3372. Credit will not be given for both. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2603",
                "title": "Database Management Systems",
                "description": "Introduces database management and database management systems (DBMS). Teaches technical and managerial skills in database planning, analysis, logical design, physical design, implementation, and maintenance. Features hands-on training in database design, development, and implementation using relational DBMS software. Emphasizes designing and developing reliable databases to support organizational management. Cross-listed as OMIS 3366. Credit will not be given for both. Prerequisite: Experience with computer usage. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2604",
                "title": "Information Systems Policy and Strategy",
                "description": "Studies strategic management and deployment of information systems and technologies (ISTs) to improve business competitiveness. Examines of the role of IST strategy in enabling companies to effectively manage in the turbulent and dynamic business environment brought about by the Internet. Analyzes new business opportunities in electronic commerce brought about by ISTs, including the organizational redesign that these technologies require. Considers implementation and change management issues related to IST deployment in the new environment. Focuses on drawing lessons from the experiences of leading companies that are deploying ISTs to define and support their e-commerce strategies.Cross-listed as OMIS 3378. Credit will not be given for both. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2605",
                "title": "Telecommunications and Business Networks",
                "description": "Presents the essential technical understanding necessary to evaluate and integrate telecommunication technologies into sustainable business models as well as to make decisions concerning the communications infrastructure, in any organization. Covers technology topics including voice and data networks, local and wide area networking, Internet, and generations of wireless technologies that form the basis for the discussion of economic and managerial issues about how the technology is deployed, including issues of interoperability, scalability, regulations, security, service level agreements, convergence, unified messaging, and service quality. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2606",
                "title": "Software Project Management",
                "description": "Provides an overview of software project development methodology, covering both technical and managerial aspects of software development. Examines alternate software life-cycle models and introduces modern techniques for definition, design, implementation, and validation of software products. Prerequisites: MSIS 2601 and 2602, or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2621",
                "title": "Business Intelligence and Data Warehousing",
                "description": "Introduces technologies and managerial issues related to data warehousing, business intelligence, decision support systems, data mining, Web mining, and customer relationship management. Teaches technical and managerial skills in using and developing decision-support applications. Emphasizes learning how to derive business value from large amounts of data. Provides hands-on training using a variety of BI tools. Cross-listed as OMIS 3386. Credit will not be given for both. Prerequisite: MSIS 2603 or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2622",
                "title": "ERP Systems",
                "description": "Analyzes enterprise resource planning (ERP) systems through a managerial perspective and examines system implementation. ERP systems attempt to integrate all departments and functions across a company onto a single computer system that can serve every department&aposs particular needs for up-to-date and accurate data, independent of language, location, and currency. These systems dictate a standard data format across the entire organization; they are modular, multifunctional, and compatible with third-party software. Applies concepts and techniques discussed in class through a hands-on group project. Investigates multivendor systems and integration issues. Prerequisite: MSIS 2602 and 2603 or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2623",
                "title": "Financial Information Systems",
                "description": "Examines analysis, design, and implementation of enterprise information systems as they relate to the accounting function and corporate financial management. Emphasizes learning not only what functions the systems provide, but also understanding their technological structure and linkages with business strategy. Moreover, enables students to recognize organizational situations for which information system controls and assurance would help achieve organizational goals, and to participate in planning, development, and implementing control devices in highly automated contexts. Prerequisites: ACTG 2301, MSIS 2602, and MSIS 2603 or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2624",
                "title": "E-Business Technologies - Virtualization",
                "description": "This course provides a detailed survey and application of server virtualization and cloud computing technologies. The main focus of the course is large scale application of virtualization and cloud computing technologies to improve business effectiveness. Historical perspectives, current practices, and future directions are also presented. This course examines virtualization and cloud computing concepts, base technologies, and how they are used practitioners to provide better and more cost effective resource utilization and laaS capabilities. Prerequisites: MSIS 2601 and 2602. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2625",
                "title": "Information Security Management",
                "description": "Explores the techniques and technologies of information and data security and considers overall security policy and procedures given that computers and the Internet have revolutionized the way we live and do business. Companies are vulnerable to a number of security threats including virus writers or computer hackers taking advantage of the relatively unknown properties of computers and the networks as well as abuse by its legitimate users. Prerequisites: MSIS 2601 and 2603 or instructor approval. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2626",
                "title": "Computer Simulation and Modeling",
                "description": "Uses computer simulation to design and operate complex processes or systems. Employs design, validation, operating procedures, and analysis of results of computer simulation experiments. Studies examples of the applications of computer simulations, including different types of scheduling, such as assembly line and job shop; distribution system design; inventory reordering design; waiting line systems; and the manufacturing processing design. Cross-listed as OMIS 3362. Credit will not be given for both. Prerequisites:OMIS 2355 and knowledge of one programming language. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2627",
                "title": "Big Data Modeling and Analytics",
                "description": "Today, more than 80% of useful data is unstructured. Businesses, governments and all organizations now wants to store, process and analyze these huge datasets economically and predictably to solve numerous problems - find new markets, reduce risks, improve healthcare and many such applications. Today&aposs useful data has velocity, variety and volume. Old SQL databases are not fit to handle the new requirements. Term \"Big Data\" was coined to solve the emerging problem. This course is about Big Data and its role in carrying out modern business intelligence for actionable insight to address new business needs. This is a lab led and open source software rooted course. Students will learn the fundamentals of Hadoop framework, NoSQL databases and R language. The class will focus on storage, process and analysis aspects. Students will have access to a MapR Hadoop image. The image is enhanced by instructor to include MongoDB and R. Prerequisites: MSIS 2601 and 2603. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2628",
                "title": "The Business of Cloud Computing",
                "description": "Students will learn the Challenges and Solutions to manage a Cloud Infrastructure. The focus areas of this course will include Best Practices for a Dynamic Cloud Infrastructure, Cloud Operations Management and Cloud Security. Students learn the essentials, Challenges and how to manage a Cloud Infrastructure. This will be a fast paced, hands on class, where students would be deploying, managing their own Cloud Infrastructure. Employing, managing, and monitoring tools and techniques to help get the most from Cloud Computing resources and applications. The course will introduce strategies and plans for securing data to meet the highest level of Cloud security and compliance standards. Exploration of legal and privacy issues, regulations, and compliance for Cloud Computing will also be presented. The students are expected to know the basics of Virtualization, Computer Architecture, Computer Networking and IMS. Prerequisites: MSIS 2601 and 2603. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2629",
                "title": "Dashboards, Scorecards, and Visualization",
                "description": "This course will introduce dashboards and scorecards for presenting and analyzing critical performance and operational data. It will teach students how these tools can be used to translate business strategy into accountability and measure progress against goals. This course will introduce dashboard functionality, characteristics and components, key elements, design principles, security, standards and best practices. It will highlight differences between dashboards and scorecards, which are used for measuring performance. You will explore the optimal selection and use of key performance indicators (KPIs). You will learn how dashboards and scorecards can be designed and implemented. The course will also introduce you to various software tools used to create dashboards and scorecards and, also, how to select them. The students will work on a group project in which they will functionally design a dashboard and scorecard, which will reflect a real-world business environment. Prerequisites: MSIS 2601 and 2603. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2630",
                "title": "Web Programming",
                "description": "The course will focus on the design and development of web based applications using a number of currently popular tools and strategies; also to be explored is the use of databases as data repositories for web applications. Core technologies including HTML, CSS, JavaScript, PHP, and MySQL will be emphasized. Prerequisites: MSIS 2601 and 2603. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2640",
                "title": "Capstone Project Proposal",
                "description": "An industry project is one option for satisfying the Capstone requirement. MSIS students work with the Capstone Faculty Director to form a team, choose a topic, and develop a formal project proposal to begin their Capstone project. The MSIS faculty director reviews and approves all projects. Once approved and a faculty advisor assigned, the team can register for MSIS 2642 (Capstone Project 1). (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2641",
                "title": "Information Technology: Ethics and Public Policy",
                "description": "Introduces the normative principles for ethical decision-making: identifying which principles are applicable; and, weighing conflicting principles. Includes in-depth exploration of contemporary ethical issues, together with public policy issues relating to information technology in the context of the legal environment of business. Class lectures and discussions are based on the textbook, supplemented by ethical simulations and scenarios. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2642",
                "title": "Capstone Project I",
                "description": "(2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2643",
                "title": "Capstone Project II",
                "description": "(3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2644",
                "title": "Master&aposs Thesis (Capstone Option)",
                "description": "Students individually or as a team of two propose a research project to one of the MSIS faculty. This option requires approval by the supervising faculty member and the director of the MSIS program. The objective is to study an information system topic in detail and advance the state of the knowledge in that field theoretically, or to apply the state-of-the art information system technology to solve a problem. The outcome of this option is development of a final report and the successful submission of a research manuscript to a referred journal for publication. This option may span two or more quarters. (6 units)",
                "units": "6 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2645",
                "title": "Capstone Design Project Proposal",
                "description": "The Capstone Design Project is an alternate option for satisfying the MSIS Capstone requirement. Capstone Design Project is similar to Industry project, except that the IT project proposal and development of the project is performed in house. MSIS students who are half way through their course work can submit an IT project proposal of interest to the Capstone faculty director. Once the proposal is accepted by the Capstone faulty director, a team of Capstone-ready MSIS students will be designated. The newly formed Capstone Design team meets with the Capstone faculty advisor and reviews the project proposal. Once the proposal has been reviewed and approved by the Capstone faculty advisor, the proposal is reviewed and approved by the MSIS faculty director. Once approved and a faculty advisor assigned, the team can register for MSIS 2646 (Capstone Project) (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2646",
                "title": "Capstone Design Project I",
                "description": "(2 units)",
                "units": "2 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2647",
                "title": "Capstone Design Project II",
                "description": "(3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "28XX",
                "title": "Emerging Topics in IT Management",
                "description": "Covers special topics; offered on an occasional basis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2301",
                "title": "Financial and Managerial Accounting",
                "description": "This course combines an introduction to financial and managerial accounting to assist students in understanding how these disciplines contribute to the success of the firm. It will focus on the interpretation of reported financial information and how these disciplines contribute to decision-making in the firm. Open to MSIS students only. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2501",
                "title": "Building and Leading High-Performance Teams and Organizations",
                "description": "Explores group dynamics to enable students to perform more effectively in groups and teams. Provides students with feedback on individual managerial competencies to aid in career self-management and planning. Open to M.S. students only. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "MSIS",
                "type": "Graduate",
                "id": "2355",
                "title": "Computer-Based Decision Models",
                "description": "Integrative course focuses on using computer-based models to improve managerial decision-making. Treats rigorous formulation of business decision problems, computer-based solution methods, and interpretation of results. Features sensitivity and scenario analysis, mathematical programming and decision analysis. In some cases, simulation may be included. Applies techniques to problems in operations management, finance, accounting, and marketing. Prerequisites: OMIS 353, and spreadsheet proficiency. (3 units)",
                "units": "3 units"
            }
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "Leavey School of Business",
        "department": "Interdisciplinary",
        "abbr": [
            "IDIS"
        ],
        "courses": [
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3612",
                "title": "Management of the High-Technology Firm Seminar",
                "description": "Identify and analyze business issues and problems that are particularly important or unique to innovative high-technology companies. Topics vary from seminar to seminar, and include a selection from project management, production, marketing, personnel, investment decisions, expansion to international markets, banking, venture capital, pricing, technological transfer, relationships with government bodies and the media, and legal issues related to patents and trade secrets. The seminar is divided into segments of one or two sessions taught through case studies by executives and public officials. Prerequisite: MBA students--completion of a minimum of 10 MBA courses; MSIS students--completion of 8 courses (4 business courses and 4 IS courses). (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3622",
                "title": "Global Agribusiness Challenges",
                "description": "The focus of this course is on encouraging students to develop a sound understanding of key supply, demand and technological innovation drivers which food and agribusiness managers must address and the distinctive strategies which they use to deal with them. This course is intended to complement MGMT 3540, so that the two courses cover the core requirement for the MBA agribusiness concentration. Prerequisite: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3695",
                "title": "Global Business Perspective",
                "description": "Through company sites and cultural visits, students learn to appreciate how business operates outside the United States. Country visits are bracketed by class sessions and pre-work followed by project presentations. Content varies based on the expertise of the faculty and the country visited. Past locations include Germany, France, China, New Zealand, Brazil, and India. Prerequisite: Varies by course. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "2700/3700",
                "title": "Effective Business Communications",
                "description": "Intensive practice in forms of communication specifically for business settings, geared to the student&aposs level of prior preparation. The focus will be primarily on oral communication and writing to support the oral communication. Emphasis on communicating complex issues and quantitative data to inform, advocate or persuade. Prerequisite: None. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3701",
                "title": "Critical Business Presentations",
                "description": "This course is designed to equip the student with speaking and presenting facility in both formal and informal business settings. The class centers around multiple presentations on a variety of topics. Focus will be on learning to shape messages and presentations to different audiences and purposes. This one-unit course will afford an introduction to effective presentation skills that should then be implemented into later coursework and workplace interactions. Business Communication theory, presentation practice and critique, interpersonal interaction in both traditional and social media forums, and conveying qualitative and quantitative information will serve as components of the course. Prerequisite: IDIS 3700. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3799",
                "title": "Managing Transitions I and IDIS 3800 Managing Transitions II",
                "description": "These course prepare students for the career transitions that they will encounter once completing Santa Clara University&aposs MBA program. These highly relevant courses concentrate on the skills students require to succeed early on in their careers. These lessons learned will be applicable to transitions throughout the students&apos careers. The courses are based on critical transitions, formative experiences, and personal conflict that characterize the common challenges MBAs are likely to face as they progress in their careers. One objective is to help students gain a more robust understanding of some of the pitfalls they may encounter as they make transitions within or across organizations. Research demonstrates that career failures are often associated with individual failures to successfully make these transitions. Blending theory and practice sessions will illustrate the lessons learned by others (such as SV executives) that have sometimes stumbled in making what seem to be straightforward transitions. Why are transitions challenging? Typically transitions require learning new skills and strategies for managing people who have different responsibilities, needs, goals and expectations than the individual has led in the past. For example, the role as individual team member vs. managing a team requires a shift in mindset from getting a job done through personal skills and effort to getting work done through others; shifting from a manager to a leader requires a shift in attention from focusing on doing things right to doing the right things. Such transitions often mean letting go of the very things that have made us successful in the past and deriving satisfaction from others&apos accomplishments. Although easy to understand conceptually, this marks a fundamental shift in individuals&apos identities. Prerequisite: All core courses. Must be taken in last quarter of residence. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3704",
                "title": "Women in Leadership",
                "description": "Presents the best practices of successful women technology leaders. Features a series of in-depth discussions and case studies where experts share the principles upon which they have created their businesses. Includes topics on vision, value creation, branding, product development and testing, recruitment and team building, management, financing, communication skills, networking, exit strategy and social impact. Prerequisite: None. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3711",
                "title": "Leadership: Vision, Deals and Process",
                "description": "Explores three distinct perspectives on leadership: vision, deal making, and process. Features experts with extensive experience in their area. For each perspective, presents a solid overview of the topic, specific skills needed to succeed in the arena, examples of business leaders who have translated ideals into action, and resources for continued learning. Prerequisite: MGMT 501 or MGMT 3500. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3797",
                "title": "Curricular Practicum Education",
                "description": "The primary purpose of co-op education is to give international students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience. It consists of a series of lectures on topics that will familiarize them with the Silicon Valley working environment, and will enable them to relate their experiences in the industry to their academic program. Attendance is mandatory. Prerequisites: One year of full-time course work and a GPA of 3.0 or higher. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "3798",
                "title": "Extended Curricular Practicum Education",
                "description": "Extension of IDIS 3797. Prerequisite: IDIS 3797. (1 unit)",
                "units": "1 unit"
            },
            {
                "abbr": "IDIS",
                "type": "Graduate",
                "id": "38XX",
                "title": "Experimental Course",
                "description": "",
                "units": ""
            }
        ]
    }
]