[
    {
        "university": "Santa Clara University",
        "school": "School of LAW",
        "department": "",
        "abbr": [
            "LAW"
        ],
        "courses": [
            {
                "id": "590",
                "title": "Civil Practice, High Tech, and Social Justice Externship I",
                "description": "Students learn about the functioning of lawyers through practical experience in law offices, governmental entities, nonprofit corporations, or high-tech companies. Students work under the direct supervision of a lawyer or individual otherwise qualified to supervise legal work. Students can earn up to 6 units, with 1 unit for every 50 hours of approved work. The Externship includes observation of/or participation in several of the following activities: interviewing and counseling; fact and law investigation and organization; resolution of client problems in non-adversarial contexts (e.g., drafting contracts, tax advice, estate planning); resolution of client problems in an adversarial context (e.g., negotiation, court appearances in various proceedings, drafting of litigation documents); internal office affairs (e.g., file management, client communications). Students must concurrently register for and successfully complete the Externship Workshop (706). Course credit will be awarded only upon satisfactory completion of both the externship and the Workshop. Graded Credit/No Credit. Prerequisite: Civil Procedure (114).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "abbr": "LAW",
                "type": "Graduate",
                "id": "207",
                "title": "Administrative Law",
                "description": "Powers and duties of administrative agencies and the legal doctrines governing agency actions such as rule making and administrative adjudication. Constitutional, legislative, and judicial controls over administrative practices and procedures are among the critical concerns of this course."
            },
            {
                "abbr": "LAW",
                "type": "Graduate",
                "id": "504",
                "title": "California Civil Procedure",
                "description": "Designed to introduce students to the actual workings of the California civil system. The procedures attendant on the litigation process from considerations prior to the filing of a complaint through the drafting of pleadings, motions, various discovery devices, trial-setting procedures, and procedures during and after trial."
            },
            {
                "id": "342",
                "title": "California Tax Appeals Assistance Clinic",
                "description": "Students represent live clients in tax appeal proceedings before the California State Board of Equalization (BOE). The clients are disadvantaged taxpayers appealing a tax liability less than $40,000, and students represent them under supervision of a faculty member who is an attorney with the Tax Appeals Assistance Program. This representation involves the direct communication with clients and with attorneys/representatives of the Franchise Tax Board and the BOE. Students will draft briefs and letters, and may have the opportunity to argue an appeal before the BOE in person. Students will work on approximately 2 to 3 cases per semester, from initial interviewing though trial and final disposition. Students meet weekly with the supervising attorney in a seminar class setting. Students receive credit for their work in practice, reflections, and case rounds with a supervisor. To receive full credit, students must attend all seminar, case rounds, and office hours and work a minimum of 100 hours (including preparation for class) per semester. This course is limited to 6 students. Federal Income Taxation is not a prerequisite or a required concurrent course, but it is recommended. This course satisfies the Professional Skills Requirement and will be graded on a pass/no pass basis.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "452",
                "title": "California Post-Conviction Procedures",
                "description": "Deals with limited proceedings after conviction. Topics include an overview of current sentencing laws, post conviction motions, pleas of guilty, distinction in seriousness of crimes, eligibility for probation, prior convictions, conditions of probation, specific crimes/specific conditions, state prison sentencing, violations of probation, determinate sentencing law, life terms, sexual assault sentencing, domestic violence and drug court sentencing, three strike sentencing, removal of criminal convictions from record.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "219",
                "title": "Chinese Trade and Investment Law",
                "description": "Survey of recent Chinese economic legislation with special emphasis on foreign trade and investment. Study of various legislative and practical considerations involved with doing business with China. Consideration of issues such as how specific legislation assists Chinese economic development and how these laws and regulations have an impact on foreign businesses.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "250",
                "title": "Business Planning",
                "description": "This is a practical class that merges the “lawyer as legal counsel” with the ” lawyer as business advisor.” Exploration of the basic legal issues involved in the life of a business enterprise (e.g. formation, financing and exit strategies), and application to real life situations.Prerequisites: 248 Business Organizations.270 FederalIncome Tax is extremely helpful, but not required.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "403",
                "title": "Children and the Law Seminar",
                "description": "Seminar this year will focus on child abuse and neglect;also considers a broad range of other issues involving the conflicts between the legal rights of children and the legal rights of their parents and the state. First considers potential parental violations of the legal rights of their children, such as prenatal maternal substance abuse, “battered child syndrome” and other physical abuse, domestic violence, failure to thrive and other psychological abuse and intra-familial sexual abuse.Also explores parental failure to provide their children with the basic necessities of life, such as food, housing, supervision and medical care. Consider the impact of poverty and homelessness on the ability of parents to meet their children's needs.The legal rights of children to an education, focusing in particular on the state's duty to provide special education for disabled minors. In addition,the impact that cultural differences can have on some of these issues. The seminar will then explore the conflicts between the legal rights of children and the state authority within the juvenile justice system to regulate the lives of dependent children and their families.The alternatives available to the juvenile court for long term placement of dependent children, such as foster families, as well as the appropriate standards for determining when parental rights should be terminated. Finally, the class will briefly consider the legal plight of children in other countries, including such topics as the proliferation of street children, the use of children as soldiers and the trafficking in children for sexual purposes.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "533",
                "title": "Broadband Regulatory Clinic",
                "description": "The Broadband Regulatory Clinic provides students with the hands on experience of providing research, writing and filing policy comments on behalf of clients seeking representation in hearings before the California Public Utilities Commission (CPUC) and/or the Federal Communications Commission (FCC). Over the duration of the one semester clinic, students will interface with community-based, education, traditional civil rights, municipal and/or small business organizations to address timely cutting edge broadband regulatory issues before state or federal legislative and/or regulatory bodies. Alternatively, in some semesters, students, as clinic fellows, will have the opportunity to file comments on a state or federal policy issue (ex. net neutrality) or participate as an amicus in an appeal from an agency decision as the collective clinic.  As part of the preparation for drafting and filing comments or briefs, teams of students will be required to research and write a substantive memo on a topic agreed upon by the students and the professor that is critical to the regulatory filing. Enrollment will be limited.  *Given the nature of research to be undertaken, students need not have taken Mass Communications I or Mass Communications II for purposes of placement in the clinic. Approved IP LL.M. course. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "359",
                "title": "Business Ethics",
                "description": "Survey class on ethical and legal theory and their application in business organizations, in a case-study type of instruction. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "248",
                "title": "Business Organizations",
                "description": "Brief study of agency, partnership and limited liability companies, focusing chiefly on the investor's potential personal liability and right to participate in enterprise control. Intensive investigation of the structure and characteristics of the modern business corporation, both the large, publicly held enterprise and the small, closed-ownership, group-type business. Promotion and organization of corporations, distribution of power between management and shareholders and the manner in which such power may be exercised, limitations on corporation powers imposed by the fiduciary principle and by federal regulation, and enforcement of corporate duties through shareholders' derivative suits and other actions. Bar course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "382",
                "title": "Biotechnology Law Seminar",
                "description": "This course will introduce you to the issues encountered when starting up a biotech company and afterwards. The course examines a variety of legal topics related to the biotechnology industry, such as the initial financing, the regulatory environment, intellectual property, licensing, antitrust and practical uses of biotechnology. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "702",
                "title": "Bar Exam Skills Workshop",
                "description": "This course is required for all JD students entering their final semester who have not earned 4 UP points. This course must be taken concurrently with 373b: Advanced Legal Writing: The Bar Exam.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "525",
                "title": "Assisted Reproduction, Cloning and Genetic Engineering",
                "description": "This course explores scientific, political, regulatory and constitutional issues associated with assisted reproduction, cloning and genetic engineering.  Technologies include:  artificial insemination, in vitro fertilization, and donor eggs and sperm; human cloning, both reproductive and stem cell research; and genetic engineering accomplished through preimplantation genetic diagnosis and gene transfer.   Topics include:  a critical analysis of the public policy debates surrounding these technologies; laws and regulations that attempt to limit or ban the use of these technologies; equal protection for human clones; procreative, scientific and therapeutic liberties under the Constitution; and genetic engineering as an aspect of a parent's right to rear his or her child. Approved IP LLM course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "562",
                "title": "Arbitration Law and Practice",
                "description": "This seminar will examine the law and practice of domestic commercial arbitration.  Topics for study likely will include the essential characteristics of arbitration, the interaction between federal and state arbitration law, the division of authority between arbitrators and courts, the judging of consent to arbitrate, a detailed examination of the arbitration process and arbitration practice, class arbitration, and judicial review of arbitration awards.  In any given year, discussion may focus on arbitration cases currently pending on the U.S. Supreme Court's docket.  Finally, the course also may touch briefly on issues arising in labor arbitration and international arbitration.  Students will be required to write a final course paper that may be used to satisfy the Supervised Analytical Writing Requirement.  Enrollment is limited to 15 students.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "225",
                "title": "Antitrust",
                "description": "Legislative limits on free market transactions. This survey course covers restraints of trade such as price-fixing, market division, exclusive dealing and tying, monopolization, and mergers. A rudimentary knowledge of economic theory is required to understand court decisions, but many students master the few necessary economic principles during the course despite a lack of prior work in economics. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "281",
                "title": "Wills and Trusts",
                "description": "Fundamentals of nontax estate planning. Intestate succession and the basics of wills including mental capacity and undue influence; execution formalities; holographic wills; revocation; lapse; ademption and satisfaction; and rights of spouses and children. Also surveys other methods of estate planning, with an emphasis on trusts. Topics include trust formation, modification, and termination; revocable living trusts; spendthrift, support, and discretionary trusts; charitable trusts; powers of appointment; and powers and duties of trustees. Bar course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "229",
                "title": "Venture Capital",
                "description": "The course will address topics such as fund formation, the venture capital ecosystem (including the differences between financial and strategic investors), issues faced by investors when making investments in start-up companies, as well as some of the regulatory challenges faced by venture capital funds. It will be taught from an investor's perspective and will include negotiation exercises, drafting exercises and in-class presentations.  Pre-requisite:  Business Organizations (248)  This class meets the Professional Skills Requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "289",
                "title": "Water Law",
                "description": "Legal principles, practices, and processes governing allocation of water among competing beneficial uses. Property systems in water, federal-state relations and powers, interstate disputes, water-right transfers, groundwater management, pollution control and the public trust doctrine.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "499",
                "title": "Understanding Capital Punishment Law",
                "description": "A study of Capital Punishment in the United States is largely a study of the Eighth Amendment to the Constitution. Topics covered will include: The Great Debate Over Capital Punishment; Methods of Execution; Early Constitutional Challenges; Constitutional Limitations on Death Eligibility; Death Qualification of a Capital Jury; The Role of Aggravating Circumstances; The Role of Mitigating Evidence; The Sentencing Decision; The Special Issues of Volunteers; Psychiatric Evidence; Ineffective Assistance of Counsel; Race, Gender and the Death Penalty; Federal Habeas Corpus Review; and International Aspects of Capital Punishment. (3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "550",
                "title": "U.S. Foreign Relations Law Seminar",
                "description": "A body of law that influences the conduct of U.S. foreign policy.  Includes treaties, customary international law, domestic constitutional law, and domestic statutes.  This seminar will explore selected topics in the field of U.S. foreign relations law.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "325",
                "title": "Trial Techniques",
                "description": "An intensive approach to learning trial skills. Each student is required to prepare and participate in a series of trial problems. Each student also conducts two complete trials. Lecture, demonstration, and critique by instructor and other experienced litigators. Prerequisites: 320 Evidence. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "566",
                "title": "Transnational Civil Litigation",
                "description": "Lawyers who practice law in the 21st century are likely to have clients engaged in international business. Lawyers should therefore expect that, at some point, disputes between a third party and their clients will occur.  This course prepares students for a business litigation practice by introducing them to various transnational dispute resolution options and associated obstacles that lawyers confront.  Transnational Civil Litigation focuses on both judicial and non-judicial methods of resolving cross-border disputes.  Since there is no one body of law covering transnational dispute resolution, multiple sources of law will be examined:  U.S. federal and state law, treaties, and any agreements made by the parties themselves.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "227",
                "title": "Trademarks & Unfair Competition",
                "description": "In-depth examination of the protection afforded trademarks and trade dress under the federal Lanham Act and various state laws. Specific topics include eligible subject matter, use in commerce, the benefits and limits of federal registration, infringement, secondary liability, trademark dilution, domain names, abandonment, fair use, and other defenses. Students enrolled in this course may not also take LAW 535 Trademarks. Approved IP LL.M. course. Prerequisite : IP Survey (388) ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "367",
                "title": "Transitional Justice",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "103",
                "title": "Torts",
                "description": "Issues involved in determining whether the law will require a person to compensate for harm intentionally or unintentionally caused in situations as diverse as automobile collisions,medical treatment, and consumption of defectivefood products. Also includes the social, economic, and use or political implications of various resolutions. (One semester course)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "478",
                "title": "Trade Secrets",
                "description": "This course, building on the Intellectual Property Survey, covers trade secret law in more detail, including the Uniform Trade Secret Act (UTSA) and California's trade secret laws.  The course also addresses how trade secret law can affect employee mobility.  Prerequisite: IP Survey (388). Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "344",
                "title": "The Prison System",
                "description": "Students will be graded on class participation and will be required to complete a final paper on a legal or policy issue relating to corrections. There will be no laptops allowed in class. Some students will be eligible for the Supervised Analytical Writing Requirement. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "675",
                "title": "The Business, Law, Technology, and Policy of Artificial Intelligence",
                "description": "Artificial intelligence is transforming the way that companies and organizations operate and do business. Self-learning algorithms, autonomous robots, and related technologies are increasingly carrying out tasks that once were exclusively performed by humans, creating new challenges and opportunities for the legal profession. This class will explore the business, technology, and law of artificial intelligence through assigned readings and individual and group problem sets, discussion, field trips, and engagement with local experts in AI, robotics, and neural engineering.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "280",
                "title": "Technology and Innovation in the Practice of Law",
                "description": "This class will introduce students to legal technology and issues around innovation in legal practices and services. Artificial intelligence, big data analytics and blockchain/virtual currencies are already starting to emerge and be integrated with legal products. Simultaneously, economic pressure from clients and the growing gap in access to justice has led firms and legal service organizations to embrace methods of increasing efficiency, whether it is using more technology, turning to project management systems to reorganize workflows and relying less on 'the billable hour' to measure client billing and attorney performance. Through a combination of class discussion, guest lectures and interviews, exercises and a final paper, this course will provide an opportunity to students to understand the role that legal technology and new practice models of the business of law in changing the practice of law, and teach them how to consider, evaluate and adapt to emerging changes in law practice with a thoughtful and critical mindset.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "228",
                "title": "Technology Licensing",
                "description": "The process of technology licensing. Includes topics such as motivations for licensing, types of agreements used in licensing transactions, provisions commonly used in licensing contracts, and special considerations of international licensing. Actual negotiation sessions with scenarios provided and exercises in drafting specific provisions used in technology licensing contracts. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "565",
                "title": "Taxation of Business Transactions",
                "description": "This course will examine tax issues that arise in actual transactions and the creative solutions that tax lawyers and accountants, in consultation with other advisors, clients, and other stakeholders, devise in order to deal with these issues.  The course is problem-oriented.  After a four-week introduction to the relevant tax law, students will be given a mix of hypothetical and actual cases from practice and be asked to identify tax issues and develop ways the tax issues may be addressed in the context of other pertinent non-tax law and the parties' business deal.  Students will write a series of short papers during the term.  There may be a short final exam.  The format will include a mix of lecture, discussion and presentations from faculty and outside speakers.  Attendance at the first meeting is mandatory.  Prerequisite:  Federal Income Tax (Law 270).  It is recommended but not required that students be taking or have taken business Organizations.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "431",
                "title": "Supreme Court Seminar",
                "description": "The operation of the United States Supreme Court, using cases slated for argument and decision on the Court's current docket as the primary focus of study. Four weeks of the course will involve reading and discussing scholarship about the Court Ce.g, the certiorari process, the selection of Justices, and how the Court decides cases. Ten weeks of the course will be devoted to the oral argument and decision of cases on the Court's current docket. At each such class meeting, some students will act as attorneys in the case and present oral arguments. The remaining students will act as justices, questioning the attorneys during argument and then meeting in conference to decide the case. For each case, at least two students will write opinions, which will subsequently be circulated, to the entire class for discussion. By the end of the semester, each student will argue at least one case and write two opinions. For these ten class meetings, every student will be required to read the actual briefs that have been filed with the Supreme Court, as well as some of the important precedent cases. Consequently, this course requires more reading than the average law school class. In addition, students' written opinions will be reviewed and discussed by their peers. Students uncomfortable with either of these aspects of the class should consider other courses. Grading will be based on in order of importanceCstudents' written opinions, their oral arguments, and their general class participation. Prerequisite: 200 Constitutional Law I.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "716",
                "title": "Tax Practice and Procedure",
                "description": "This course will provide an overview of federal civil tax procedure, including practice before the Internal Revenue Service and U.S. Tax Court, the administrative appeals process, and assessment and collection procedures.  We will explore the stages of a typical tax controversy from examination through litigation.  Topics will include rights and privileges of both taxpayers and the government.  A practical approach will be emphasized.  Prerequisite:  Federal Income Tax.  Graded course based on class participation, mid-term and final.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "992",
                "title": "Summer Abroad: Public International, International IP, International Humanitarian, International Human Rights Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "903",
                "title": "Summer Abroad: Public International, International Humanitarian, International Human Rights Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "862",
                "title": "Summer Abroad: Public International, International Humanitarian Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "929",
                "title": "Summer Abroad: Public International Law, International Intellectual Property Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "833",
                "title": "Summer Abroad: Public International Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "873",
                "title": "Summer Abroad: Public International Law, International Human Rights Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "848",
                "title": "Summer Abroad: Public International IP Human Rights",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "825",
                "title": "Summer Abroad: Law of Armed Conflict",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "870",
                "title": "Summer Abroad: Oxford: Transitional Justice",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "821",
                "title": "Summer Abroad: Jurisprudence",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "923",
                "title": "Summer Abroad: Law and Business in the European Union",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "878",
                "title": "Summer Abroad: Japanese Patent and Copyright Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "846",
                "title": "Summer Abroad: International IP Law,  International Humanitarian Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "803",
                "title": "Summer Abroad: International Refugee Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "830",
                "title": "Summer Abroad: International IP Law - Geneva",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "912",
                "title": "Summer Abroad: International IP & Human Rights Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "876",
                "title": "Summer Abroad: International Humanitarian Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "904",
                "title": "Summer Abroad: International Humanitarian, International Human Rights Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "889",
                "title": "Summer Abroad: International Human Rights Law - Geneva",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "804",
                "title": "Summer Abroad: International Criminal Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "898",
                "title": "Summer Abroad: International Criminal Justice - The Hague",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "896",
                "title": "Summer Abroad: Humanitarian IP & Human Rts",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "883",
                "title": "Summer Abroad: Human Rights: Forced Migration Law and International Environmental Law.",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "894",
                "title": "Summer Abroad: English Legal Institution Seminar",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "939",
                "title": "Summer Abroad: Human Rights in the Americas",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "899",
                "title": "Summer Abroad: Doing Business in China",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "944",
                "title": "Summer Abroad: Doing Business in Japan",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "823",
                "title": "Summer Abroad: Comparative Tort Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "813",
                "title": "Summer Abroad: Comparative Property",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "935",
                "title": "Summer Abroad: Comparative Intellectual Property Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "971",
                "title": "Summer Abroad: Comparative Environmental Law",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "906",
                "title": "Summer Abroad: Business and the Environment",
                "description": "For more information about study abroad programs please visit https://law.scu.edu/international/summer-abroad/.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "609",
                "title": "Statutory Analysis",
                "description": "Introduction to the various approaches used to interpret statutes. Students are asked to develop the “ideal approach” to statutory interpretation.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": null,
                "title": "Statutory Analysis and Legislative Process",
                "description": "Anintroduction to the various approaches courts use to interpret statutes, and an exploration of the fundamentals of the legislative process. Particular emphasis on California and public interest advocacy, with some federal coverage. Topics include: the tools of statutory analysis, the creation of legislation and its role in a common law system, lobbying, the California constitution, legislative resources, career paths in legislation and public policy, and current issues.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "269",
                "title": "State and Local Tax",
                "description": "This course provides an overview of the law of state and local taxation in the United States, focusing principally on the federal constitutional constraints on states' capacity to raise revenue. The types of taxes considered include corporate income and franchise taxes, personal income taxes, property taxes, and sales and use taxes. The principal sources of legal authority explored are the Commerce Clause, the Due Process Clause, and the Equal Protection Clause of the federal Constitution, as well as the Uniform Division of Income for Tax Purposes Act. Thematically, the course examines the political and economic justifications for these limits on state power, and the proper judicial and legislative roles in policing such boundaries.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "661",
                "title": "Sports Law Seminar: The Litigator's Perspective",
                "description": "This course approaches Sports Law from the perspective of the litigator. Sports have become a major industry in the U.S. and worldwide.  Therefore, virtually every legal discipline applies to sports and the several of the more commonly applied disciplines will be considered, such as intellectual property law, tort law, class action law, disability law, criminal law and Constitutional law.  Also, there are bodies of laws and rules unique to sports, such as those applying to athletic associations, amateurism and the Olympics, and these will also be considered.  No prerequisites. Students who have taken Sports Law Seminar: The Agent's Perspective in the fall MAY enroll in this course. This course will cover topics not covered in the fall Sports Law course. Limited enrollment. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "424",
                "title": "Sports Law Seminar: The Agent's Perspective",
                "description": "This course approaches Sports Law from the perspective of the athlete agent. The class covers, among other topics, antitrust, collective bargaining agreements, sports leagues, standard contract terms and the effective negotiation thereof (including without limitation athletes' employment contracts, tour participation contracts, USOC/IOC compliant contracts, special events, appearance contracts and product endorsement or “sponsorship” contracts), performance enhancing and illegal drug use and a practitioner-level view of representing professional athletes on a day-to-day basis (as agent and/or transactional attorney). No prerequisites. Students may also take Sports Law Seminar: The Litigator's Perspective in the spring, as there is virtually no duplication of subject matter. Limited enrollment. This class fulfills the LL.M. writing requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "423",
                "title": "Sports Law",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "408",
                "title": "Social Justice Workshop : Public Interest and Social Justice Practice",
                "description": "The Seminar will provide both an overview of the problems faced by the indigent and subordinated as well as offering an opportunity to enhance the lawyering skills you will need to assist clients in the future. The class will also discuss the public interest problems confronting low income, multi-ethnic communities, including the availability of legal services (or the lack thereof). Throughout the semester, we will look at a variety of approaches to dealing with these public interest law problems including litigation, legislative, administrative, media work, community organizing and coalition building. The Seminar will also offer some introductory training in lawyering skills including interviewing, counseling and theory development. As part of the Seminar, each student will complete a written project trying to develop creative strategies for dealing with some problem area involving public interest law. We encourage students to work in pairs on these projects. Potential project areas might include child abuse, civil rights, consumer law, domestic violence, education law, elderly law, employment law, homelessness, housing, human rights, immigration law, and juvenile rights. These projects can fulfill the Supervised Analytical Writing Requirement. There is no final examination for this course, rather the class will be graded based on your Seminar participation and your presentation and written project. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "267",
                "title": "Social Justice Workshop",
                "description": "Faculty members rotate teaching this unique seminar which gives students a chance to explore with faculty contemporary, cutting-edge issues in social justice law. Past seminars have addressed Wealth & Inequality and Post-911 Constitutional Issues. Each course begins with an introduction defining the terms of the contemporary debate. Throughout the semester nationally prominent speakers and faculty members present papers to the seminar for discussion. Lectures by featured speakers are open to the University community. Limited enrollment.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "267",
                "title": "Social Justice Workshop: Law and Labor in the Fields",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "315",
                "title": "Sexuality and the Law",
                "description": "An overview of legal issues relating to sexual orientation and gender identity, including: employment discrimination; family law issues, including marriage, domestic partnership, child custody and adoption; school-based issues, including anti-gay peer harassment, gay student clubs, and the rights of transsexual students; first amendment issues; and immigration and asylum. In addition to providing an overview of the gay and transgender civil rights movements, the course provides students with a foundation in several basic constitutional doctrines (privacy/substantive due process, equal protection, and the first amendment). The emphasis is on close readings of key cases, as well as on exploring a variety of doctrinal themes, such as the intersection of gender- and sexual orientation-based discrimination, the use of social science research in litigation, and the role of morality in law.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "258",
                "title": "Securities Regulation",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "256",
                "title": "Secured Transactions",
                "description": "Previously titled Commercial Finance.  The course examines uniform state law and some federal law governing consensual security interests in personal property and fixtures (Article 9 of the Uniform Commercial Code), a subject relevant to a wide range of law practice, including commercial and consumer finance, family law, and bankruptcy.  Specific topics include creation of security interests, rights and remedies of the creditor and debtor upon the debtor's default under the secured obligation, perfection of security interests, resolution of priority disputes among competing lien holders claiming an interest in property, and the rights of the secured party and debtor in the debtor's bankruptcy.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "375",
                "title": "Rights of Publicity",
                "description": "Analysis of statutory and case law recognizing a right of celebrities and others to control the use of their names and likenesses for commercial purposes. Topics include the scope of the right, identification, infringement, federal preemption and defenses, including First Amendment implications. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "366",
                "title": "Religious Freedom",
                "description": "This course considers the relationship between law and religion from a comparative and international perspective, with particular attention given to the topic of religious freedom. The first part of the course will introduce the students to the concepts of religious freedom from legal, philosophical, historical and theological perspectives. The course next addresses the treatment of religion in international law and in various regional and supranational settings such as the United Nations, the European Court of Human Rights and the Inter-American Court of Human Rights.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "346",
                "title": "Righting Wrongful Convictions:  Policy and Legislative Reform",
                "description": "Background on the impact of DNA technology on the justice system gives context to the legislative process and law reforms now being debated in the states and federal justice systems. Focusing on the leading causes of wrongful convictions (mistaken eyewitness identification, false confession and use of jailhouse informant testimony), students consider legislative and non-legislative reforms.  Students will hear from prosecutors and law enforcement to add balance and perspective to the often conflicting but legitimate concerns of diverse interest groups. No exam. Students have the option of writing a paper or doing an individual or group project. Grades will be based on class participation and final project.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "324",
                "title": "Remedies",
                "description": "An overview of the remedial system and its relationship to civil litigation. The first half of the course establishes the basic principles underlying damages, equity, and restitution. The second half compares and contrasts those remedies in specific contexts such as trespass, franchise agreements, copyright and trademark infringement, and civil rights cases. Bar Course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "284",
                "title": "Real Estate Finance",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "543",
                "title": "Real Estate Conveyancing",
                "description": "An overview of real estate conveyancing principles. The real estate purchase contract, escrows, recording acts, title insurance, delivery of deeds and covenants of title are among the topics to be covered in this course. the course will cover Common Law and California statutory modifications.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "317",
                "title": "Race and Law",
                "description": "This course has three themes: (1) understanding and critiquing American racism and the role law plays in perpetuating it; (2) understanding and critiquing popular and legal conceptions of “race” itself; and (3) understanding and critiquing the ways that people have struggled against racism and sought equal opportunity through law. These themes will be examined in the historical context in which concepts of race and racism arose, but half the class will be devoted to contemporary issues. Materials are designed to provoke both scholarly and pragmatic discussions of these themes.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "408A",
                "title": "Public Interest and Social Justice Workshop",
                "description": "Practicum in Restorative Justice",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "410",
                "title": "Privacy Law Seminar",
                "description": "Legal rights and remedies associated with privacy. An exploration of the constitutional, statutory, and common-law doctrines that give individuals control over personal information and decisions. Practical application of these privacy doctrines in judicial, legislative, and administrative contexts to protect and to vindicate individual privacy.Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "104",
                "title": "Property",
                "description": "Basic background in property law. This survey of the law governs ownership, possession, and use of land and other types of property. (One-semester course)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "302",
                "title": "Professional Responsibility (formerly Legal Profession)",
                "description": "This course introduces students to the ethical challenges and competing demandsand dutiesthat lawyers must grapple with in their professional and personal lives. It will coverthe most important rules that regulate the practice of law and the policies behind them. Students will learn how the rules apply to specific situations that lawyers commonly face in their practice. The coursewill also provide students an informed and critical overview of the structure and institutional regulation of the legal profession.This course overlaps with material tested on the California Bar Examination and the Multistate Professional Responsibility Examination.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "791",
                "title": "Pretrial Litigation Techniques",
                "description": "Skills related to pretrial civil litigation. The objectives of the course are to teach students basic skills needed in federal pretrial civil litigation practice, to develop knowledge of applicable pretrial rules, to develop skills in the discovery process, and to develop written and oral advocacy skills using modules relating to prefiling considerations, pleadings, motion practice, discovery,and the pretrial conference. The coursewill meet for lecture and skills basedexercises.During the skills session, students will learn by doing and receive feedback and critique from the instructor and/orpractitioners. The course will use one civil, high tech fact pattern over the course of the semester. Students will meet with clients; interview witnesses; draft and respond to discovery; take and defend depositions; and draft, oppose and argue motions. One fact pattern will be used throughout the course so that the emphasis remains on skills development rather than learning additional fact patterns or substantive areas of law. Limited enrollment 100 percent attendance required. Prerequisite: 114 Pleading and Civil Procedure. Pre- or Co-requisite 320. Evidence. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "553",
                "title": "Post Grant Patent Proceedings",
                "description": "This course simulates practice in administrative post grant proceedings before the U.S. Patent and Trademark Office, with special focus on petitions for inter partes review by the PTOs Patent Trial and Appeal Board. Students will receive skills",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "523",
                "title": "Panetta Fellows Externship",
                "description": "The Panetta Fellowship Program is a joint venture between Santa Clara University School of Law and the Leon & Sylvia Panetta Institute for Public Policy in Monterey, California. The Panetta Fellowship Program was developed to provide an educational opportunity for law students interested in the law and government, political science, or public policy to work with Leon and Sylvia Panetta, and other professional staff at The Panetta Insitute, on matters within the public mission and serivce of the Institute. Students will complete 140 hours of field work at The Panetta Institute focusing on the area of law and public policy under the guidance and supervision of School of Law alumnus Leon Panetta and the staff at the Institute, and attend regular meetings with the Director of Law Externship Programs or another member of the School of Law faculty throughout the semester of participation in the Program. Graded credit/no credit only.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "636",
                "title": "Patent Prosecution",
                "description": "This course covers practical aspects of drafting and prosecuting foreign and domestic patent applications, including the creation of a patent application, claim drafting and construction, international patent practice, and the strategic development of a patent portfolio.  Approved IP LLM Course.  Prerequisite: IP Survey (388) ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "505B",
                "title": "Northern California Innocence Project B",
                "description": "Training and Education: All NCIP students are required to attend an intensive two-day training session known as “NCIP Boot Camp” near the beginning of the fall semester. Students attend classes twice weekly which focus on post-conviction law and issues relevant to wrongful conviction. Class topics include federal and state habeas corpus procedures, post-conviction DNA testing, investigation techniques, witness interview strategies, the science of DNA testing, and the causes and possible remedies for wrongful convictions. Students engage in more specialized writing projects such as motions for post-conviction DNA testing and petitions for writs of habeas corpus. Students also may have an opportunity to tour a local crime lab or coroner's office and conduct legal interviews with prison inmates.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "233",
                "title": "Patents",
                "description": "Foundational course in US patent law and policy. Covers the statutes, legal doctrines, and important decisions in patent law jurisprudence from the Supreme Court, Federal Circuit, and lower courts. In-depth coverage of the major aspects of patent validity and patent enforcement. Prerequisite: IP Survey (388) ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "515B",
                "title": "Northern California Innocence Project Advanced Practice Clinic B",
                "description": "If you have taken 6 letter-graded units of Northern California Innocence Project A, you should enroll in Northern California Innocence Project Advanced Practice Clinic B (515B) which is graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "568",
                "title": "Online Dispute Resolution: The State of the Art",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "515A",
                "title": "Northern California Innocence Project Advanced Practice Clinic A",
                "description": "If you have taken 6 letter-graded units of Northern California Innocence Project A, you should enroll in Northern California Innocence Project Advanced Practice Clinic B (515B) which is graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "251",
                "title": "Mergers and Acquisitions",
                "description": "This course will focus on the law affecting corporate mergers and acquisitions, with some time being devoted to spin-offs and split-ups. The course coverage will be principally:  the history and theory of business combinations; an overview of deal structures, and the approval requirements involved in such structures; the process of due diligence and the role of the letter of intent and the acquisition agreement in such process; the target company's board of director duties in reacting to takeover overtures; state takeover laws; shareholder conflicts, protection of minority shareholders, and dissenters/appraisal rights; application of the federal and state securities laws to business combinations and spin-offs; the Williams Act and public company proxy rules for acquisitions.  The course will also include an exposure to merger agreements and an analysis of applicable provisions illustrating the problems facing the courts in deciding merger cases.  Policy issues will be discussed to provide a foundation for understanding the applicable business combination statutes and cases. Prerequisites: 248 Business Organizations or 258 Securities Regulation.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "515",
                "title": "Northern California Innocence Project Advanced Practice Clinic",
                "description": "If you have taken 6 letter-graded units of Northern California Innocence Project A, you should enroll in Northern California Innocence Project Advanced Practice Clinic B (515B) which is graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "505A",
                "title": "Northern California Innocence Project A",
                "description": "Training and Education: All NCIP students are required to attend an intensive two-day training session known as “NCIP Boot Camp” near the beginning of the fall semester. Students attend classes twice weekly which focus on post-conviction law and issues relevant to wrongful conviction. Class topics include federal and state habeas corpus procedures, post-conviction DNA testing, investigation techniques, witness interview strategies, the science of DNA testing, and the causes and possible remedies for wrongful convictions. Students engage in more specialized writing projects such as motions for post-conviction DNA testing and petitions for writs of habeas corpus. Students also may have an opportunity to tour a local crime lab or coroner's office and conduct legal interviews with prison inmates.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "327",
                "title": "Negotiating",
                "description": "This course offers students the opportunity to explore the practice of negotiation. One goal of the course is to make you a more knowledgeable observer of the negotiation process, enabling you to understand what the various negotiators are doing and why. Another goal is to help you to acquire and improve your own negotiation skills so that you can effectively achieve your objectives. Both goals tie into the overarching goal, for those who will practice law and represent others, of making you a better lawyer who can effectively represent, protect and satisfy your clients' interests in any negotiation process. Ethical considerations will be addressed throughout the course. Moreover, all of us are required to negotiate not only in our roles as lawyers representing clients but also in other aspects of our lives. A positive bonus effect of this course is generally to help students to be more effective in a variety of personal and business negotiation contexts.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "429",
                "title": "Mass Communication I: Television, Cable, Satellite Video and Convergence",
                "description": "Introduces students to the federal regulatory law governing the ownership and operation of broadcast radio and television, cable television, and satellite video technologies. Emphasis is placed on students learning to engage in a comparative analysis of the regulatory schemes for various communications technologies. Students will examine regulations in light of constitutional issues, promoting competition and the goals of the Communications Act and the First Amendment of promoting diversity of voices and viewpoints. The course will also examine some contrasting regulatory approaches in different countries to the regulation of technology and content. There are no prerequisites for this course. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "602",
                "title": "Mediation: Theory and Practice",
                "description": "This course combines both theory and practice skills. A variety of readings, exercises, videos, and role-plays will be used to encourage in-depth analysis of mediation concepts and the application of these concepts in practice. Topics to be covered include negotiation theory, the mediation process, the role of the mediator, ethical issues in mediation, dealing with power imbalances, and the lawyer's role in the mediation process. Students will participate in exercises at various stages of the mediation process. Starting Summer 2009, this course will be a graded course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "520",
                "title": "Mass Communication II: Telephone, Broadband Networks and Convergence",
                "description": "The incorporation of internet protocol technology into traditional communications technologies is causing the competitive convergence of voice, video and data markets. “Intermodal” competition has begun between telephone and cable television firms (DSL vs. Cable Modem) and is expanding to include fixed wireless, satellite and broadband over electric power lines. This convergence of technology and markets calls into question the continued relevance and utility of separate regulatory paradigms for telecommunications (voice), cable television (video) and computers (information services). Convergence of network functionality and markets is reshaping historic federal and state regulatory and legal distinctions regarding jurisdiction, ownership, access, speech and public policy. This course introduces students to the evolving federal and state regulation of broadband networks. Emphasis is placed on students learning to recognize, understand and anticipate the changing relationships between technology, competition, regulation and law. There are no prerequisites for this course. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "671",
                "title": "Marshall-Brennan Leadership Development and Constitutional Literacy Seminar",
                "description": "The Seminar is a two-credit course comprised of a weekly seminar and field work in a local high school. The seminar will meet weekly to discuss constitutional law cases of particular relevance to high school students, and cover a diverse range of instructional pedagogies for teaching constitutional law and appellate advocacy skills to high school students. Students are placed in teaching groups to teach a 9-11 week Constitutional Law class in an area high school. Method of Evaluation: Seminar participation, classroom teaching observations, high school class materials/lesson plans, short reflection papers, and a final paper. Visit http://law.scu.edu/socialjustice/marshall-brennan.cfm for more information.    ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "724B",
                "title": "Low Income Tax Clinic B",
                "description": "This course is the credit/no credit portion of the Low Income Taxpayer Clinic. Students must be registered for Low Income Taxpayer Clinic A for the first 3 units of clinical credit to be eligible to add this class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "724",
                "title": "Low Income Taxpayer Clinic",
                "description": "This controversy clinic will provide Graduate students the opportunity to represent clients before the Internal Revenue Service and/or Tax Court, develop professional skills, and learn tax procedure, while directly serving the community. All students must attend an all-day skills training and regular class sessions, which will include one-on-one meetings with the supervising attorney. Students must also participate in evening intake clinics over the semester to fulfill the course requirements, and work on their cases. Students will earn Law Clinic units working at the Low Income Taxpayer Clinic (1 unit for each 50 hours of work). The first 3 units of the clinic - 724A - are graded, the 4th unit - 724B - is credit/no credit only. Professional skills course. Pre-requisite: Federal Income Tax (270) ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "724A",
                "title": "Low Income Tax Clinic A",
                "description": "This controversy clinic will provide Graduate students the opportunity to represent clients before the Internal Revenue Service and/or Tax Court, develop professional skills, and learn tax procedure, while directly serving the community. All students must attend an all-day skills training and regular class sessions, which will include one-on-one meetings with the supervising attorney. Students must also participate in evening intake clinics over the semester to fulfill the course requirements, and work on their cases. Students will earn Law Clinic units working at the Low Income Taxpayer Clinic (1 unit for each 50 hours of work). The first 3 units of the clinic - 724A - are graded, the 4th unit - 724B - is credit/no credit only. Professional skills course. Pre-requisite: Federal Income Tax (270)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "714",
                "title": "Legislation II:  Public Lawmaking in California",
                "description": "This course will explore California's unique and powerful public lawmaking tools arising from the state constitution, and their impact on both judicial and statutory law, and public interest advocacy.  Topics include:  the legal basis for the initiative process, legal challenges shaping its application and its future, the state budget's legal impact, the two-thirds supermajority requirement, Proposition 13's influence on the practice of law, and a look at the latest developments in this area, including the possibility of a constitutional convention, and what that would mean for lawyers.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "544",
                "title": "Legislation",
                "description": "This course explores the fundamentals of the legislative process, including its legal framework and role in a common law system. Topics include: the creation of legislation by both lawmakers and public initiatives; public interest advocacy and lobbying; judicial review and interpretation; legislative resources and research; career paths in legislation and public policymaking; and current issues in legislation. The course will focus primarily on California, including the significant role of the state's constitution, with some federal coverage. No prerequisites.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "376",
                "title": "Legal Research, Analysis, and Writing for International LL.M. and Exchange Students (formerly Legal Research, Analysis, and Writing for US Law LL.M.s)",
                "description": "This course will introduce international LL.M. and exchange students to legal analysis, writing, and research in the U.S. legal system. In it, students take the role of U.S. lawyers or judges analyzing hypothetical cases and conveying that analysis in writing and orally, culminating in an oral presentation before an appellate court. The course will introduce students to the U.S. legal system, IRAC analysis, U.S. legal research, and legal citation. It will also include practice in reading and briefing court decisions in the common law system and synthesizing the rules from various sources for application to a new set of facts. Students will receive extensive written comments on their work and will be able to meet regularly with the professor. We will also make site visits to U.S. courts and legal institutions and have the opportunity to speak with judges and lawyers there.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "352",
                "title": "Legal Systems in El Salvador",
                "description": "Seminar required for law students participating in immersion trip to El Salvador. Topics for discussion include the role of law in democratic transitions, interface between law and development, structure of the legal system, justice issues, etc.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "353",
                "title": "Legal Systems Very Different From Ours",
                "description": "A survey of very different legal systems focussing on their varying solutions to common problems. Legal systems covered will include Athenian law, Imperial Chinese Law, Modern Gypsy Law, Saga Period Icelandic Law, 18th Century English Criminal Law, and others. Issues explored will include enforcement intentives, gap filling, litigants gaming the system, and a variety of others.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "101B",
                "title": "Legal Research and Writing 2",
                "description": "Full-time legal writing faculty introduce students to legal analysis, research, writing, and citation. During the first course, students learn to brief cases, analyze and synthesize legal authorities, apply the authorities to a new set of facts, and write multiple, predictive office memoranda. In the second course, students begin learning both text and online research skills, and develop their analytical and editing skills in the context of trial court briefs. During both courses, legal writing faculty provide detailed written comments on students' work.(This is the second of two Legal Research and Writing courses) Prerequisite is Legal Research and Writing 1 (LAW 101A)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "101A",
                "title": "Legal Research and Writing 1",
                "description": "Full-time legal writing faculty introduce students to legal analysis, research, writing, and citation. During the first course, students learn to brief cases, analyze and synthesize legal authorities, apply the authorities to a new set of facts, and write multiple, predictive office memoranda. In the second course, students begin learning both text and online research skills, and develop their analytical and editing skills in the context of trial court briefs. During both courses, legal writing faculty provide detailed written comments on students' work.(This is the first of two Legal Research and Writing courses)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "101",
                "title": "Legal Research and Writing",
                "description": "In this year-long course, full-time legal writing faculty introduce students to legal analysis, research, writing, and citation. During the first semester, students learn to brief cases, analyze and synthesize legal authorities, apply the authorities to a new set of facts, and write multiple, predictive office memoranda. In the second semester, students begin learning both text and online research skills, and develop their analytical and editing skills in the context of trial court briefs. During both semesters, legal writing faculty provide detailed written comments on students' work.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "649",
                "title": "Legal and Business Aspects of the Entertainment Industry",
                "description": "This course provides a high-level overview of the legal and business dynamics of the movie, television, music and video game industries, with a particular emphasis on how IP owners in those industries can monetize new media opportunities. IP LLM course. Prerequisite: IP Survey (388).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "361",
                "title": "Legal Drafting",
                "description": "How does one discover a client's objectives and then translate them into legal text (statutes, contracts, bylaws, etc.) that has the best chance of accomplishing what the client wants?  This skills course considers many different forms of legal drafting, focusing primarily on legal work intended for planning and governing purposes such as contracts, wills, trusts, bylaws, and statutes.  The skills to be developed will be generic to and useful for all forms of drafting, though we will not consider drafting in the litigation context.  Class sessions will center on written work that students have prepared in advance and also on in-class exercises.  This will require preparation of written work at home and we will review, evaluate, and edit that work during class.  Attendance, participation, and written work will be required for each class.  Evaluation will be through drafting projects and classroom preparation and participation. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "387",
                "title": "Legal Issues of Start-up Businesses",
                "description": "This course satisfies the Professional Skills Requirement. The course simulates how attorneys advise startup businesses and the various legal issues that a business may encounter during its early stages. Issues covered include entity selection, employment and labor, intellectual property, and financing, including venture financing. Discussions also include relevant regulatory schemes such as securities regulation and the process of IPO. The class is interactive and requires effective oral and written counsel so that the client can make meaningful business decisions. Attendance is mandatory as there are numerous fun and challenging student group exercises including negotiations, client interview and advising.Guest presentations by various experts involved with start-up and growing businesses will be scheduled. Limited enrollment. No finals. Instead a final drafting assignment is required. Grades include class participation. Approved IP LLM course",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "387",
                "title": "Legal Issues of Start-up Businesses",
                "description": "This course satisfies the Professional Skills Requirement. The course simulates how attorneys advise startup businesses and the various legal issues that a business may encounter during its early stages.  Issues covered include entity selection, employment and labor, intellectual property, and financing, including venture financing. Discussions also include relevant regulatory schemes such as securities regulation and the process of IPO. The class is interactive and requires effective oral and written counsel so that the client can make meaningful business decisions.  Attendance is mandatory as there are numerous fun and challenging student group exercises including negotiations, client interview and advising.Guest presentations by various experts involved with start-up and growing businesses will be scheduled.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "204",
                "title": "Legal Aspects of War: Humanitarian Law",
                "description": "Examines the legalities of the decision to go to war under international and U.S. law, the International Law of War, and human rights law. Coverage includes the War Powers Resolution and litigation regarding U.S. use of force in Vietnam, Central America, and the Persian Gulf; Nuremberg and other post-World War II legal prosecutions and postwar Geneva Conventions and Protocols; the legal responses to such issues as the capture of Adolf Eichmann and the My Lai massacre, the bombing of North Vietnam (1964- 72) and Iraq (1991), and the genocide in Rwanda and Bosnia; and the foundational texts of human rights law, particularly those relating to war and its consequences.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "720",
                "title": "Leadership Skills for Law Student Leaders",
                "description": "This course will introduce and explore theories and competencies of leadership as a skill critical for current student organization leaders and future practicing lawyers. Through required readings, written assignments, and in-class exercises including several team negotiations or mediations, we will focus on personal development, communication, and problem-solving skills. Assignments will draw from case studies and students' experiences. Enrollment preference given to active leaders of Santa Clara Law student organizations. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "521",
                "title": "Leadership for Lawyers",
                "description": "Students will be graded on their engagement in the subject matter, including projects and papers assigned during the semester. Students may, with permission of instructor, elect to take the course Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "373a",
                "title": "Legal  Analysis",
                "description": "This course is designed to build a mastery of essay exam-writing relevant to both law school and the California Bar Exam. In a small section environment, the course will focus on improving the learning and application of the law as well as writing under timed conditions. The professor will directly supervise regular writing assignments and provide regular written feedback.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "567B",
                "title": "Law Student Co-Op Education B",
                "description": "The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience. It consists of a series of lectures on topics that will familiarize them with the Silicon Valley working environment, and will enable them to relate their experience in the industry to their academic program. Attendance is mandatory. Students must have paid employment in a law related job to be eligible for this class. Students must secure a permission number from Law Student Services to register for this class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "567A",
                "title": "Law Student Co-Op Education",
                "description": "The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience. It consists of a series of lectures on topics that will familiarize them with the Silicon Valley working environment, and will enable them to relate their experience in the industry to their academic program. Attendance is mandatory. Students must have paid employment in a law related job to be eligible for this class. Students must secure a permission number from Law Student Services to register for this class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "567C",
                "title": "Law Student Co-Op Education C",
                "description": "The primary purpose of Co-op education is to give students an opportunity to gain practical knowledge in their field of study. This course is designed to prepare them for such an experience. It consists of a series of lectures on topics that will familiarize them with the professional working environment, and will enable them to relate their experience in the industry to their academic program. Attendance is mandatory. Only those international students seeking to satisfy work requirements in the United States are eligible for this course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "798",
                "title": "Law Review",
                "description": "The Santa Clara Law Review is a legal periodical edited and publishedby Santa Clara University law students. Law Review membership is open to upper-divisonstudents who maintain a 3.00 GPAand successfully complete a candidacy program. Each board of student editors serves a one-year term and publishes four issues of the Law Review. Law Review membership is a rewarding educational experience that helps students refine their legal research, writing, and analytical skills, and affords a unique opportunity to work with legal professionals and faculty members. The primary objective of the Santa Clara Law Review is to provide a practical research tool for practicing California attorneys, members of the judiciary, scholars, and law students.The Law Review informs its subscribers of emerging legal trends and developments and presents new approaches to the analysis of current legal problems. Each issue contains articles contributed by legal professionals, law professors, and student editors. By providing a quality resource to the legal community, the Santa Clara Law Review brings prestige to both the School of Law and its graduates. The Law Review publishes a candidate handbook that provides details of the candidacy program. Interested students should attend the information sessions held each semester to receive a copy of the handbook and to learn more about the candidacy process.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "560",
                "title": "Law Practice Management",
                "description": "The course will introduce students to the business aspects of the legal profession including the marketplace for legal services in today's economy.  The topics addressed will include:  forms of law practice (including non-traditional alternatives), strategic planning, client development (marketing, client intake, conflicts), law office management, financial accounting, and risk management.  Each student will create and present a business development and practice management plan.   The goal of the course is to give each student a running start with a business development plan and specific strategies for developing their practice, regardless of the type of  the substantive area or environment in which they choose to practice.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "542",
                "title": "Law of Nonprofit Organizations",
                "description": "This course covers the legal requirements and policy implications for nonprofit organizations. Course topics include the formation and operation of charitable organizations, issues of organization governance, articulation and enforcement of fiduciary duties, remedies for breach of fiduciary duties, federal taxation requirements, principles of charitable gifts and restrictions on gifts, dissolution and extraordinary transactions, and relationships between the organization and the State (including private enforcement and derivative proceedings). The course also considers non-charitable nonprofit organizations.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "486",
                "title": "Law and Technology of Silicon Valley",
                "description": "For a startup company, there is a strong interplay between law and technology. Legal issues can determine the course research and development takes, while at the same time, the nature of the technology in question can determine to what extent certain legal aspects apply. This course seeks to explore this interplay by studying three Bay Area companies operating in three different technical areas. The students become familiar with basic technology concepts and ways new technologies are developed, commercialized and distributed, and the legal decisions along the way.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "268",
                "title": "Law and Social Justice Seminar",
                "description": "\tInstead of a final exam or research paper, students will work in teams to produce written “case studies” of a Bay Area social justice lawyering topic of their choosing.  At the end of the semester, we will hold a day-long mini-conference for students to present their work to faculty, students, and interested members of the Santa Clara and Bay Area social justice community.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "206",
                "title": "Law and Education",
                "description": "The role of lawyers and the judiciary in resolving matters relating to education. Control of student conduct and status; desegregation; school financing; rights and responsibilities of teachers; classification and evaluation of students; compulsory schooling; and the role of government in private education. Attention given to enhancing students' writing skills, including the writing of a term paper and through exposure to current litigation, pleadings, briefs, and in-depth statutory interpretation developing the practical skills and awareness needed by any attorney working with contemporary legal issues.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "286",
                "title": "Land Use",
                "description": "An exploration of the legal regulation of land use and development. Considers local land use planning and controls, including comprehensive planning, zoning, subdivision controls, and planned communities. In-depth discussion of major issues in land use law, such as takings, transfers of development rights, growth management, and the environmental regulation of land use.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "463",
                "title": "KGACLC Workers' Rights Interviewing and Advising",
                "description": "Students will provide advice to clients regarding problems in the workplaces such as wrongful termination, harassment, discrimination, unpaid wages, and failure to pay overtime.  In addition to advising clients, students will also receive 13.5 hours of instruction in the Fundamentals of Employment Law class that covers wage and hour law, wrongful termination, harassment, discrimination, leave acts, workers compensation, unemployment insurance, state disability insurance, ERISA, privacy, workplace immigration issues, and union/labor law.  .",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "715",
                "title": "Labor Law:  The Public Sector",
                "description": "This sequel to Labor Law will follow the historical growth and development of public sector labor relations, which is the fastest growing, and largest unionized segment of the American workforce. The course will focus on how city, state and federal employment statutes impact public employees and the constitutional protections that government workers enjoy under the U.S. and state constitutions. The course will also analyze several public employment relation laws, which grant collective bargaining rights to government workers in many states.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "235",
                "title": "Labor Law",
                "description": "Problems of labor-management relations: union organization, recognition, collective bargaining, strikes, picketing. Special emphasis on the National Labor Relations Act.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "469",
                "title": "KGACLC Immigration Interviewing and Advising",
                "description": "Students counsel clients in the general advice immigration clinic on all aspects of immigration law including political asylum and deportation. In the VAWA (Violence Against Woment Act) advice clinics, students advise immigrant victims of domestic violence.Students interested in interviewing clients with political asylum, VAWA (battered immigrant spouses and children), U Visa (victims of particularly serious crimes), and T Visa (victims of human trafficking) claims MUST also register for the 1-unit credit/no credit course on trauma and working with traumatized clients (Health Law 418B). This one-unit course will be offered at the Law Center. Students who are unable to register for this one-unit course will be able to interview clints with non-trauma immigration cases such as relative petitions, citizenship, and other types of deportation defense cases. Students may not take more than one interviewing and advising class without the prior approval of the instructors. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "468",
                "title": "KGACLC Courthouse Clinic",
                "description": "Students must attend a mandatory training class on the first",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "511",
                "title": "KGACLC Litigation Skills 1",
                "description": "Provides opportunities for Graduate students to master lawyering skills while directly serving the community. There are various areas of clinical specialization: consumer law,employment rights, and immigration law. All students must attend an all-dayskills training program on the first Saturday of the semester and regular 75-minute seminar meetings twice a week. Students can earn from 3 to 6 Law Clinic units for working at the KGACLC (1 unit for each 50 hours of work). The firstthree units of this class are graded, there after students earn credit/no credit grades only.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "481",
                "title": "KGACLC Civil Clinical Skills II",
                "description": "Students who have completed one semester at the Community Law Center for a minimum of 3 units are eligible to enroll for an additional semester at the KGACLC with the instructors' approval. Graded Credit/No Credit. Public Interest and Social Justice LawCertificate course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "532",
                "title": "Juvenile Justice Topics:  Practical Applications",
                "description": "Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "531",
                "title": "Juvenile Justice Topics:  Leadership Training",
                "description": "For students who have not volunteered with FLY and would like to receive credit for volunteering for the first time, you may enroll in Juvenile Justice Topics: Practical Applications. For more information, visit",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "402",
                "title": "Juvenile Court Law Seminar",
                "description": "A detailed examination of the operation of the juvenile justice system. The role and function of the police and of child protection agencies, public and private; the intake process and informal adjustment; the establishment of jurisdiction and the proof of jurisdictional facts; and dispositional and treatment services. Special attention to the assumptions underlying juvenile court intervention in cases of child neglect and abuse, incorrigibility, and delinquency. Critical appraisal of the major issues in the handling of juvenile misconduct and of the lawyer's function in the juvenile court process. Extensive student presentations required. Field visits to various juvenile facilities and juvenile court sessions. Materials and written work requirement to be announced. Limited enrollment. Public Interest and Social Justice Certificate course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "449",
                "title": "Jury Law & Strategies",
                "description": "This seminar addresses legal issues relating to the venire, voir dire, selection, excusal, competency, and behavioral constraints concerning citizens serving as trial jurors. Both state and federal statutes and case law will be included. Juror misconduct, mistrials relating to jurors, sequestration, juror notes, instructions, deadlock, and leadership/structuring of deliberations will be covered. Recent studies from social psychology, group dynamics, and communication, as well as videotapes of real deliberations will be analyzed, along with srategic uses of trial consultants. The ABA's revised standards for jury trials (2005) and jury innovation projects nationwide will be examined. Students will learn to recognize, research, persuasively argue, and suggest appropriate remedies for trial issues involving juries. Students will draft motions and briefs (pretrial, during trial, post trial) and jury questionnaires that address legal issues for specific trial scenarios. Students must attend the first class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "670",
                "title": "Judicial Externship II",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "594A",
                "title": "Judicial Externship Seminar",
                "description": "Interested students should obtain information about judges and courts that use externs and about the application process from the director of externships well in advance of the anticipated placement. The director of externships will help students locate and secure suitable placement. Graded Credit/No Credit. Part-time Judicial Externship: Students may earn from 4-6 units of credit for a part-time judicial externship or 12 units for a full-time judicial externship by (1) undertaking field work with a judge or court, and (2) participating in the Judicial Externship Seminar that will generally be offered in both the fall, spring and summer semesters of an academic year.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "594B",
                "title": "Judicial Externship I: Part Time",
                "description": "Interested students may obtain information about judges and courts that use externs and about the application process from ExPro well in advance of your ideal start. Graded Credit/No Credit. Part-time Judicial Externship: Students may earn from 3-6 units of credit for a part-time judicial externship by (1) undertaking an externship with a judge or court, and (2) participating in, and successfully completing the Externship Workshop (706).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "790",
                "title": "Journal of International Law",
                "description": "The Santa Clara Journal of International Law is dedicated to exploring current issues in public and private international law. The Journal is a collaborative student and faculty undertaking. Each volume focuses on a timely theme in international law. A Faculty Advisory Board solicits, reviews, approves relevantarticles in collaboration with the Journal's executive board. Student editors carry out article and technical editing of submitted articles and maintain the Journal's web presence. These peer-reviewed, thematic issues will be the first of their kind published by an American law school. Although it began as a purelyInternet-based journal, the Journal will be published in hard copy form going forward.Journal candidates must have a cumulative grade point average (GPA) of 2.67 at the time of candidate application review for board membership. Candidates must write and pass a case note and complete 50 hours of production work. They must also write a comment on an approved international legal topic. Student executive Board members must have a minimum 3.0 GPA.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "594C",
                "title": "Judicial Externship Full Time",
                "description": "Seminar requirements include assigned readings, participation in seminar meetings, and the preparation of a paper on an assigned topic. A minimum of 75 hours per unit of fieldwork is required for part-time judicial externships. This work may be undertaken in the fall, spring, or summer of an academic year. The student must enroll in the seminar being offered in the same semester.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "341",
                "title": "Islamic Law",
                "description": "This course explores classical and contemporary understandings of Islamic law, with an emphasis on Islamic legal methodology. Part of the challenge in studying Islamic law is its heterogeneity: there are several “schools” of Islamic law and there is no central religious adjudicative body. So our initial inquiry we will be to examine what, exactly, Islamic law is. The course will begin with an analysis of the major schools of Islamic law and will then move to classical and contemporary understandings of how differences are resolved in Islamic law. Among the specific areas we will cover are: criminal law, apostasy, gender, Islamic finance, and Islamic constitutionalism. Students will be graded on class participation and on a series of short analytical essays. There will be no laptops allowed in class, and attendance is mandatory.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "708",
                "title": "IP Theory",
                "description": "This seminar will explore the theoretical justifications for, and boundaries of, intellectual property doctrines. This course is appropriate both for the beginning IP student as well as the student who has taken numerous IP courses. The IP Survey course is not required, and students taking that course may find this a useful complement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "383",
                "title": "IP Litigation",
                "description": "This course simulates an intellectual property lawsuit from preliminary considerations (such as whether suing is the proper course of action for a potential plaintiff and how attorneys can assist their defendant clients in the assessing of the risks of litigation when sued) to pleadings, pretrial activities, discovery, evidentiary challenges, trial preparation and appellate procedures.  Approved IP LLM Course.  Prerequisite:  IP Survey",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "725",
                "title": "IP Remedies",
                "description": "This 1-unit course provides students with an understanding of remedies available for Intellectual Property infringement. This course is applicable to both in-house and law firm settings. Students gain an understanding of potential outcomes stemming from the enforcement of patents, trademarks, copyrights, and trade secrets. Basic remedies will be examined for each area of intellectual property. The role of expert witnesses in evaluating damages will be examined, including limits on expert witnesses and Daubert motions. The role of judges in setting and/or overturning jury awards will be examined. Students will engage in hypothetical evaluations of mock cases, including both pre-litigation and pending litigation settlement negotiations where potential remedies play a key role. The course will include reading targeted case law and statutes, out of class preparation for in-class exercises, and a written final exam.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "700",
                "title": "Introduction to US Law",
                "description": "This 3-unit course is designed to introduce U.S. Law LL.M students to the U.S. Legal System. This course will focus on providing an overview of the U.S. legal process and institutions, as well as, providing a foundation in certain areas of American substantive law.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "700",
                "title": "Introduction to US Law",
                "description": "This 3-unit course is designed to introduce U.S. Law LL.M students to the U.S. Legal System. This course will focus on providing an overview of the U.S. legal process and institutions, as well as, providing a foundation in certain areas of American substantive law.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "458",
                "title": "Interviewing and Counseling",
                "description": "The development of an understanding of the purpose and process of communication between lawyer and client. Through an understanding of purpose and process, the development of a core of listening, questioning, and counseling skills that are both appropriate to the varied factual contexts of lawyer/client communication and consistent with an evolving sense of professional identity. Methodology includes participation of all students in simulated interviewing and counseling; study, analysis, and discussion of transcripts of interviewing and counseling; reflection and comment on selected readings.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "793",
                "title": "Internet Law",
                "description": "This course surveys the law of the Internet, such as how privacy, contracts, intellectual property, anti-pornography, civil procedure and other legal doctrines apply to Internet businesses and technologies.  A technical background is not required. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "276",
                "title": "International Tax",
                "description": "he application of general rules of federal income taxation to foreign persons and to foreign income of U.S. citizens and residents, including the special provisions applicable only to foreign persons and/or foreign income. The jurisdictional bases for U.S. tax, the source of income, tax situs of property, allowance of expenses and deductions, exemption for income earned abroad, foreign tax credits, reporting and return requirements, and the impact of U.S. tax treaties. The treatment of foreign corporations and businesses, including foreign personal holding companies and the controlled foreign corporation concept. Does not cover the tax laws of any other country or compare U.S. and foreign tax structures or approaches. Prerequisite: Federal Income Taxation (270). Business Organizations (248) would be helpful but is not required. International, International High Tech and High Tech Law Certificate course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "218",
                "title": "International Organizations Seminar",
                "description": "Introduction to the legal structure, powers, and functions of United Nations organizations, and specialized agencies and regional organizations, such as the Council of Europe, the European Economic Community, and similar economic organizations.(3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "215",
                "title": "International Law",
                "description": "Globalization is a fact of life in the modern world. One result of globalization is that every lawyer who practices law in the twenty-first century must be prepared to handle transnational legal problems. This course is designed to provide students the primary analytical tools they will need to address modern, transnational legal problems. The course provides a basic introduction to both public and private international law.(3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "439",
                "title": "International IP Law",
                "description": "This course provides a basic foundation for thinking about intellectual propertyproblems that arise in an international context, with a focus onpatent, copyright, trademark, unfair competition, and enforcement issues. The aim of the course is to familiarize students with the key principles, agreements, and institutions that govern international intellectual property, as well as the political economy of globalization and intellectual property. Case and hypothetical examples will be used to explore the acquisition, licensing, and assertion of intellectual property rights across national borders, as well as country-level international property disputes. Enrollment limited to students who have taken at least one course on intellectual property or who have the instructor's permission. Approved IP LLM course. Prerequisite : IP Survey (388)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "727B",
                "title": "International Human Rights Clinic B",
                "description": "The international human rights clinic (IHRC) provides a unique educational opportunity for students to gain first-hand, practical experience working on international human rights litigation and advocacy projects. The clinic combines classroom education with supervised case and project management, providing students practical training in advocacy and lawyering skills. For every 50 hours of participation in the program, including casework and class attendance, a student earns one unit. The first 3 units of academic credit earned at IHRC are graded. Any earned units above 3 are graded credit/no credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "727A",
                "title": "International Human Rights Clinic A",
                "description": "The international human rights clinic (IHRC) provides a unique educational opportunity for students to gain first-hand, practical experience working on international human rights litigation and advocacy projects. The clinic combines classroom education with supervised case and project management, providing students practical training in advocacy and lawyering skills. For every 50 hours of participation in the program, including casework and class attendance, a student earns one unit. The first 3 units of academic credit earned at IHRC are graded. Any earned units above 3 are graded credit/no credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "440",
                "title": "International Human Rights",
                "description": "This course on International Human Rights is taught as an interactive and lively seminar that triggers thought-provoking analysis of the most significant and current trends in the field of human rights and international relations. The course will acquaint students with every significant aspect of this critical field as seen through multiple lenses: social, cultural, religious, political and economic factors that shape the global implementation of human rights. As a foundation, students will gain some understanding of the barriers to universal applicability of human rights by studying thought-provoking debates concerning cultural and religious relativism, and the double standards in human rights enforcement and implementation triggered by political and economic factors. The course covers , among other topics, the United Nations human rights system, regional human rights systems, domestic litigation, and mechanisms for the implementation of human rights including through the advocacy efforts of NGOs. Wherever possible, the course will focus on current domestic and international topics. Grading is based on a series of short papers and presentations, as well as class participation. There is no final examination.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "355",
                "title": "International Externship",
                "description": "Students learn about the functioning of lawyers in an international legal environment through practical experience in law offices, government entities, NGOs, and commercial entities outside of the United States. Student's work experience is critically examined utilizing guided reflections directed by the course instructor. Students work under the direct supervision of a licensed lawyer in the country of the externship. Students work a minimum of 50 hours per unit, up to a maximum of 12 units for full semester externships. Students must attend at least one orientation session prior to the start of the externship. Students are required to maintain time records, reviewed and certified by the externship supervisor, reflecting the student's time spend in the placement. All units are granted as CR/NC, and students are evaluated by their externship sponsors. Pre-requisite course is Pleading and Civil Procedure (114). Students must have received a grade of “C” or better in Pleading and Civil Procedure (114), and must submit a positive written evalution from the LARAW instructor. Externship placement are subject to availability.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "608",
                "title": "International Environmental Law",
                "description": "This course is a survey course in international and global environmental law.  It will cover a variety of substantive areas of international environmental law, including transboundary pollution issues, depletion of the stratospheric ozone layer, the treaty aspects of climate change, hazardous waste trade, biodiversity loss, international trade in endangered species, and overlap areas of trade and the environment as well as human rights and the environment.  Equally important, the course aims to introduce students to methodologies and approaches to solving transnational and global environmental problems.  As part of this effort, we will study the general structure of international environmental law, especially the most important organizational actors, the operation of environmental treaties and their limitations, the problem of enforcement, and emerging substantive legal principles of global environmental law.  There will also be several guest-speakers discussing their practice experience in the field.  Grading will be based on both class participation and a choice of either a final exam or final paper.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "601",
                "title": "International Commercial Arbitration",
                "description": "Course covers international commercial arbitration. Topics include the basic framework of international arbitration; the substantive aspects of the international arbitration agreement; the arbitral process itself; the recognition and enforcement of arbitral awards under the New York Convention. The course will expose the contexts in which international commercial disputants carry out conflict resolution between them and how international commercial arbitration fits into the emerging and ever changing transnational schemes of private dispute resolution.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "601",
                "title": "International Commercial Dispute Resolution",
                "description": "A consequence of commercial globalization is that disputes will occur between parties and, likely, the resolution of the disputes will not be resolved in or by a national judiciary. Litigation, either in US courts or in foreign courts, is often considered the last resort. What other dispute resolution options are available to commercial disputants form the basis for this course. The program of study will focus on the non-judicial methods of resolving international disputes: arbitration, mediation, and conciliation in the international context. In class exercises, litigation, choice of law, and proceedings before international tribunals round out the curriculum. This course fulfills the Professional Skills Requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "216",
                "title": "International Business Transactions",
                "description": "Legal problems of international commercial transactions; trade and investment. Financing, contracts, shipping, and insurance questions. Problems of Third World development, including expropriation and nationalization. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "388",
                "title": "Intellectual Property Survey",
                "description": "This course surveys the basics of United States intellectual property law, including patents, copyrights, trademarks and trade secrets. This course caters both to students who want a single-course sampler of intellectual property as well as students who intend to pursue a career in intellectual property law.  A technical background is not required.  Numerous IP electives require this course as a prerequisite, so we encourage students planning to explore the IP curriculum to take this course as early as possible.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "528",
                "title": "International Business Negotiation - Simulation",
                "description": "This course will involve the negotiation of a licensing agreement transferring certain nanotechnology to a company in Korea. Students will represent a Silicon Valley company with an extensive patent portfolio which they market extensively in the United States. This proposal will be the first step in acquiring a global market. The Korean company will be represented by a team of law students from Seoul National University, supervised by Professor Ko, Hak Soo. Actual negotiations will be conducted by teleconference, infour 2- hour sessions.The first two weeks of the course will consist of an accelerated overview of international negotiation techniques, basic Korean patent law, and an introduction to the legal and business culture of Korea. Pre-requisite: 658 International Licensing Transactions; or 216 International Business Transactions; or 228 Technology Licensing; or 327 Negotiating. Enrollment with approval of professor. Enrollment limited to10 students. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "262",
                "title": "Insurance Law",
                "description": "Course deals with insurance law and practice. Course covers the latest issues, as well as all aspects of property/liability and life, health and disability insurance coverage.The principles of insurance law, covering primarily life and casualty insurance. The nature of the insurance contract, the concepts of risk and insurable interest, and coverage and exclusions under insurance contracts. There are several weeks on claims handling standards, and the implied covenant of good faith and fair dealing.Public Interest abdSocial Justice Law certificate course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "298",
                "title": "Individual Research",
                "description": "Students wishing to explore an area not presently offered in the curriculum may arrange with a member of the faculty to do directed research in that area. A written product is required. Within the first 4 weeks in each semester, a student intending to obtain credit for this course must file a separate form in the Law Records Office. Students are limited to no more than 3 units in any academic period with a particular faculty member. Graded Credit/No Credit only. (1-3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "212",
                "title": "Immigration Law",
                "description": "Course explores statutory and constitutional issues related to citizenship and naturalization, admissions categories and procedure, exclusion and deportation regulation, and questions of immigration enforcement and policy. Course features statutory interpretation practice through the assignment of problems that require intensive use of the Immigration and Nationality Act. Course will also likely feature a midterm and a field component comprised of visits to immigration court, customs and border patrol facilities, and work with direct services organizations.(3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "338",
                "title": "Immigration Law & Policy Practicum",
                "description": "Depending on enrollment and number of projects, this course will attempt to engage current and foreseeable controversies in immigration law and policy. As a practicum, students will be participating in live and on-going projects, either as parts of research teams for current or anticipated litigation, or in a “think tank”/policy proposal capacity for local jurisdictions or non-profit organizations. Potential partners include law school clinics, the Asian Law Caucus or other non-profit organizations, and county officials or agencies. Please note that the work is likely to be immigrant-protective/",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "564",
                "title": "Improving America's Economic Competitiveness",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "538",
                "title": "Immigration Appellate Practice before the United States Court of Appeals for the Ninth Circuit",
                "description": "This course gives students an opportunity to enhance their advocacy skills through representation of individual clients in immigration cases pending before the United States court of Appeals for the Ninth Circuit. Students will represent clients under the Ninth Circuit's ProBono Program, which appoints counsel for certain applicants appearing ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "371",
                "title": "How Engineers, Businesspeople and Lawyers Communicate With Each Other",
                "description": "It can be challenging to effectively communicate and collaborate with people fromdifferent disciplines. This course will help students from business, engineering, and lawlearn to understand each other's perspectives, speak each other's language, and worktogether effectively in a collaborative environment. Students from different schools willbe organized into teams to work together on a simulated project involving a technologicalmatter, such as privacy/security or IP.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "304",
                "title": "Housing Discrimination",
                "description": "Exploration of the scope of discrimination in housing in the United States and the nature and adequacy of the legal remedies created to prevent it. The course will focus on primarily on federal statutory law, but will also examine some state statutes and some historical materials. Important themes of the class will be differences between the kinds of categories protected by state and federal statutes (e.g., race, sex, disabilities, and marital status) and continuing issues of residential segregation. Topics covered will include proving discrimination, discriminatory advertising, the meaning of race under the 1866 Civil Rights Act, the meaning of “handicap” under the Fair Housing Act, accommodation of persons with disabilities, and discrimination to achieve integration. Discrimination in lending, sexual harassment, marital status discrimination, and claims that enforcement of certain fair housing provisions violates the free exercise rights of landlords may also be covered.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "399A",
                "title": "Honors Moot Court Board-Internal",
                "description": "The Internal Moot Court Board is a student organization whose primary responsibility is the administration of the Honors Moot Court- Internal Competition. Student board members select and draft the problem, organize the competition, evaluate the final briefs, participate in critique sessions, arrange for judges, serve as bailiffs during the competition, etc. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "399B",
                "title": "Honors Moot Court Board - External",
                "description": "The External Moot Court Board is a student organization whose primary responsibility is the administration of Honors Moot Court External (HMCE) competitions. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "399",
                "title": "Honors Moot Court Board",
                "description": "The Moot Court Board is a student organization whose primary responsibility is the administration of the Honors Moot Court Competitions - Internal, External and Galloway. Student board members select and draft the problem, organize the competition, evaluate the final briefs, participate in critique sessions, arrange for judges, serve as bailiffs during the competition, etc. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "398",
                "title": "Honors Moot Court - Internal",
                "description": "Each year the School of Law conducts an in-house appellate moot court competition. Enrollment is limited. Students are selected to participate by the student-run Internal Moot Court Board based on a try-out application combined with evaluation of performance oral and written components of the Advocacy course, the second-year legal writing course. Students must complete the application on the deadline established by the internal moot court board. Selected students are permitted to register for Honors Moot Court - Internal Competition (HMCI) in the spring semester. Students earn 2 units of credit for full participation in the competition. Graded Credit/No Credit. If High Tech in nature, this course will then apply to the High Tech Law Certificate",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "396",
                "title": "Honors Moot Court -  External",
                "description": "The School of Law enters student teams in a number of inter-school, or external, moot court competitions. These are hosted by law schools and other organizations around the country and internationally in various subjects (Constitutional law, criminal procedure, copyright, trademark, environmental law, international law, etc.).  Many of the teams are selected, and problems distributed late in the fall semester, with briefs due and oral arguments held during the spring semester.  Others are held during the fall semester, and require team selections earlier in the school year, or over the preceding summer.  Eligibility to participate and receive credit therefore is limited and is based on application and demonstration of ability. Students may opt to earn 2 units of credit for their full, good-faith participation in the competition, awarded at the discretion of the faculty member. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "396A",
                "title": "Honors Moot Court - External",
                "description": "This is a zero unit “meeting time” class required for all students involved in an external moot court. This is so that students can meet together as a team, with the team coach or with Prof. Carter. The meeting time will not necessarily be used each week, but must be left available.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "527",
                "title": "Health Law 1: Patients, Providers, and Payers",
                "description": "Thissurvey class in health law is designed to provide a comprehensive overview of the subject. The class is divided into two parts: The first part of the semester will introduce you to the various stakeholders in our health care system, and the second part will examine, from the varying perspectives of these stakeholders, contemporary health law problems. (e.g. stem cell research, public health crises, assisted reproductive technologies). This format will enable us to scrutinize the health care system we have inherited, to understand the role law has played in its evolution, and to critically evaluate demands for isolated, as well as systemic change. Students will be evaluated on the basis of a written final examination. Social Justice and Public Interest Certificate course. (3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "524",
                "title": "Health Law 2: Health Care Regulation and Finance",
                "description": "This course focuses on private law responses to quality of care and autonomy issues involving health care providers and their consumers. The course examines the competing and overlapping liability models applied to health care providers, and the liability exposure of different provider groups, from individual health care professionals through provider groups to third party payors and drug and device manufacturers. The course covers the full range of litigation issues including expert and scientific evidence, causation, damages, and insurance issues as they relate to HCPs. Additionally, considerable attention is paid to the effect of statutory reforms, ranging from qualifications of experts through limitations on certain types of damage recovery to mandated dispute resolution mechanisms. Public Interest and Social Justice Certificate course (3 units). ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "418A",
                "title": "Health Law Seminar",
                "description": "This unique seminar gives students a chance to explore with faculty contemporry, cutting-edge issues in health care law. Course may require a paper, an exam, or both. Check the current semester schedule for current topics and course descriptions.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "483",
                "title": "Global Poverty, Human Rights and Development",
                "description": "The primary objective of this seminar is to discuss some of the controversies regarding the relationship between human rights and development (international, comparative and transnational). The first part of the seminar will introduce the students to the foundational concepts of human rights and international development from legal, philosophical, economic, political, and historical perspectives. Its departure point is the philosophical tradition that rooted in the nature of the human person. Following the introduction, the seminar will shift to explore the application of human rights and international development theories to a series of issues such as environmental justice, womens rights, land rights, health, housing, and the role of international financial systems and multinational corporation. The course will conclude with discussions on how international development and human rights movements can effectively address the challenge of global poverty.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "247",
                "title": "Globalization and The Rule of Law",
                "description": "With the dramatic end to the Cold War almost a decade ago, the world's attention has expanded to include concerns centered on politics and national security to the impact of global finance, trade and investment. A new concept has emerged in this period-globalization-which some argue is an accurate way to describe the massive changes underway in the international economy. Others disagree, arguing that the more things change the more they remain the same-that today's issues among nations continue to reflect longstanding differences. The debate is not simply academic but goes to the heart of policy choices being made by millions of people in every region of the globe. The questions raised by globalization are particularly acute for those countries attempting to break away from older state-centered patterns of political and economic organization. From the former Yugoslavia and the former Soviet Union to many of the developing countries of Latin America, the Middle East and Asia efforts are underway to support new ways of doing business that look, on the surface at least, like American-style capitalism. But the legal institutions necessary to make this effort a success are, as yet, immature and underdeveloped. The risks and uncertainties that this process entails are complicated but represent an exciting challenge for legal scholars and policy makers. This seminar will discuss the major points of view in the globalization debate and explore the role that law plays in solving the problems raised by the new era. Each semester we concentrate on one particular issue- set of significance, such as corporate governance or international labor issues.Students will read both theory and examine case studies. Student-led discussion and research paper will be required. Limited enrollment.(2 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "434",
                "title": "Gender and Law",
                "description": "Examination of discrimination and privilege based on sex. The course evaluates the legal doctrines, litigation strategies, and theoretical debates that have resulted as women have sought to emerge from the historic status of legal subordination. All women, since women encompass different races, sexual orientations, classes, and cultural backgrounds, must necessarily be part of this discussion. The subject matter includes the constitutional right to equal protection; sex discrimination in employment and public accommodations; equal access to education; sexual violence, including rape, domestic violence, pornography, and sexual harassment; discrimination and privilege in family law; and reproductive freedom.Limited enrollment. (3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "210",
                "title": "Food and Drug Law",
                "description": "Any lawyer employed by an FDA-regulated manufacturer in any capacity, or who seeks to represent or advise an FDA-regulated manufacturer, including not just regulatory law but also contract negotiation or patent prosecution, should be acquainted with the regulatory milieu in which the company operates.  Topics for this course include: FDA history, structure, regulatory environment; intended use of food, labeling, misbranding, adulteration, safety of constituents; dietary supplement labeling, identity and quality, and safety; labeling of conventional food and dietary supplements; regulation of drugs, prescription drug advertising, good manufacturing practices; new drug approval, biological products, generic drugs, exclusivity, OTC drugs; device classification, PMAs, 510(k)s, user fees; cosmetic vs. drug, color additives, adulteration and safety of ingredients, federal preemption of state law; and enforcement. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "301",
                "title": "Forensic Science and the Law",
                "description": "Forensic science is defined as the application of scientific or technical practices to the recognition, collection, analysis, and interpretation of evidence for civil and criminal law. Based on recent exonerations of criminal defendants wrongfully convicted based on forensic evidence, a series of reports and studies questioning the reliability and validity of certain forensic disciplines, and scandals in state crime laboratories, never before has the use of forensics been more controversial in the legal and scientific communities. This course will examine selected topics in the forensic sciences as we seek to understand the relationship between courts and science. While scientific methods and conclusions are evolving and changing, courtroom testimony requires jurors to come to a decision.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "340",
                "title": "Federal Taxation of Business Entities",
                "description": "Topics include an overview of the different forms of business entities and their income tax classifications, partnership taxation and corporate taxation. This course replaces 272. Federal Corporate Income Taxation and 279. Partnership Tax. Approved I.P. LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "242",
                "title": "Federal Indian Law",
                "description": "Courseoffers students an overview of federal Indian law through a study of cases and historical and contemporary materials. Covers the basic jurisdictional conflictsthat dominate this area of law and will cover specific areasthat have been the subject of these conflicts, such as land rights, hunting and fishing rights, water rights, domestic relations law, and environmental protection. Other areas, such as religious freedom and repatriation, will also be covered.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "270",
                "title": "Federal Income Tax",
                "description": "The federal income taxation of individuals. The concept of income, exclusions from income, personal and business deductions, sales and exchanges of property, when income is taxable, and to whom it is taxable. A statutory law course based on the provisions of the Internal Revenue Code and judicial and administrative interpretations thereof.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "322",
                "title": "Federal Courts and Jurisdiction",
                "description": "Introduction to the nature and operation of the federal court system. The judicial power of the United States, the nature of a federal question, diversity of citizenship, jurisdictional amount, removal jurisdiction. The Erie Doctrine and abstention. State/federal relations, habeas corpus, and civil rights litigation. Appellate jurisdiction of the Courts of Appeal and the U.S. Supreme Court. Prerequisite: 114 Civil Procedure. Approved IP LL.M. course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "274",
                "title": "Family Wealth Management",
                "description": "(Formerly Estate Planning and Taxation) A tax-oriented planning course covering thetax concepts essential to the planning of estates. Includes techniques for transferring wealth during life and death, including federal transfer tax consequences, use of trusts,and planning for family succession. Course also covers some non-tax aspects of estate planning, such as planning for incapacity and probate avoidance. Essential for any student who expects to be involved in the planning of estates, either as a specialist or as part of a more general practice. Teaching primarily by the problem method with numerous practical applications. Limited enrollment. Prerequisites: 281 Wills and Trusts. (3 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "291",
                "title": "Family Law",
                "description": "A comprehensive introduction to the legal regulation of the family. The course focuses on contemporary legal issues, supplementing case material with historical and social science research and drafting, interviewing, and other exercises that require application of the materials. Coverage includes marriage, non-marital relationships, divorce, custody, support, and the legal issues posed by nontraditional families.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "707",
                "title": "Externship Workshop:  Advanced Topics",
                "description": "Students participating in their third externship experience will be required to simultaneously complete the Advanced Externship Workshop.  Students will participate in a virtual classroom on TWEN.  Course credit will be awarded only on satisfactory completion of both the fieldwork and the online course. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "570",
                "title": "Ethics and Criminal Justice Advocacy",
                "description": "Pending Faculty Approval. The course will focus on the ethical responsibilities of prosecutors and criminal defense lawyers and will touch on the role of judges in the criminal justice context. Topics will include the defense lawyer's duty of zealous representation, the responsibilities of the prosecutor as an advocate and minister of justice, the duty of confidentiality and its limits, conflicts of interests, and ethical responsibilities in the investigation and trial of criminal cases: responsibilities of the prosecutor in charging decisions, the ethics of plea-bargaining from the perspective of prosecution and defense, the ethics of cross examination and closing arguments, obligations under Brady v Maryland, rewarding cooperation, and the handling of informants.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "706",
                "title": "Externship Workshop",
                "description": "The purpose of the seminar is to enable students to consider and discuss a variety of issues relating to the externship and the competencies lawyers and their clients want and need. Students' work experience will be critically examined to provide students with insights and concepts for continuing to improve performance as a lawyer. Requirements for the seminar may include assigned readings, journals through which students describe and reflect on the experience, and individual consultations with the professor. Course credit will be awarded only on satisfactory completion of both the externship and the seminar. Graded Credit/No Credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "320",
                "title": "Evidence",
                "description": "The rules governing what evidence may be placed before the trier of fact. The hearsay rule and its exceptions, rules of privilege, and the numerous rules that have been derived from concepts of relevancy.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "455",
                "title": "Estate Planning",
                "description": "Students will review the basic estate and gift tax rules, as needed, to enable them to tackle a variety of simulated problems dealing with different sorts of clients. Students will gain practical skills by learning how to interview prospective clients and draft planning documents.  1,2, or 3 hours of credit as determined by the professor.  Pre-requisites: Wills and Trusts; Federal Income Tax; Family Wealth Management (can we waived by the professor).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "288",
                "title": "Environmental Protection Law",
                "description": "A comprehensive introduction to environmental law. Emphasis on fundamental common law doctrines and judicial remedies, as well as modern environmental regulatory systems under statutes such as the federal Clean Air Act, Clean Water Act, National Environmental Policy Act, and other statutes relating to hazardous substances and wastes. Designed to develop the skills and understanding necessary for effective work by the lawyer involved in environmental matters in any capacity. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "414",
                "title": "Environmental Law Seminar",
                "description": "Advanced exploration of legal issues involved in current efforts to halt degradation of the environment. Emphasis on major responsibilities of environmental lawyers in serving environmental protection goals, as well as key considerations of justice. Topics include fairness in enforcement proceedings, citizen access to regulatory decision making, and “environmental racism” impacts of hazardous waste facility siting. Students select individual or small group research projects and presentation on environment law topics.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "482",
                "title": "Entrepreneurs' Law Clinic",
                "description": "The Entrepreneurs' Law Clinic (“ELC”) offers students the ability to work with startup companies and entrepreneurs on transactional matters. Both in the classroom and in the clinic, the students will be exposed to a wide variety of legal subject matter areas relevant to startup businesses. The goal of the ELC is to prepare students to be effective Silicon Valley lawyers through working with real-life clients. This course will be graded. Students must submit an application to be considered for the class, and entry in the class will be subject to approval by the ELC Director. This course will meet the Professional Skills Requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "243",
                "title": "Environmental Law in a Practice Setting",
                "description": "This 2-credit course provides an in-depth examination of a set of narrow issues that arise within the practice of environmental law, such as in climate change regulations in California, land use law practice, toxic torts, water regulation, environmental impact assessment under NEPA and CEQA, and environmental due diligence in real estate transactions. The course should be taken by anybody who plans to make environmental or energy law the focus of their career as well as anybody with plans for a general business law practices (since the issues and skills covered in the course will arise in those general business law practice settings). The course objectives are to: 1) familiarize students in-depth and with a relatively narrow focus on a select set of the most common environmental law practice issues that private firm and government lawyers deal with, 2) teach particular skills, such as client counseling, negotiation or drafting of a complaint or a comment letter, utilized by practitioners to address those issues, and 3) directly expose students to practitioners in the field. The course is not a replacement for taking the environmental protection law survey course, but should be taken ideally concurrently with or after the environmental law survey course. However, environmental law is not a prerequisite. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "482B",
                "title": "Entrepreneurs Law Clinic B",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "234",
                "title": "Entertainment Transactions",
                "description": "This course will focus on the legal and business issues contained in the various agreements used to structure deals in the video game industry from game development to distribution. Students will begin to learn the legal skills needed to analyze, negotiate, and draft agreements representing various parties in the video game industry. Although the course will focus on the video game industry, many concepts will be useful for any transactional practice.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "444",
                "title": "Energy Resources Law",
                "description": "For decades energy has been one of the most critical state, national, and global issues. This class is an overview of the legal and policy issues associated with the development and use of energy resources. This course intersects the disciplines of environmental law, natural resources law, and publicly regulated industries. The class will study the environmental and resource management issues relating to solar, wind, hydroelectric, coal, oil, natural gas, and nuclear power. It will also cover the causes and regulation of global climate change and its impact on the energy sector. The class will study the regulation of the electricity industry, including the movement toward deregulation and the causes of the 2001 California energy crisis. The course will examine international energy issues, including the regulation of petroleum. This class will be of value to students interested in environmental law, natural resources law, water law, administrative law, and international law.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "239",
                "title": "Employment Law",
                "description": "This course is an introduction to the legal rules that govern the employment relationship. In general, the course will focus on (1) the formation of the employment relationship and the consequences that flow from classifying the relationship as “employment”; (2) job security, including the at-will doctrine and its exceptions, employment contracts, and tort-based employee protections; (3) workplace torts; (4) workplace privacy and speech protections; (5) workplace property protections - such as protection of employer trades secrets and intellectual property; (6) certain statutory protections for workers - such as the Family and Medical Leave Act, the Fair Labor Standards Act, and workers' compensation schemes; and finally, (7) various risk management techniques - such as internal investigations of alleged wrongdoing, arbitration agreements, and severance agreements.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "223",
                "title": "Energy Transactions",
                "description": "PENDING FACULTY APPROVAL",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "238",
                "title": "Employment Discrimination",
                "description": "“This course is an introduction to the law of employment discrimination. In general, the course will focus first on the three basic theories of employment discrimination - individual disparate treatment, systemic disparate treatment, and disparate impact - and will then consider the interrelationship of these theories. With this foundation, the course will go on to consider in detail a variety of topics including sex and pregnancy discrimination, sexual harassment, discrimination based on religion, and disability discrimination. If time allows, the course also may cover procedures for enforcing antidiscrimination laws, and remedies for employment discrimination.”",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "294",
                "title": "Elder Law",
                "description": "This course meets the Professional Skills Requirement. Addresses legal issues that impact older individuals, including a discussion of government benefits (Social Security, Medicaid, Medicare, and SSI), long-term care (types, contract issues, civil rights, and financial planning), guardianship and conservatorship, planning for incapacity, and health care decisions at the end of life. Emphasizes planning techniques for the average older client.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "241",
                "title": "Economic Analysis of Law",
                "description": "Discussion includes, but is not limited to, property, contract, criminal, tort, and family law. The fundamental objective is to understand and evaluate legal rules by asking how rational individuals can be expected to respond to them. Economic theory provides an approach that reveals common elements in areas of law traditionally regarded as distinct.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "415",
                "title": "Drug Abuse Law Seminar",
                "description": "Lecture/discussion sessions interspersed with workshop sessions in which students examine and cross-examine guest experts from a variety of disciplines. Begins with medical, sociological, and historical data on the drugs most commonly abused and their legal classifications. Sessions are then devoted to possession and trafficking offenses, law enforcement techniques, constitutional defenses, and sentencing and treatment alternatives. Guest experts include a police chemist, an experienced narcotics officer, psychiatrists, and physicians.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "539",
                "title": "E-Discovery",
                "description": "Complex litigation often involves the collection, production, management and analysis of massive amounts of electronic data. This course considers the legal and operational issues associated with such processes.  Prerequisite: 114 (Pleading and Civil Procedure). Approved IP LL.M. course. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "401",
                "title": "Domestic Violence Seminar",
                "description": "Examination of the legal system's response to domestic violence using an interdisciplinary approach. The legal (criminal and civil) and social issues regarding domestic violence will also be examined. The dynamics of domestic violence will be studied in great detail including the use of collaborative and cooperative approaches to domestic violence prevention and accountability. Such approaches include domestic violence councils, use of mental health professionals, and specialized domestic violence courts in adult criminal, family law, and juvenile domestic violence, and dependency law cases. Students will have the opportunity to participate in field trips to specialized courts and domestic violence intervention programs.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "435",
                "title": "Domestic Violence Mini Course",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "545B",
                "title": "Domestic Away Externship Part Time",
                "description": "The Domestic Away Externship Program is for judicial, government and social justice Externships out of the Bay Area. The Domestic Away Externship Program does not include placements of for profit firms and companies. Away placements are limited to established social justice organizations, government offices and the courts. In addition to students field-work, students must register for the appropriate on-line Externship Workshop (706).  Course credit will be awarded only on satisfactory completion of both the fieldwork and the online course. Students must complete both components simultaneously. Students are also required to participate in a monthly check-in telephone call with the faculty supervisor. Graded Credit/No Credit. Prerequisite: Civil Procedure (114).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "350",
                "title": "Disability Law",
                "description": "Examines federal and state law prohibiting discrimination on the basis of disability with particular emphasis on the Americans with Disabilities Act of 1990, Section 504 of the Rehabilitation Act of 1973, The Individuals with Disabilities Education Improvement Act (IDEIA) of 2004, and California's disabilities civil rights statues. Covers a wide range of topics including employment, education, housing, technology, and health care; the California Managed Health Care Accountability Act of 1999; the Consolidated Omnibus Budget Reconciliation Act of 1985 (COBRA); the Health Insurance and Portability Act of 1996 (HIPAA); and the Mental Health Parity Act of 1996. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "545A",
                "title": "Domestic Away Externship Full Time",
                "description": "The Domestic Away Externship Program is for judicial, government and social justice Externships out of the Bay Area. The Domestic Away Externship Program does not include placements of for profit firms and companies. Away placements are limited to established social justice organizations, government offices and the courts. In addition to students field-work, students must register for the appropriate on-line Externship Workshop (706).  Course credit will be awarded only on satisfactory completion of both the fieldwork and the online course. Students must complete both components simultaneously. Students are also required to participate in a monthly check-in telephone call with the faculty supervisor. Graded Credit/No Credit. Prerequisite: Civil Procedure (114).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "260",
                "title": "Debtors' and Creditors' Rights",
                "description": "Exploration of methods by which creditors can seek satisfaction of debt and the methods by which debtors can seek relief from or discharge of debt under both state collection law and federal bankruptcy law. A portion of the course is devoted to exploring these issues in the context of consumer debtors. The remainder of the course is devoted to exploring these issues in the context of small- or moderate-size businesses.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "211",
                "title": "Cybersecurity Law",
                "description": "The goal of this class is to teach key US cybersecurity laws and what companiesmust do to comply with them. This course will provide a thorough understandingof what a transactional cybersecurity lawyer does in practice for corporate clients,and technology companies in particular.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "310",
                "title": "Criminal Procedure: Investigation",
                "description": "Introduction to the procedure for the enforcement of criminal law. Special emphasis on the constitutional rights of the criminal defendant, including right to counsel, search and seizure, self-incrimination, wiretapping and electronic eavesdropping, police interrogation and pre-trial identification, and the use of illegally obtained evidence. Bar Course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "465",
                "title": "Critical Lawyering Skills Seminar",
                "description": "The 1L Critical Skills Seminarinteractive course that focuses on competenciesstudents will need to succeed in law school and enter practice.Using hands-on problem based scenarios to explore professional roles, teach reflective lawyering and introduce students to critical skills such as:Communication, active listening, managing one's own work, client service, creative problem solving, handling mistakes, self-development and reflective lawyering.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "311",
                "title": "Criminal Procedure: Adjudication",
                "description": "Designed to provide an in-depth examination of how to litigate criminal cases in California for those pursuing a career in criminal defense or prosecution. Examining a criminal case beginning with an accused's right to representation at a lineup and ending with counsel's post trial responsibilities, course highlights special problems concerning admissibility of evidence, search and seizure issues, prosecutorial and judicial misconduct, ineffective assistance of counsel, jury selection, the death penalty, and the impact of the “Three Strikes You're Out” law. Each student is required to prepare and participate in a series of trial problems and research, write, and argue two motions. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "364",
                "title": "Criminal Law and Policy Seminar",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "364",
                "title": "Criminal Law and Policy",
                "description": "This class will serve as a kind of think tank. Students in the class will have the opportunity to affect policy and to have their work read and circulated by policymakers.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "106",
                "title": "Criminal Law",
                "description": "Basic introduction to substantive criminal law. What act and mental state, together with what attendant circumstances or consequences, are necessary ingredients of various crimes. Includes a detailed analysis of many of the crimes against persons and property; responsibility (insanity, intoxication, infancy); defenses, justifications, and excuses; parties to crime and anticipatory offenses. Common law history and modern statutes are used as material. (One-semester course)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "591C",
                "title": "Criminal Justice Externship: Expungement",
                "description": "Graded Course. Limited Enrollment. Pre- or Co-Requisite: Evidence (320). This program allows students to represent indigent defendants seeking expungement of their criminal records in court. Students must be certified to appear in Superior court. The lessons learned in this clinic will be invaluable for any students who expect to practice in the criminal justice system. Students may not participate in this clinic while working in law enforcement or in the district attorneys office due to the conflict of interest it presents. Students work under the direct supervision of two California licensed lawyers. Students must attend the weekly class seminars during the semester. There will be a mandatory “Training/Boot Camp”. Requirements include assigned readings, participation in class meetings, research and writing, and field work on cases outside of class. Students receive 2 units of credit for the fieldwork (150 hours) and one unit for the seminar. This class meets the Professional Skills requirement. Students should register on e-campus and then submit the Criminal Defense Expungement Application to the Law Student Services Office.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "561",
                "title": "Criminal Justice Externship II",
                "description": "This externship allows students who have already participated in the Criminal Justice Externship I to do a second externship. The additional externship would need to present a new educational experience that provides an opportunity to learn new or expand current skills. The presumption is that students will work with a new externship sponsor. A student can overcome the presumption (one time, only) and receive approval, by submitting a memorandum of understanding, signed by both the student and the supervising attorney, that describes the legal tasks and/or skill-sets the student will enhance, learn, and and grow. In addition to students' externship, students must register for the online Externship Workshop (706). Course credit will be awarded only upon on satisfactory completion of both the fieldwork and the online course. Students must complete both components simultaneously. Graded Credit/No Credit. Prerequisite: Civil Procedure (114), Criminal Justice Externship I (591).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "591B",
                "title": "Criminal Justice Externship : Public Defender's Office",
                "description": "Students register for 3 units of credit (equivalent to 150 externship hours). Each externship meets the Professional Skills requirement and the Experiential Learning requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "591A",
                "title": "Criminal Justice Externship I",
                "description": "This course integrates practical experience gained from working in organizations that prosecute or defend individuals accused of crimes (e.g., district attorney, public defender). Students work under the direct supervision of a licensed lawyer. Students must concurrently register for and successfully complete the Externship Workshop (706). Students can earn up to 6 units, with earn 1 unit for every 50 hours of approved work. Course credit will be awarded only upon satisfactory completion of both the externship and the online course. Students must complete both components simultaneously. Graded Credit/No Credit. Prerequisite: Criminal Law (106).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "272",
                "title": "Corporate Taxation",
                "description": "This course will cover the main provisions of the Internal Revenue Code that deal with the taxation of U.S. corporations and their domestic shareholders, including provisions governing corporate formation, operations, dissolutions and acquisitions, both taxable and tax-deferred.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "541",
                "title": "Corporate Theory and Policy",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "363",
                "title": "Corporate Social Responsibility",
                "description": "The seminar on Corporate Social Responsibility introduces students to concerns relating to the conduct of corporationsworldwide and the different approaches proposed for integrating beneficial policies into transnational and national business operations. Students will examine the impact of corporate activity on a broad spectrum of stakeholders, including humans, animals, and the environment. The course will evaluate international, national, and subnational effortsto promote corporate responsibility. Among other topics, students will examine the international norms established by the United Nations GuidingPrinciples on Business and Human Rights, aspirational solutions through international bodies such as the trade organizations, national dialog as expressed through Alien Tort Statute litigation, State solutions such as Benefit Corporations and Flexible Purpose Corporations. Students will be evaluated on the basis of a series of short papers, drafting exercises, and presentations. A limited number of students will be permitted to satisfy the Supervised Analytical Writing Requirement through this course. The course satisfies the Professional Skills Requirement.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "516",
                "title": "Corporate Governance Seminar",
                "description": "In this seminar course, students study and discuss current theories of corporate governance, state and federal government laws and policies concerning governance of publicly held companies, and contemporary practices that properly allocate responsibility for governance of publicly held companies. Business Organizations (248)is a pre-requisite.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "548",
                "title": "Corporate Finance",
                "description": "Topics to be covered include: valuation, debt, equity, corporate governance and, to a limited extent, mergers and acquisitions. The course is aimed at students who intend to represent corporations either as outside counsel or in house counsel.  If you are in the JD/MBA program note that this is not the same course as the Business School offers. That is a quantitative course that compliments this course which relies more heavily on qualitative analysis. A prior background in accounting, business or finance is helpful but not essential.  Pre-requisite:  Business Organizations (248).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "385",
                "title": "Copyright Law",
                "description": "In-depth examination of the current status of copyright doctrines under the 1976 Copyright Act. Consideration of principles historically developed under the common law and the 1909 act. Emphasis on the traditional realms of copyright: literary, musical, and artistic works. Exploration of recent copyright developments in computers, video recording, internet and other modern technologies. Approved IP LL.M. course. Prerequisite: IP Survey (388) ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "102D",
                "title": "Contracts 2e",
                "description": "Basis for, and the scope and purpose of, the legal protection afforded contracts and the remedies by which that protection is secured. Includes mutual assent, the bargained-for exchange and substitutes for consideration, the statute of frauds, interpretation of contract language, the effect of changed circumstances, conditions, rights of third parties, assignment, and measures of recovery in event of breach. The historical evolution of contract law, the Uniform Commercial Code, and other modern statutory developments. (This is the second of two Contracts courses)Prerequisite is Contracts 1e (LAW 102C)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "102B",
                "title": "Contracts 2",
                "description": "Basis for, and the scope and purpose of, the legal protection afforded contracts and the remedies by which that protection is secured. Includes mutual assent, the bargained-for exchange and substitutes for consideration, the statute of frauds, interpretation of contract language, the effect of changed circumstances, conditions, rights of third parties, assignment, and measures of recovery in event of breach. The historical evolution of contract law, the Uniform Commercial Code, and other modern statutory developments. (This is the second of two Contracts courses)Prerequisite is Contracts 1 (LAW 102A)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "102C",
                "title": "Contracts 1e",
                "description": "Basis for, and the scope and purpose of, the legal protection afforded contracts and the remedies by which that protection is secured. Includes mutual assent, the bargained-for exchange and substitutes for consideration, the statute of frauds, interpretation of contract language, the effect of changed circumstances, conditions, rights of third parties, assignment, and measures of recovery in event of breach. The historical evolution of contract law, the Uniform Commercial Code, and other modern statutory developments. (This is the first of two Contracts courses)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "102A",
                "title": "Contracts 1",
                "description": "Basis for, and the scope and purpose of, the legal protection afforded contracts and the remedies by which that protection is secured. Includes mutual assent, the bargained-for exchange and substitutes for consideration, the statute of frauds, interpretation of contract language, the effect of changed circumstances, conditions, rights of third parties, assignment, and measures of recovery in event of breach. The historical evolution of contract law, the Uniform Commercial Code, and other modern statutory developments. (This is the first of two Contracts courses)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "102",
                "title": "Contracts",
                "description": "Basis for, and the scope and purpose of, the legal protection afforded contracts and the remedies by which that protection is secured. Includes mutual assent, the bargained-for exchange and substitutes for consideration, the statute of frauds, interpretation of contract language, the effect of changed circumstances, conditions, rights of third parties, assignment, and measures of recovery in event of breach. The historical evolution of contract law, the Uniform Commercial Code, and other modern statutory developments. (Two-semester course)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "437",
                "title": "Contemporary Legal Theory Seminar",
                "description": "In-depth examination of one or more contemporary legal theories chosen by the instructor. Check with instructor. Course may require a paper, an exam, or both.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "454",
                "title": "Contemporary International Issues",
                "description": "Faculty members rotate teaching this unique seminar which gives students a chance to explore with faculty contemporary, cutting-edge issues in international law. Course may require a paper, an exam, or both.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "231",
                "title": "Consumer Protection",
                "description": "This course examines both Federal and California Consumer Protection Statutes.Emphasis is placed on statutes that can be enforced privately by consumers and their attorneys. The course attempts to focus on the claims that are most often prosecuted by private consumer attorneys and by students at the Alexander Community Law Center. Major subject areas include auto fraud, unfair debt collection, Truth in Lending, and consumer class actions.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "265",
                "title": "Consumer Mini-Course",
                "description": "This course if offered over one weekend and meant to provide in-depth coverage of a single consumer protection issue that is not possible in the 3-unit Consumer Protection class. The particular subject matter of the course will rotate between selected statutes that private attorneys focus on in real world consumer practices. Examples include Fair Debt Collection (focusing on Federal and State statutes enforceable by private attorneys) and Fair Credit Reporting (focusing on the Federal Fair Credit Reporting Act). Check the course schedule to determine the focus of this year's mini-course. The course can be taken along with the regular Consumer Protection course or as a separate 1-unit class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "202",
                "title": "Constitutional Litigation",
                "description": "Advanced constitutional law course on issues relating to civil rights and civil liberties, including the enforcement of the due process clause and the equal protection clause of the United States Constitution, as well as the first amendment rights of free speech and the freedom of religion. The course will focus on Section 1983 claims (against state and local governmental officials and against local municipalities) as well as Bivens claims (against federal governmental officials). The course will consider not only the theories of liability that plaintiffs may raise in the process of litigating constitutional claims, but also the remedies that are available to plaintiffs in constitutional litigation (including injunctive relief, damages, and attorney's fees). The course will feature cases on discrimination on the basis of race, sex, and sexual orientation. Public Interest and Social Justice Law certificate course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "426",
                "title": "Constitutional Law Seminar : First Amendment Theory &Practice",
                "description": "Required: Consistent attendance and participation; preparation of ungraded bar practice questions; final paper. Prerequisite:  Constitutional Law I and II.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "201",
                "title": "Constitutional Law II",
                "description": "Second half of introduction to concepts of constitutional doctrine. Focus on individual rights; equal protection; freedom of speech, press, and assembly; and freedom of religion. Required during the second year.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "200",
                "title": "Constitutional Law I",
                "description": "First half of introduction to concepts of constitutional doctrine, with particular reference to the institutional role of the Supreme Court. The judicial function in constitutional cases (judicial review), the structure of government and the constitutional distribution of power between nation and states and among the three branches of national government, and individual rights under the due process clauses. This course is an Graduate course for students who enrolled prior to fall 2006. (One-semester course)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "665",
                "title": "Conflict Theory",
                "description": "This course focuses on conflict before resolution strategies are considered.  It concentrates on the sources and nature of conflict, how and why it escalates, de-escalates or persists, and the conditions under which it can be constructive or destructive. The subject matter is explored from psychological, social, legal, communication, and cultural perspectives.  The primary goal of the course is to provide prospective attorneys with the foundational and contextual knowledge that they will need in order to successfully recognize and evaluate the dynamics of conflict in a particular client's situation. Only upon such strong underpinnings can an attorney hope to effectively construct sound and appropriate resolution strategies. Because the ultimate practice goal, once theory is mastered, is indeed the employment of appropriate conflict resolution strategies as part of effective client representation, students in this course will also be introduced to a variety of specific conflict resolution strategies, skills and processes. Awareness of their options will help students to make informed decisions about their future law school course selections and continuing education after graduation in this field of study. In addition to lecture and assigned reading, this course will use brief exercises and group discussions to clarify and reinforce theoretical points and to provide experiential learning and skills development opportunities.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "220",
                "title": "Conflict of Laws",
                "description": "Study of the problems that arise when the domiciles of the parties or other significant facts concerning a controversy are connected with states other than the state in which litigation occurs. Problems of jurisdiction of courts, choice of law, the effect of foreign judgments, and constitutional limitations.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "799",
                "title": "Computer and High Technology Law Journal",
                "description": "All Graduate law students are eligible to participate in the publication of the ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "485",
                "title": "Comparative Privacy Law",
                "description": "Pending faculty approval. This course surveys the approaches to privacy regulation around the globe, including a comparison of regulatory philosophies and different policy solutions. The course also introduces the major international privacy regulatory and enforcement institutions.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "438",
                "title": "Comparative Law Seminar",
                "description": "Examination of the history, structure, and institutions of civil law, common law, and socialist legal traditions. Although several class meetings and individual research examine substantive law, emphasis is on study of legal systems and traditions. Primary focus is private law (the equivalent of common law system's civil obligation) and some comparative constitutional law and criminal procedure. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "290",
                "title": "Community Property",
                "description": "A specialized, primarily statutory course in the California law of marital property. Classification of property as separate or community, management and control, liability for debts, problems on dissolution of the community. Bar Course.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "255",
                "title": "Commercial Transactions",
                "description": "Examines fundamentals of negotiable instruments (promissory notes and checks), credit cards, wire transfers, letters of credit, and other payment methods often used in general practice and commercial transactions. Topics include the holder-in-due-course doctrine, wrongful dishonor, stop payment, and allocation of losses caused by forgery or alteration. Articles 3, 4, 4A, 5, and 7 of the Uniform Commercial Code are emphasized.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "664",
                "title": "Commercial Real Estate Leasing",
                "description": "Seminar will provide students with an overview of commercial leasing, from letter of intent, through lease negotiation and execution, to lease administration.  The key provisions of a commercial real estate lease will be analyzed to review their purpose, the underlying law and the motivations of the parties. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "365",
                "title": "Class Actions and Complex Civil Litigation",
                "description": "The course will adopt an actual practice perspective that emphasizes student participation in litigation exercises.  Students will analyze class actions recently in litigation including the Wal-Mart employment discrimination suit and the BP oil spill.  They will also prosecute and defend motions for class certification and settlement approval.  Guest lectures by attorneys and judges will provide insight into the strategic and ethical dimensions of class and multi-party litigation.  The course will be particularly useful to students planning careers in public or private civil litigation or seeking judicial clerkships.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "669",
                "title": "Climate Change Law",
                "description": "This course will introduce students to the legal tools and policy measures used to respond to the world's most pressing and prominent environmental problem — global climate change.  In the process, we will explore evaluative frameworks and the latest developments in California, the U.S., and internationally, including the status of international climate negotiations and new treaty commitments, the pervasive social justice dialogue among governments and with civil society and the business sector, and the implications for the people of the developing and developed world.  The course will emphasize the practical aspects of implementing measures, including new and pending federal and state regulations, the operation of economic mechanisms such as carbon markets, related energy issues, and the increasing need to focus on climate adaptation.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": null,
                "title": "Civil Rights and Civil Liberties",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "114A",
                "title": "Civil Procedure 1",
                "description": "The study of the rules, standards, and values that govern the procedures used in civil cases in the federal district courts of the United States. Drawing from constitutional and statutory texts, and emphasizing the Federal Rules of Civil Procedure, the course covers civil litigation issues including: jurisdiction, choice of law, venue, pleadings, discovery, pre-trial motions, trial through judgment, joinder of parties and claims, and finality of judgments. The course also constitutes an introduction to legal strategy and the professional responsibility of lawyers in representing their clients. (This is the first of two Civil Procedure courses)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "114B",
                "title": "Civil Procedure 2",
                "description": "The study of the rules, standards, and values that govern the procedures used in civil cases in the federal district courts of the United States. Drawing from constitutional and statutory texts, and emphasizing the Federal Rules of Civil Procedure, the course covers civil litigation issues including: jurisdiction, choice of law, venue, pleadings, discovery, pre-trial motions, trial through judgment, joinder of parties and claims, and finality of judgments. The course also constitutes an introduction to legal strategy and the professional responsibility of lawyers in representing their clients. (This is the second of two Civil Procedure courses)Prerequisite is Civil Procedure 1 (LAW 114A)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "114",
                "title": "Civil Procedure",
                "description": "The study of the rules, standards, and values that govern the procedures used in civil cases in the federal district courts of the United States. Drawing from constitutional and statutory texts, and emphasizing the Federal Rules of Civil Procedure, the course covers civil litigation issues including: jurisdiction, choice of law, venue, pleadings, discovery, pre-trial motions, trial through judgment, joinder of parties and claims, and finality of judgments. The course also constitutes an introduction to legal strategy and the professional responsibility of lawyers in representing their clients. (Two-semester course; 6 units)",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "597",
                "title": "Civil Practice, High Tech, and Social Justice Externship II",
                "description": "This externship allows students who have already participated in the Civil Practice, High Tech, and Social Justice Externship I to do a second civil externship. The additional externship must present a new educational experience that provides an opportunity to learn new or expand current skills. The presumption is that students will work with a new externship sponsor. A student can overcome the presumption (one time, only) and receives approval by submitting , a memorandum of understanding, signed by both the student and the supervising attorney, describing the legal tasks and/or skill-sets the student will enhance, learn, and grow. In addition to students' externship, students must register for the Externship Workshop (706). Certificate Course credit will be awarded only on satisfactory completion of both the fieldwork and the online course. Students must complete both components simultaneously. Graded Credit/No Credit. Prerequisite: Civil Procedure (114), Civil Practice, High Tech, and Social Justice Externship I (590).",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "400",
                "title": "Alternative Dispute Resolution for Youth: Teaching Conflict Resolution in a High School Setting",
                "description": "Course Description:",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "105",
                "title": "Advocacy",
                "description": "This is the third semester of Santa Clara's required Legal Analysis, Research, and Writing program and builds upon the legal analysis, research, and writing skills taught during the first year. Students are presented with the record of a case on appeal and represent one of the parties. Students identify the legal issues in the case and research those issues, then write successive drafts of an appellate brief on behalf of their client and present oral argument in a courtroom setting. Students receive detailed written comments on their work. Required during the second year. Beginning in Summer 2008, this course will be offered for a grade.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "300",
                "title": "Alternative Dispute Resolution",
                "description": "This course is a survey of various dispute resolution alternatives to the traditional trial process. The focus is on arbitration, negotiation, and mediation. Among the objectives for this course are that each student gain familiarity with these processes, with certain skills that might prove helpful in negotiating or mediating the resolution of a dispute, and with certain factors that might be relevant in selecting the most appropriate method or methods of dispute resolution for a client. The arbitration section of the course generally follows a traditional, case-dominated approach. During the negotiation and mediation sections of the course, students have the opportunity to participate in several mock negotiation and mediation exercises that are designed to enhance understanding of the assigned readings. Students also view and critique videotaped portions of one or more negotiations and mediations. The class utilizes extensive group discussion. Finally, each student is required to submit a paper on a topic of her or his choice relating to ADR and is required to present the paper to the class.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "712",
                "title": "Advertising and Marketing Law",
                "description": "This course will survey the laws applicable to the advertising and marketing industries.  Expected topics include the advertising/",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "329",
                "title": "Advanced Negotiation",
                "description": "Pending Faculty Approval",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "540",
                "title": "Advanced Torts",
                "description": "This course will provide upper division law students with the opportunity to study the areas of law which were eliminated from Torts when the course was reduced from six units to four.These areas include Defamation (Common Law Background, Constitutional Limitations on Defamation); Privacy (Public Disclosure of Private Facts, False Light Privacy, Intrusion, Appropriation); Intentional Economic Harm (Misrepresentation, Interference with Contracts, Interference with Prospective Economic Advantage, Contracts and Torts in the Economic Sphere). Other potential topics include Introduction to Insurance, Incremental Tort Reform, Occupational Injuries -Workers' Compensation, Motor Vehicle Injuries, and no-Fault Schemes.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "331",
                "title": "Advanced Trial Techniques",
                "description": "A two-semester course in advanced litigation skills and trial strategy. Selection for this course is based on student performance in a mock litigation exercise. Students participate in numerous exercises, conduct several complete trials, and represent Santa Clara University in two trial competitions during the year. Evening and weekend meetings required.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "674",
                "title": "Advanced Mediation",
                "description": "Pending Faculty Approval. Students who have completed a Mediation course at Santa Clara Law are eligible to take this 1-unit course, designed to hone students' mediation skills as they teach Peer Mediation to high school students and provide feedback to those students. About half of the course will consist of two weekend course meetings/training sessions in the second half of January 2018 over portions of two days. The remainder of the course will consist of working with the high schoolers, under the supervision of professors and professional mediators, at the Foundation for Hispanic Education in East San Jose about 15 minutes from SCU (",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "724C",
                "title": "Advanced Low Income Tax Clinic",
                "description": "Students enrolled in this advanced course will continue to work on Tax Clinic cases. They may also be assigned to new cases and/or projects, or be asked to prepare and present educational tax-related presentations to the local low-income community. This advanced clinic is designed to help students further develop their professional lawyering skills, with particular emphasis on case management, time-management, interviewing, fact-finding, documenting, monitoring, and drafting documents. Students register for 2 units of academic credit, which will be graded and fulfill 50 hours per unit consisting of casework and meetings. Students must participate in mandatory weekly meetings with the Director to discuss their cases in depth. This course meets the professional skills requirement and the Public Interest and Social Justice Law Certificate.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "336",
                "title": "Advanced Legal Research: Foreign, Comparative, and International Legal Research",
                "description": "Credit/No Credit. This course will familiarize students with primary and secondary sources in international law, primarily treaty research and the documents of international organizations and tribunals. It will also introduce students to researching the law of selected jurisdictions outside of the United States.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "373b",
                "title": "Advanced Legal Writing: Bar Exam",
                "description": "This course hones the skills necessary to pass the Bar Exam. Through extensive practice, students will develop a solid understanding of the organization, depth, and precision required for success on the bar. A portion of the course may be presented by video lecture. Students will answer multiple-choice questions, write answers to practice questions in and out of class, learn to self-assess their work, and will receive regular feedback from their instructor. To receive course credit, students must complete all assignments on time, and take a final mock bar exam. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "642",
                "title": "Advanced Legal Research in Intellectual Property",
                "description": "A hands-on course for those planning to specialize in intellectual  property practice. Electronic research networks and use of proprietary publications will be featured. Approved IP LL.M. course.Graded credit/no credit.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "305",
                "title": "Advanced International Law Seminar",
                "description": "Specific, most important, and acute problems of international law: issues recently on the program of the United Nations International Law Commission; recent cases of the International Court of Justice or other courts and tribunals; most important issues discussed by the doctrine; practical issues of international law. Issues include customary rule of international law; general principles of law; responsibility of states for internationally wrongful acts; reservations to treaties; international liability for injurious consequences arising out of acts not prohibited by international law; unilateral acts of states; diplomatic protection; question of the protection and inviolability of diplomatic agents and other persons entitled to special protection under international law; legality of nuclear weapons; use of force in international relations (Kosovo, Afghanistan); issues relating to international terrorism; status of combatants; status of detainees in international armed conflict, and their protection in the course of criminal proceedings. Intellectual property international issues could be also included among the subjects for discussion. Basic knowledge of international law required. 215 International Law recommended. ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "374",
                "title": "Advanced Legal Research",
                "description": "Advanced Legal Research is designed to teach “real-world” legal research skills to prepare students for the challenges and expectations they will encounter in legal practice and/or clerkships. The course will review who publishes legal authority, how it is organized, and how to access it efficiently with particular attention on cost-effective research. Utilizing current, and emerging, legal research tools and technologies, the course develops research skills with assignments, lectures, and mock legal research exercises which emulate assignments typically given to attorneys new to practice. The pedagogical goals of this course include: 1) teaching students how to effectively evaluate research sources and use these materials with attention to cost, 2) proficiency working with primary and secondary legal materials (including practice materials such as forms, model documents, and guidelines/checklists), 3) expose students to SEC filings and transactional materials, 4) cover state and federal regulatory materials and current awareness tools. This course is offered online in the summer and in the classroom during the fall semester. Assignments and lectures will emphasize cost-efficient research strategies, legal technology and current awareness resources for attorneys, and Internet research.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "728B",
                "title": "Advanced International Human Rights Clinic B",
                "description": "Credit/No Credit. Enrollment in this course is limited to those students who successfully complete Course No. 727 (International Human Rights Clinic), and subject to the Clinic Director's approval. Adv Clinic B is the proper course to enroll in if you wish to take more than the 2 units of credit offered under Adv Clinic A.  ",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "728A",
                "title": "Advanced International Human Rights Clinic A",
                "description": "Enrollment in this course is limited to those students who successfully complete Course No. 727 (International Human Rights Clinic), and subject to the Clinic Director's approval.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "209",
                "title": "Advanced Immigration Law",
                "description": "Course will be a natural progression for students after they obtain the basics of immigration law. Provides students with a more sophisticated look at the issues raised in the basic course by covering such topics as immigration law and gender issues. Some prior basic knowledge of immigration law is encouraged but not required.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "721",
                "title": "Advanced Contracts",
                "description": "This course focuses on sophisticated commercial problems and cases, usually based on Article 2 (the Sales article) of the Uniform Commercial Code.  A primary emphasis is on methods for interpreting contract provisions and the underlying statutory provisions, usually during the performance phase of contracts.  The problems are far more complex and business-centered than in the basic contracts course.  Moreover, they often arise in transactional and counseling settings and the material lends itself to considering the role of lawyers in these situations, as distinguished from their roles as litigators.  The assigned material usually will include exercises designed to develop your drafting and other skills and thereby give you a better sense of what business lawyers actually do with contracts and contract law.  Contracts is a primary subject on bar exams.",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "342A",
                "title": "Advanced California Tax Appeals Assistance Clinic",
                "description": "",
                "abbr": "LAW",
                "type": "Graduate"
            },
            {
                "id": "395",
                "title": "Advanced Appellate Oral Advocacy",
                "description": "Credit/No Credit.  This one unit course focuses on oral argument before an appellate court.  All students are required to practice their oral skills one-on-one with the professor.  The course also provides additional exposure to fundamental techniques in written advocacy before appellate courts.  This course is strongly recommended for student planning appellate moot court work in either external competition or the Honors Moot Court Competition.  Pre-Requisite:  Advocacy (105)",
                "abbr": "LAW",
                "type": "Graduate"
            }
        ]
    }
]
