[
    {
        "university": "Santa Clara University",
        "school": "School of Education and Counseling Psychology",
        "department": "",
        "courses": [
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "221M",
                "title": "Effective Teaching for Students with Disabilities",
                "description": "This course provides multiple and single subject teaching credential candidates with an introduction to creating positive and effective, inclusive, instructional environments for all learners, including students with disabilities. This course introduces the candidates to a range of strategies for learning about their students’ background knowledge, experiences, and interests and for identifying their academic, language, and social skill levels. Focused on the use of effective, inclusive teaching practices that enable all students to be successful, the course develops candidates’ ability to plan and implement flexible, standards-based instruction that will enable every student to learn every day. This course includes a study of types of disabilities according to IDEA 2004 and California rules and regulations, and criteria for identification for special education services, as well as an examination of the types of services provided in response to student needs. Candidates examine the population of students included for special education services, the continuum of services available, and different models of service delivery.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231A",
                "title": "Ethical Reflective Practicum in Elementary Schools I",
                "description": "This class is the first in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels. The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience. This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231B",
                "title": "Ethical Reflective Practicum in Elementary Schools II",
                "description": "This class is the second in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231C",
                "title": "Ethical Reflective Practicum in Elementary Schools III",
                "description": "The teacher candidate will continue to maintain a narrative reflective journals of all instruction observed. (6.1-6.4, 6.6) The teacher candidate will demonstrate knowledge and use of the range of curricular materials and resources available at their school. (2.4) Students will explore a variety of positive ways to manage student behavior (1.8, 2.1, 2.6, 2.6) Each student will demonstrate a developing repertoire of effective teaching standards in their specific content teaching area. (1.6, 1.8, 2.1, 2.2 3.4, 5.5) Students will understand their legal and ethical responsibilities as a professional educator. (2.3, 2.4, 6.5, 6.6) Students will understand the value of parents as partners and develop strategies to utilize the skills of parents. (1.2, 2.6, 4.6) Reflect on the moral and ethical core of your teaching practice and on the relationship between your moral/ethical core and your identity and life experiences (TPE 6.1) Collaborate with classmates in professional learning communities (PLCs) to analyze and evaluate the complexities of ethical classroom teaching in culturally and linguistically diverse school settings (TPE 6.3)",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231D",
                "title": "Ethical Reflective Practicum in Elementary Schools IV",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum I",
                "description": "This practicum course supports Catholic school credential candidates across each quarter of their placement. The course provides guidance in the assumption of full time teaching responsibilities and features regularly scheduled seminars and speakers. Candidates must meet established benchmarks for the development of academic and professional competence to satisfy course requirements and to earn a recommendation for a multiple or single subject teaching credential. Academic and teaching performance equivalent to a B is required to earn a passing grade. Required of all multiple and single subject candidates taking part in the ExCEL program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum II",
                "description": "This practicum course supports Catholic school credential candidates across each quarter of their placement. The course provides guidance in the assumption of full time teaching responsibilities and features regularly scheduled seminars and speakers. Candidates must meet established benchmarks for the development of academic and professional competence to satisfy course requirements and to earn a recommendation for a multiple or single subject teaching credential. Academic and teaching performance equivalent to a B is required to earn a passing grade. Required of all multiple and single subject candidates taking part in the ExCEL program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum III",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the Catholic schools at the K-12th grade levels. The main focus of the clinical practicum seminar is to support students as they complete their teaching experience. This seminar focuses on the Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom teaching, will provide students the opportunity to discuss instructional strategies and methodologies, as well as challenges and issues in Catholic education.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum IV",
                "description": "This class is the final in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the Catholic schools at the K-12th grade levels. The main focus of the clinical practicum seminar is to support students as they complete their teaching experience. This seminar focuses on the Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom teaching, will provide students the opportunity to discuss instructional strategies and methodologies, as well as challenges and issues in Catholic education.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Summer 2 Ethical Reflective Practicum for Interns I",
                "description": "EDUC 231i - Summer 2 Ethical Reflective Practicum for Interns I",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Fall Ethical Reflective Practicum for Interns II",
                "description": "EDUC 231i - Fall Ethical Reflective Practicum for Interns II",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i-",
                "title": "Ethical Reflective Practicum for Interns III",
                "description": "EDUC 231i- Winter Ethical Reflective Practicum for Interns III",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Ethical Reflective Practicum for Interns IV",
                "description": "EDUC 231i - Ethical Reflective Practicum for Interns IV",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "251",
                "title": "Technology for Elementary Teachers",
                "description": "This course is designed to acquaint teacher credential candidates with learning theories, practices, hardware, software applications, and web resources that are useful in integrating technology into the daily practice of TK-12 teachers. The course meets the requirements identified in the technology standard for teacher preparation for the State of California. The guiding philosophy for the course is Constructivism, instantiated in the design of collaborative, project-based learning activities that capitalize on the full potential of educational technologies. Students will be expected to fully engage in classroom exercises, group projects, and small-group and whole-class discussions on the assigned readings.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "252",
                "title": "Social Foundations of Education",
                "description": "The goal of this course is to examine the historical, social, philosophical, and legal foundations of American education. We explore the impact of these various influences on the current state of education, as well as consider the future of education in a diverse society. This course provides an opportunity to reflect on our roles as educators and the manner in which we will work to improve the educational experience for all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "253",
                "title": "Development & Learning TK-12",
                "description": "Drawing on both developmental and educational psychology, this course examines theories and patterns of learning, development, and individual differences as they relate to teaching practices and educational programs. Students apply theories of cognitive, physical, social/emotional and motivation to learning contexts among children and youth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "257",
                "title": "English Language Development in Elementary Schools",
                "description": "This course is designed to provide knowledge of the linguistic and cultural aspects of developing English language proficiency. Students develop an understanding of the theory and methods of teaching linguistically diverse learners, including models for designated and integrated English language development as well as sheltering strategies to make content more accessible.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "258",
                "title": "Elementary Classroom Management",
                "description": "Research data report that the number one reason teachers leave the classroom is because they cannot manage their students.  In fact failure to control the classroom is synonymous with failure as a teacher. This course will explore the importance of establishing a positive structured learning environment by developing a successful classroom management model that is consistent with the California Standards for the Teaching Profession. Topics will include, but not be limited to, the following: motivation, managing time and physical space, and establishing rules and routines",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "259A",
                "title": "Elementary Mathematics Methods I",
                "description": "EDUC 259 (Elementary Mathematics  Methods) course is Part 1 of a two-course sequence in elementary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in elementary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structure, and conducting clinical interviews on number concepts, we will set the stage for our development as elementary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "259B",
                "title": "Elementary Mathematics Methods II",
                "description": "EDUC 259 (Elementary Mathematics Methods) course is Part 2 of a two-course sequence in elementary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in elementary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through examining classroom culture and structure, and evaluating, designing and implementing math lessons, we will set the stage for our development as elementary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "261",
                "title": "Teaching Reading in the Elementary School",
                "description": "This course enables credential candidates to develop awareness and understanding of current theories and best practices of comprehensive, balanced reading instruction in elementary school settings. Candidates will learn how to adapt instruction to meet the needs of individuals based on their cultural, linguistic, and experiential backgrounds and their specific needs as learners. Focused attention will be given to the nature of reading difficulties and principles of diagnosis and assessment. Content presented in this course prepares candidates for the Reading Instruction Competence Assessment (RICA). This course, required of all multiple subject teaching credential candidates, must be taken concurrently with enrollment in EDUC 266 or a full time teaching position in a Catholic school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "262",
                "title": "Teaching Language Arts in Elementary Schools",
                "description": "A study of language arts teaching strategies, with a focus on teaching writing to students in grades K-8, including English learners and students with special needs. Focused attention is given to techniques for integrating literature and language arts instruction with science and social studies content.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "263",
                "title": "Elementary Methods in S.S. and Visual Performing Arts",
                "description": "In this course, multiple subject credential candidates learn how to design, implement, and evaluate standards-based social science lessons and how to integrate content from the California content standards for visual and performing arts, and the California Common Core. The course emphasizes mastery of instructional strategies that create opportunities for all students, including English learners and students with special needs, to read and write about how to use social studies for social justice and how to incorporate the visual and performing arts as ways to express and visually represent meaningful learning. Topics include working with curriculum frameworks and content standards, developing curriculum units, and planning lessons that maximize the learning of all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "264",
                "title": "Elementary Methods in Science, Health and Physical Education",
                "description": "This course is designed to assist multiple subject credential candidates in developing the skills necessary to design and carry out science, health, and physical education instruction, demonstrations and laboratory experiences for students in elementary and middle school programs. We will build on current research and best practice in order to foster science/health/PE learning in K-8 students. The process of creating content, developing curriculum, and applying standards to generate meaningful lessons are emphasized with an additional area of emphasis being placed on assessment and collaboration. Scientific inquiry, project-based instruction (PBI), Common Core integration, and Next Generation Science Standards (NGSS) will be emphasized along with best practices in the STEM/Health/PE model.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "265",
                "title": "Assessing Elementary Student Learning",
                "description": "This course is designed to help future and current teachers of culturally and linguistically diverse elementary school students to (1) understand, develop, and implement a range of effective, practical strategies for assessing and documenting the academic achievement of their students, including English Learners, students with identified/unidentified exceptionalities, and students eligible for free or reduced price lunch (TPEs 1.1, 2.2, 3.5, 4.4, and 5.1-5.8); (2) develop the skills and habits of mind necessary to use assessment results to plan effective instruction for every student (TPEs 3.5, 4.4, and 5.1-5.8); (3) learn how to present and discuss assessment results with other education professionals and with students’ parents (TPEs 1.2, 2.6, 3.2, 4.5, 5.1-5.8).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "275",
                "title": "Ethics, Diversity, Reflection: Intro to TK-12 Teaching",
                "description": "This intensive five-day course orients credential candidates to the MATTC preliminary teaching credential program and to the teaching profession.  Emphasis is placed on providing opportunities for candidates to learn and to practice the inquiry, thinking, and reflection skills that are the foundation for teachers’ ongoing professional development throughout their careers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230A",
                "title": "Ethical Reflective Practicum in Secondary Schools I",
                "description": "This class is the first in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels. The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience. This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230B",
                "title": "Ethical Reflective Practicum in Secondary Schools II",
                "description": "This class is the second in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230C",
                "title": "Ethical Reflective Practicum in Secondary Schools III",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230D",
                "title": "Ethical Reflective Practicum in Secondary Schools IV",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "275",
                "title": "Ethics, Diversity, Reflection: Intro to TK-12 Teaching",
                "description": "This intensive five-day course orients credential candidates to the MATTC preliminary teaching credential program and to the teaching profession.  Emphasis is placed on providing opportunities for candidates to learn and to practice the inquiry, thinking, and reflection skills that are the foundation for teachers’ ongoing professional development throughout their careers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "276",
                "title": "Technology for Secondary School Teachers",
                "description": "This course is designed to acquaint teacher credential candidates with learning theories, practices, hardware, software applications, and web resources that are useful in integrating technology into the daily practice of TK-12 teachers. The course meets the requirements identified in the technology standard for teacher preparation for the State of California. The guiding philosophy for the course is Constructivism, instantiated in the design of collaborative, project-based learning activities that capitalize on the full potential of educational technologies. Students will be expected to fully engage in classroom exercises, group projects, and small-group and whole-class discussions on the assigned readings.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "277",
                "title": "Social Foundations of Education",
                "description": "The goal of this course is to examine the historical, social, philosophical, and legal foundations of American education. We explore the impact of these various influences on the current state of education, as well as consider the future of education in a diverse society. This course provides an opportunity to reflect on our roles as educators and the manner in which we will work to improve the educational experience for all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "278",
                "title": "Development and Learning TK-12",
                "description": "Drawing on both developmental and educational psychology, this course examines theories and patterns of learning, development, and individual differences as they relate to teaching practices and educational programs. Students apply theories of cognitive, physical, social/emotional and motivation to learning contexts among children and youth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "282",
                "title": "English Language Development in Secondary Schools",
                "description": "This course is designed to provide knowledge of the linguistic and cultural aspects of developing English language proficiency. Students develop an understanding of the theory and methods of teaching linguistically diverse learners, including models for designated and integrated English language development as well as sheltering strategies to make content more accessible.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "283",
                "title": "Secondary Classroom Management",
                "description": "Research data report that the number one reason teachers leave the classroom is because they cannot manage their students.  In fact failure to control the classroom is synonymous with failure as a teacher. This course will explore the importance of establishing a positive structured learning environment by developing a successful classroom management model that is consistent with the California Standards for the Teaching Profession. Topics will include, but not be limited to, the following: motivation, managing time and physical space, and establishing rules and routines.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "285A",
                "title": "Secondary English Methods I",
                "description": "EDUC 285 and EDUC 286 are designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject, Secondary English/World Lang. Methods, effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the EDUC 285 Methods I and EDUC 286 Methods II blocks in the content area aligned with the credential they are seeking.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "285B",
                "title": "Secondary English Methods II",
                "description": "EDUC 285A and EDUC 285B are designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject, Secondary English/World Lang. Methods, effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the EDUC 285A Methods I and EDUC 285B Methods II blocks in the content area aligned with the credential they are seeking.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "286A",
                "title": "World Language Methods",
                "description": "This course is designed to further enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach World Languages to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to World Languages curriculum. All single subject credential candidates are required to take the Methods I and Methods II block in World languages. The course requires concurrent enrollment in EDUC 231C or employment as a full-time teacher in a Private school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "286B",
                "title": "World Language Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach World Languages to all students. Special attention is paid to developing candidates’ ability to utilize standards and instructional strategies to plan, deliver and reflect upon instruction that supports language development. The course also probes the role of cultural and content understanding in the development of instruction. All single subject credential candidates are required to take the Methods I and Methods II block in World languages. The course requires concurrent enrollment in EDUC 231B or employment as a full-time teacher in a Private school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "287A",
                "title": "Math Methods",
                "description": "EDUC 287 (Secondary Math Methods I) course is Part 1 of a two-course sequence in secondary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in secondary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structures, facilitating mathematical discussions, and assessing student work, we will set the stage for our development as secondary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "287B",
                "title": "Math Methods",
                "description": "EDUC 288 (Secondary Math Methods II) course is Part 2 of a two-course sequence in secondary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in secondary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structures, facilitating mathematical discussions, and assessing student work, we will set the stage for our development as secondary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "288A",
                "title": "Secondary Science Methods I",
                "description": "This course introduces the instructional design techniques and strategies for developing effective programs of study for secondary science students. In addition, the course is designed for engagement with the current issues, challenges, and opportunities associated with science teaching and learning at the secondary level, with particular emphasis on the assurance that all students have opportunities to learn the core ideas, practices, and crosscutting concepts (as outlined in state and national standards documents), while leveraging students’ interests, prior knowledge, and lived experiences. Various course activities are designed to explore the following: 1) the relationship between content-specific lesson planning, enactment, and reflection; 2) what it means to teach three-dimensional science content that is aligned to the Next Generation Science Standards and reflects what the profession currently understands about the learning of scientific concepts; 3) rethinking procedural laboratory and textbook activities; and 4) methodologies to foster and maintain a positive scientific classroom climate that incorporates all aspects of science proficiency.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "288B",
                "title": "Secondary Science Methods II",
                "description": "This course continues the work undertaken in EDUC 288A (Secondary Science Methods I) to develop and refine instructional design techniques and strategies for implementing effective programs of study for secondary science students. This course includes a focus on planning an instructional sequence and assessments within a 5-E paradigm for science teaching. In addition, the course will maintain focus on increasing your familiarity with the basics of project-based instruction (PBI); and the Next Generation Science Standards (NGSS) and how these relate to planning lessons and assessments. In addition, the course will continue our engagement with the current issues, challenges, and opportunities associated with science teaching and learning at the secondary level, with particular emphasis on the assurance that all students have opportunities to learn the core ideas, practices, and crosscutting concepts (as outlined in state and national standards documents), while leveraging students’ interests, prior knowledge, and lived experiences. Various course activities will continue to explore the following: 1) the relationship between content-specific lesson planning, enactment, and reflection; 2) what it means to teach three-dimensional science content that is aligned to the Next Generation Science Standards and reflects what the profession currently understands about the learning of scientific concepts; 3) rethinking procedural laboratory and textbook activities; and 4) methodologies to foster and maintain a positive scientific classroom climate that incorporates all aspects of science proficiency. Lastly, this course explores resources available to the science teaching community, including inquiry-based materials for teaching secondary science content for student understanding.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "289A",
                "title": "Social Science Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the Methods I and Methods II block in the content area aligned with the credential they are seeking. Single subject credential candidates in art and music should enroll in the social sciences methods course block.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "289B",
                "title": "Social Science Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the Methods I and Methods II block in the content area aligned with the credential they are seeking. Single subject credential candidates in art and music should enroll in the social sciences methods course block.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "294A",
                "title": "Adolescent Literacy Development I",
                "description": "EDUC294 Adolescent Literacy Development presents research-based principles for effective literacy instruction in secondary school settings. Students will explore theories, major trends, and principles in the field of literacy that render effective instruction for particular purposes and reflective of students’ needs and strengths.  Attention will be given to what, why, when, and how specific components of literacy are taught to promote communicative, reading, and writing competence in linguistically diverse classrooms and for individuals within a broad range of experiential and ability levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "294B",
                "title": "Adolescent Literacy Development II",
                "description": "This first course of the two-course sequence presents research-based principles for effective literacy instruction to support content area learning in secondary school. Students acquire models for integrating reading and academic talk into content area instruction. Attention is given to supporting the literacy and content area learning of English Learners and students with a broad range of experiential and ability levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "296",
                "title": "Assessing Secondary Student Learning",
                "description": "This course is designed to help you understand, integrate, and skillfully apply the principles of assessment. You will be taught how to develop assessments that align well you’re your lesson objectives and provide information about what your students have learned. Overall, this course will help you to understand the principles of assessments, construct valid assessments of student learning, recognize the strengths and limitations of various assessment types, and learn about the legal and ethical implications in the use of assessment data. At the end of this course, you will be able to develop, administer, and score a range of sound formative and summative assessments that will help all your students learn.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "246",
                "title": "Bilingual Seminar (In-Service)",
                "description": "This course is continues discussions about bilingual methods and foundations as well as begins to provide insights into the Latinx language practices and culture. In-Service Bilingual Teacher candidates gather information about the role and place of both languages at their school site, gather evidence as to the cultural and historical context of the Latinx community that they serve as well as sharpen their bilingual methodologies.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "247",
                "title": "Latinx Language and Culture",
                "description": "This course is designed to enable students to develop an awareness and understanding of the traditions, roles, status, and communication patterns of Latinx as practiced in the United States and their country of origin. Students will acquire skills to discern patterns of cultural relationships among Latinx in the US and CA. Students will also acquire understandings of the historical, political, economic, religious, and educational factors that impact the acculturation of Latinx in the US and CA. An emphasis will be to view Latinx countries’ of origin various factors (demographic, language use, immigration patterns) and how these impact settlement in CA.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "248B",
                "title": "Bilingual Foundations",
                "description": "This course is designed to enable students to develop an awareness and understanding of foundational issues of Bilingual Education and bilingualism. Students learn about the legal and legislative foundations of bilingual education in the United States. Histories and policies that have shaped bilingual education in the US is also a focus of the course. Students learn to apply knowledge of cognitive effects of bilingualism and biliteracy to instructional plans. Tenets of bilingualism are reviewed, including the Common Underlying Proficiency construct to understand transferability of skills, understandings and strategies from primary to target language. Students develop skills to promote authentic parent participation to ensure parents are viewed as a critical resource toward ensuring strong bilingualism and biliteracy development.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "249B",
                "title": "Bilingual Methods",
                "description": "This course focuses on the methodology of instructing students in Spanish and English in K-12 settings. The course addresses issues related to content scaffolding, biliteracy development and assessment of emergent bilinguals. Focused attention is given to first and second language development, including the interrelationship among reading, writing speaking and talking and the linguistic structure of both the English and Spanish language. Students also develop an understanding of the historical policies, program type and understanding of the diverse types of bilingual programs in the US. This course is required of all Bilingual MATTC candidates and must be taken concurrently with enrollment in EDUC 266b or a full time teaching position in a bilingual Catholic school. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "360",
                "title": "Organizational Leadership",
                "description": "CATE Objectives, including theories and concepts of leadership and their relationship to theory and practice. Understand and develop skills and strategies within the context of contemporary issues which include sustainable schools, student centered vision, use of data and sound teaching and learning for all students. Understanding skills to align the school vision with the local diocese or LEA. Develop skills and strategies for employee accountability, professional ethics and adapt personal skills needed for leadership and administration.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "361",
                "title": "Instructional Leadership",
                "description": "This course will focus on TK-12 CAPE content standards and their implications for the development of curriculum and instruction. This includes the use of assessments, teaching strategies and the appropriate blend of technology for teacher and students at all grade levels. There will be comprehensive demonstrations of best practices for instruction which will be modeled and discussed throughout this course. Students will understand the professional standards for implementing learning objectives which are meaningful, measurable and appropriate for grade levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "362",
                "title": "Organizational Behavior",
                "description": "The course includes topics such as the improvement of educational institutions and other organizations as a result of improving management practices; avoiding old mistakes and facing problems and challenges associated with a changing, culturally diverse school population with confidence are considered. Discussions include goal setting and the role of the individual and institutions. Topics include government intervention in education, legislation, regulation and policymaking. The organization as a target of legislative reform is discussed. Solving problems before they become unsolvable and strategies for improving management are considered (from SECP Graduate Bulletin, 2016, p. 98).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "363",
                "title": "Organizational Governance and Law",
                "description": "This course is part of the Educational Leadership sequence of study. The focus of this course is the examination of the issues of education, law and morality and ways in which the law, by its very nature, cannot be separated from ethics and morality. Theories of law and of the relationship between law and other social and ethical values are reviewed. The ability of leaders to have a better understanding of the law and the politics associated with governance and the ability to assist people to work through moral dilemmas associated with the law are considered. Cross-cultural communications, desegregation and discrimination, credentialing laws, assignment authorization, and schools as a political system are also examined.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "364",
                "title": "Leadership Field Lab - Educational Leadership Practicum",
                "description": "This course is the first of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around weekly reflection and skill building, monthly seminars, and culminates in a field project and candidate evaluation. The candidate develops interpersonal and leadership skills in developing and leading the organization’s vision given the complex realities, multiple constituencies, and challenging interactions of the site. The candidate develops skills in shared leadership and change management and applies this to a site. The candidate coordinates organizational, legal, and ethical dimensions of leadership. This field lab extends and applies knowledge and skills developed in EDUC 360, 362, 363, and 428, and is ordinarily completed in the same program year as these courses. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "365",
                "title": "Human Resource Development",
                "description": "This course is part of the Educational Leadership sequence of study. It is intended to provide students with an introduction to the principles of human resource development and an overview of various supervision, evaluation, and leadership tools and strategies to support the cultivation of the people who make organizations work. Students will read empirical and conceptual works as well as a foundational guide for practitioners to anchor reflection and experiential learning related to managing human resources and organizational growth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "366",
                "title": "Community Leadership and Public Relations",
                "description": "Exploring Community and Public Relations through the lens of visionary thinking and creative business strategies.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "367",
                "title": "Contextual Field Lab – Educational Leadership Practicum",
                "description": "EDUC 367, Contextual Field Lab, is the second of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around weekly reflections, skill building, consulting with a supervisor and culminates in a field project with candidate evaluation. The candidate develops skill in the design, collection, and use of data for decision making and program improvement in the context of relevant professional standards and outcomes.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "368",
                "title": "Program Evaluation",
                "description": "This course is part of the Educational Leadership sequence of study. It is intended to provide students with an introduction to program evaluation and the principles of assessment; it includes an overview of various assessment tools and strategies with a focus on data analysis and the use of evidence in decision-making. Students will read empirical and conceptual works as well as a foundational guide for practitioners to anchor reflection and experiential learning related to the principles of assessment and school improvement. The relevance and application of these principles for instructional leadership is explored, with an emphasis on the continuous school improvement framework in lieu of compliance-oriented reform. Students have the opportunity to gather comparative information through a well-designed process of assessment, analysis, and evaluation. Evidence and results will be analyzed within the appropriate context to determine judgment, size, and worth. Students will grapple with common misconceptions in assessment and the challenges, limitations, and possibilities that assessment holds for school improvement.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "369",
                "title": "Action Research and Research Methods",
                "description": "The course focuses on a spectrum of activities that focus on research, planning, theorizing, learning, and development in the resolution of a problem or problems. An understanding of the qualitative research principles, the dynamics associated with diversity and change and the need to study problems that are relevant in real settings while systematically inquiring, making hypotheses and testing these hypotheses; use as a vehicle for empowering teachers and learners. Approaches to scholarly inquiry. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "370",
                "title": "Field Lab-Community, Diversity and Technology",
                "description": "This course is the first of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around reflection and skill building, monthly seminars, and culminates in a field project and candidate evaluation. The candidate develops skills in the full range of leadership and management skills for forming sustainable organizations that serve their intended communities. The field lab focuses on effective management of technology, as well as finances, facilities and fundraising. This includes budgeting, financial reporting and meeting legal reporting requirements. The candidate engages in both learning from and serving the organizations and community stakeholders. This lab extends and applies knowledge and skills developed in previous courses taken in during the degree program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "371",
                "title": "Program Interventions",
                "description": "The purpose of the Program Interventions course is for students to develop the knowledge and skills necessary to evaluate and select appropriate interventions to build a culture of inclusion within school and other environments. The emphasis is on effective, efficient, and socially valid models of intervention, primarily through Multi-Tiered Systems of Support. The course develops an understanding of program evaluation measures, and requires students to be able to demonstrate this knowledge for purposes of making data based decisions to develop intervention plans for a variety of learners including students with disabilities and other special concerns such as youth from foster, immigrant and migrant families, students who are at risk and students from language diverse communities. Synchronous and asynchronous class activities provide practice in the use of relevant interventions designed to effect continuous improvement in schools and other organizations. The course focuses on the role of educational leaders in serving students and building inclusive school communities and other organizations.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "374",
                "title": "Organizational Culture and Change",
                "description": "This course explores current issues with regard to organizational culture and change. Topics to be explored include how organizational culture influences such things as making staffing decisions, using data driven professional development, understanding the barriers to organizational reform, managing and changing culture, understanding governance structures for public and private schools and other organizations, and creating principles of equity, diversity, inclusivity, accountability as well as researching future educational visions.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "376",
                "title": "Technology to Enhance Leadership",
                "description": "This course enables the educational leader to develop the ability to make informed decisions about appropriate technologies for school use, understand the importance and role of multimedia technologies for instructional support, administrative decision-making, and management of data in schools. It further helps the administrator to use computers and other technologies in the performance of their responsibilities, and to define, develop, and demonstrate standards of ethics for technology and the use of technology in the schools.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "391",
                "title": "Ethics in Education",
                "description": "The course examines the roles educators play in the moral education of students, and the formation of ethical school communities and agencies. Educational ethics invites educators to consider the roles, stakeholders, issues, and methods useful for applied ethics in the schools. Discussion focuses on major ethical theories and principles Students develop a method for making ethical decisions involving administration, faculty, and student life, while considering realistic ethical problems. The course includes investigations into controversial ethical issues and dilemmas to prepare educators to critically think through potential situations that may arise with students, parents, administrators, and peers. [3 units]",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "400A,",
                "title": "and 407 - Calif. Professional Standards for Educational Leaders",
                "description": "These three graduate courses form an integrated body of a two-year study and support of candidates who wish to obtain a “clear” induction administrative credential to work in California schools. These three courses are treated as one set of courses to introduce and develop students to gain competence in the concepts, skills and specific tools by which to effectively and pragmatically lead schools as organizations, with the primary focus on developing and demonstrating competence in each of the six California Professional Standards for Educational Leaders (CPSEL). These courses must total at least 14 units. The individual nature of the course structure supports those in public standard schools, public charter schools, and private schools, both those with a religious focus and those that are public, secular (not religious) schools",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "428",
                "title": "Management",
                "description": "Financial Management is an introduction to resource allocation, management, and reporting in schools, churches and nonprofit institutions. The course focuses on the budget process, nonprofit and government accounting and finance, information technology, and property management. The course then considers school funding models, site planning, as well as reporting and other requirements. School business management is situated in the economics of the school enterprise, explores the role of innovation and entrepreneurship, and applies these concepts to the development of business models and plans. The course is generally concerned with: the macroeconomics of schools in society; resource allocation, funding, and reporting; the microeconomics of school planning and management; the budget process; financial statements; government funding, controls, and accounting standards; nonprofit accounting.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "429",
                "title": "Perspectives",
                "description": "School leaders are constantly faced with pressing social justice issues that impact the school community and raise ethical and social dilemmas. It is imperative that future school leaders develop a foundation of knowledge that enables them to comprehensively respond to issues of social justice issues and social change. The course will address personal leadership styles, organizational leadership, and issues of social justice, educational equity, leading for change. In short, this course will explore how one’s leadership style impacts leading for change. The primary goal for this class is to explore yourself as a leader, to engage in dialogue, and motivate students to express their opinions on said issues. Students will be asked to examine their personal and professional commitment to ethics, diversity, social justice and human dignity. Students will leave this class having formed clear concepts of their leadership tendencies, with formed opinions on how the importance of equity and social justice are a fundamental part of a school climate and culture.",
                "units": ""
            }
        ],
        "abbr": [
            "EDUC"
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "School of Education and Counseling Psychology",
        "department": "",
        "courses": [
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "200",
                "title": "Psychology of Interpersonal Communications",
                "description": "The foundation course for all CPSY programs, this course provides a laboratory setting in which students master basic skill sets that are fundamental for effective communication, advanced counseling and therapy. Among the basic skills essential to counseling psychology are the cultivation of attention, learning to ask questions, paraphrasing and encouraging, reflecting feeling and meaning, confrontation and empathy. The course allows students the opportunity to create, discover and/or examine and expand their personal counseling style through deep investigation of both self and the professional literature. A primary focus is on being more conscious and intentional in interpersonal communication and subsequently in the counseling process. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "205",
                "title": "Community Based Learning",
                "description": "This course is designed on a community based learning model and is intended to expose students to a variety of social issues that affect individuals and families of low socioeconomic status:poverty, deprivation, inadequate housing, access to health care, access to education, and other salient issues. A variety of sites, schools, community pantries, homeless shelters, soup kitchens, etc. are available for the student to choose. The student is expected to assist in these sites as they are asked. This is not a therapy based practicum and students do not provide any counseling services. Students are expected to participate in their site for 4 hours per week and attend a 90 minute weekly reflection period. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "211",
                "title": "Human Sexuality",
                "description": "This course provides information and perspective to future therapists regarding biological, developmental, behavioral, emotional, and cultural aspects of human sexuality. It is principally clinical in focus: reading materials, classroom experiences and discussions are used to augment students' knowledge of human sexual functioning, both potential and problematic, and to expand students' comfort with their future role as therapists to couples and individuals. Prerequisite: 200 and (212 or 216). (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "211A",
                "title": "Sex Addiction",
                "description": "This class will provide participants with information to understand and diagnose sexual addiction and sexual anorexia, knowledge of assessment tools, as well as the ability to develop treatment plans that provide interventions in all phases of recovery. Case illustrations, formal presentations, and interactive exercises will be used to illuminate issues pertaining to the etiology and treatment of problematic sexual attitudes and behaviors. Prerequisite: 200, 212 or 216. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "212",
                "title": "Psychology of Relationships",
                "description": "The focus of this course is relationships: how human beings develop as relational beings; how they orient toward themselves and toward others in relationship; how they orient in the therapeutic relationship; how their relational templates may be the focus of therapeutic intervention. Study is focused on the formation and dynamics of interpersonal relationships in the individual, family, and couples. Study also includes traditional and nontraditional relationships. Prerequisite: 200 or 216.",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "213",
                "title": "Foundations of LGBT Psychology",
                "description": "This course provide counseling psychology students with an opportunity to familiarize themselves with issues like to be encountered when working with LGBT clients. Students will confront their own beliefs and feelings about same sex relationships and how these might affect their clinical work. Teaching methodology will include lecture, readings and discussions, case studies, experiential exercises, testimonies of LGBT persons, and films. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "214",
                "title": "Evidence-Based Approaches to Psychotherapy",
                "description": "This course focuses on research and clinical technique related to evidence-based practice in psychotherapy. It includes instruction on methodology, analysis, and synthesis of research on the efficacy and outcomes of psychotherapy interventions, as well as training in evidence-based counseling techniques from a variety of theoretical perspectives, including cognitive, behavioral, person-centered, and psychodynamic. Students gain an understanding of how research can inform what techniques to practice in the therapy encounter and how those techniques should be implemented with a variety of disorders and psychosocial issues. NOTE: Students who have taken this course should not enroll in CPSY 224. Prerequisites: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "215",
                "title": "Psychology of Childhood",
                "description": "Explores the psychological world of the child from infancy through adolescence from a developmental perspective with a particular focus on attachment/object relations theory. Examines processes associated with healthy psychosocial adjustment, case conceptualization and treatment approaches. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "216",
                "title": "Psychology of Human Development",
                "description": "A developmental approach to the entire human life cycle from childhood through old age, with focus on significant transitions and passages. Includes coping with change in the personal, social, and transpersonal domains and how it has an impact on human growth and development. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "218",
                "title": "Foundations of Psychotherapy and Personality",
                "description": "A comprehensive review of fundamental concepts in personality theories and their applications to counseling and psychopathology, with special focus on explicating the relationship between theory and practice. Key elements, concepts, and techniques associated with major theories of counseling are examined; identifying the strengths and limitations of each of the major theories, as well as commonalities and divergences among them. The course will help students formulate an initial personal theory of counseling from which to build as they evolve through the program. Exploration of Psychoanalytic, Humanistic, Cognitive, Behavioral, Systems and multi-cultural theory and technique are among the course foci. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "219",
                "title": "Psychology of Group Counseling",
                "description": "Introduction to small-group dynamics. Techniques of small-group leadership and experiential involvement in group process. The phases of natural group development and ethical, professional leadership are examined. Primary focus is on process-oriented, especially closed-ended groups. Lab group required concurrently or prior. Prerequisites: 200 and 218; pre-requisite or co-requisite: 220; 221 are strongly recommended. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "219A",
                "title": "Psychology of Group Counseling Lab Group",
                "description": "This lab is an experiential application of the theories and principles learned in 219. Must be taken prior to or concurrently with 219; Prerequisites: 200 and 218; 220 strongly recommended. (0 units)",
                "units": "0 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "220",
                "title": "Research Methods",
                "description": "Fundamentals of research and statistics in analyzing research in counseling and psychotherapy. Emphasis on the review, evaluation and interpretation of research literature, particularly in the areas of child development and counseling, and marital and family therapy. Discussion of formulations of research proposals and theses. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "221",
                "title": "Group Counseling Lab",
                "description": "This lab is an experiential application of the theories and principles learned in 219. This lab is taken prior to or concurrently with 219. Prerequisites: 200 and 218; 220 strongly recommended. Note: 78 Unit LPCC and LPCC/MFT combined track students. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "222",
                "title": "Advanced Group Counseling Seminar",
                "description": "This seminar is for students who completed 219A and are seeking to supplement their understanding and knowledge of group therapy. Prerequisites: 219A.Requirements: 78 Unit LPCC and MFT/LPCC combined Track students only. NOTE: This seminar will only be offered 1 time in 2012 and 2013 and then be discontinued. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "227",
                "title": "Counseling Process and Skills",
                "description": "Intensive focus on the development of individual counseling skills through readings, discussion, experiential exercises, and feedback on skill development. Reviews of videotaped interviews enhance self-observation skills and understanding of therapeutic process. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "228",
                "title": "Advanced Counseling Process and Skills",
                "description": "An intensive skill-building class presenting an integrative model of individual therapy. Theory and interventions are based on process experiential (Emotion-Focused Therapy) and interpersonal (Time-Limited Dynamic, Control Mastery) approaches. The class offers students opportunities to (a) learn and practice strategies and techniques for working with process dimensions of therapy, (b) learn a wide range of therapy markers and the specific interventions recommended for each of them, (c) gain experience as counselors in supervised therapy mini-sessions, (d) practice advanced therapy skills during class, and (e) receive extensive feedback on their counseling skills. The class is particularly useful for students just before or during their practicum experience. Prerequisites: 200, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "230",
                "title": "Psychotherapy with Lesbian, Gay, and Bisexual Clients",
                "description": "The focus of this course is the development of clinical skills and interventions to work with issues presented by lesbian, gay, and bisexual clients. Therapeutic concerns of individuals, couples and families will be explored through readings, discussions, experiential exercises, and feedback on skill development. Prerequisite: 213. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "231",
                "title": "Multicultural Counseling",
                "description": "This class addresses the evaluation of the various models of psychotherapy as they relate to diverse populations and the influence of the mores and values of various ethnically and culturally diverse populations upon the counseling process. Within-group differences associated with culture, acculturation, and identity development are explored in depth. Self-exploration of racial/ethnic perceptions, attitudes, and experiences, as well as perceptions of gender, privilege, SES, class, and other issues. Review and evaluation of contemporary examples of multicultural research. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "243",
                "title": "Delinquent, At-Risk, and Nonconventional Youth: Trauma and Effects",
                "description": "Concepts and characteristics of child and adolescent delinquency, including the effects of trauma, violence and abuse; gangs; substance abuse;teenage parenthood; and dropout, anti-social, and nonconventional behavior. Introduction to the treatment of these issues, including correctional education, special education, juvenile justice, and social welfare systems as well as effective practices for counselors, including crisis, safety, and weapons management among others. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "244",
                "title": "Correctional Psychology",
                "description": "Principles and procedures of correctional psychology and correctional education, including current research on best practices. Discussion of pro-social development and skills, functional assessment and curriculum, correctional psychology, criminal justice, vocational programs, aggression reduction, prejudice reduction, life skills training, comprehensive systems, and treatment planning. Examination of therapeutic approaches and model programs. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "245",
                "title": "Transitional Treatment and Vocational Planning",
                "description": "Program planning, treatment planning, effective transitions, and vocational planning for delinquent, at-risk, and nonconventional youth. Coordinating planning, existing processes (IEP, IFSP, ILP, ITP), and promoting future success. Functional assessment and intervention, program identification, placement, and support. Vocational education programs, training options, assessment, and instruments. Job development, recruiting, placement, and support. Impact of disability, criminality, lifestyle, and cognitive distortion. Thinking processes, distortions, and retraining. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "246",
                "title": "Applied Behavior Analysis in Correctional Psychology",
                "description": "Principles and procedures of applied behavior analysis with applications to the correctional setting. Strategies for managing behavior problems. Assessment, documentation, and intervention for disruptive, aggressive, antisocial, and self-injurious behaviors. Primary emphasis on behavioral therapies with antisocial persons. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "264",
                "title": "Object-Relations Therapy",
                "description": "An introduction to the central ideas and processes involved in the object-relations approach to psychotherapy. Critical concepts such as projective identification, transference/countertransference, the holding environment, internal objects, transitional phenomena, the therapeutic matrix, etc. are explored and practiced. Readings from the British school (Klein, Winnicott) and American (Ogden) are blended with clinical practice and discussion. Prerequisites: 200, 212, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "265",
                "title": "Cognitive Behavior Therapy",
                "description": "This course provides a \"hands-on\" approach to understanding the basic tenets of cognitive behavioral therapy (CBT). Beginning with a comprehensive review of the fundamental concepts and research supporting CBT, students will learn about and practice cognitive behavioral therapy through didactic lectures, experiential learning, readings, group discussion, videos, and role plays. A primary focus in this class is practical applications of CBT, including relaxation training, activity scheduling, and development of treatment plans for diverse populations. Prerequisites: 200, 218; 214 recommended. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "266",
                "title": "Counseling the Adolescent",
                "description": "The adolescent as studied from developmental, sociological, and psychological perspectives, with special emphasis on counseling strategies and action techniques appropriate to this critical transition age. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "275",
                "title": "Ethical and Legal Issues in Counseling",
                "description": "Study of professional, legal, and ethical issues that emerge in marriage and family counseling, psychotherapy, and private practice; understanding values as a method of critical thinking and behavioral analysis. Students confront such issues as confidentiality, clients' rights, mediation, as well as child, spousal/partner, and elder abuse. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "276",
                "title": "Professional Orientation, Ethics, and Law in Counseling",
                "description": "Study of licensing law and process, regulatory laws that delineate the profession's scope of practice, strategies for collaboration, and advocacy processes needed to address institutional and social barriers that impede access, equity, and success for clients. Prerequisites: 200, 218, 275. (1.5 units).",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "280",
                "title": "Psychology of Aging and the Family",
                "description": "An overview of the research on adult development, with an emphasis on large-sample longitudinal studies. Concepts and definitions of adulthood are explored. Primary emphasis is on the clinical utility and integration of stages of adulthood and both their empirical parameters and those presented in the world's great mythologies and contemplative traditions. Focus on identification and assistance with the transitional challenges of middle and late adulthood. Finally, theories of aging and issues that concern the elderly; dynamics and complexity of intergenerational families; social responses to aging and concerns of the extended family are integrated into practical counseling models for individual, family, and group therapy. Prerequisite: 200 and 216. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "282",
                "title": "Gestalt Therapy for Individuals and Couples",
                "description": "The theory and techniques of Fritz Perls and the Gestalt school. Emphasis on applications to family, individual, and couple counseling. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "288",
                "title": "Existential Psychotherapy",
                "description": "Among the major theories of psychotherapy, Existential Psychotherapy holds a place that both blends with other approaches and stands distinctly apart. Focused on the personal experience of meaning, this form of psychotherapy explores the inner world as the client creates it. Beginning with the thinking of Viktor Frankl, the course focuses primarily on the American approaches to existential therapy. Constructs employed include the centrality of choice, the tension between the fear of the unknown (freedom) and the stagnation of the status quo (security), the salience of the here-and-now experience of self and the therapist use of self. Although a theory class, significant portions of the class are clinical and pragmatic; exploring existential psychotherapy in film, demonstration and experimentation. Prerequisites: 15 units including CPSY 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "291",
                "title": "Counseling for Grief, Loss and Trauma",
                "description": "Explores psychological issues and skills in counseling people coping with loss, grief, and life-threatening illness, and other traumatic circumstances. Topics include: current theory and research on coping with and resilience to grief, loss, and trauma; assessment and therapeutic interventions with individuals and families; cultural and spiritual dimensions; the evolving philosophy and practice of hospice and palliative care; stress management for the therapist. The applicability of these concepts and skills to everyday psychotherapy practice is emphasized. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "298",
                "title": "Psychology and Spirituality",
                "description": "A comparative study of various Eastern and Western themes and schools of spirituality. In-depth exploration of the implications and relationship of these views to counseling psychology. The nature of the human person and criteria for assessing a person's spiritual-psychological health and growth; stages of development; teachings on how to guide or work with another; and views on such themes as authentic love, humility, guilt, and discernment. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "300",
                "title": "Career Development and Life Planning",
                "description": "Overview of the career development field, focusing on current career development and decision theory. Applications of theory across various settings (industry, clinics, schools, rehabilitation, etc.). Exploration of changing concepts of work and career. Examination of the meaning and spirituality of work, and of \"calling,\" conscious life planning and lifestyle choices. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "302",
                "title": "Formal and Informal Assessment in Career Development",
                "description": "Familiarity with, and use of, current career assessment instrumentation. Evaluation of leading instruments; selection criteria governing use of instruments according to client needs. Interpretation of individual and group assessment data. Practice in completing the career counseling interview, including appropriate assessment and interpretation. Course includes an approved, individualized, formal career assessment to be completed either prior to or concurrent with 302. Prerequisite: 300. Recommended: 318. (3 units)Note: Required for 90 unit LPCC or LPCC/MFT Track only.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "307",
                "title": "Career Counseling Seminar",
                "description": "This course examines special issues in career counseling with special attention on working with multicultural populations, disabled populations, and the Americans with Disability Act. Requirements: 78 Unit LPCC Track students only; Prerequisites: 300. (1.5 units) This course will be discontinued after Spring of 2014.",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "308",
                "title": "Counseling for Crises, Emergencies, and Disasters",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "309",
                "title": "Treating Complex Trauma: Theory and Practice",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "310",
                "title": "Independent Study",
                "description": "Supervised course of study initiated by the student. A written proposal and course syllabus must be submitted to the Graduate Services Office by the end of the first week of the term in which the course will be conducted. The proposal must be approved with signatures from the faculty member of record and the Department Chair.NOTE: Only Full-time faculty members may direct an independent study. (1-6 units)",
                "units": "1-6 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "311",
                "title": "Psychology of Marriage Counseling",
                "description": "Introduction to methods, theories, and techniques of premarital, marital, sexual, and divorce counseling. Initial focus is on normal relational development, followed by characteristic methods of intervention with relationship difficulties in a primary dyadic relationship. Couple relationships within the cultures most common in California are explored and integrated with the more generic foci. This class includes considerable media and experiential components. Prerequisites: 200, 212, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "312",
                "title": "Counseling for Contemporary Problems I",
                "description": "Research, assessment, crisis intervention, and counseling methodology used in addressing the problems of child abuse, domestic violence, substance abuse and addiction. Provides an overview of the psychosocial factors and dynamics involved in the etiology and maintenance of these problems. Describes specific skills and interventions and related considerations used in dealing with clients, their families, and involved community agencies and resources. Prerequisites:227. (3 units) NOTE: This course will be discontinued after Winter quarter 2014.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "313",
                "title": "Contemporary Issues in Psychotherapy II",
                "description": "This course examines special issues related to psychotherapy, including diagnosing and reporting child abuse, spousal abuse, elder abuse, and abuse of the disabled, as well as crises and trauma management and interventions. Prerequisites: 227. (3 units)NOTE: 78 unit degree: LPCC and MFT/LPCC Combined Track students only. 90 unit degree: All students. Students taking this course are exempt from 312A, but must take 15 hours of CEU's in Substance Abuse through CPD. This course will be discontinued after Spring of 2014.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "315",
                "title": "Family Therapy",
                "description": "Introduction to systems theory (e.g., Structural, Bowenian, Strategic) and procedures appropriate to working with families. Opportunity to practice counseling with simulated families. Prerequisites: 200, 212, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "317",
                "title": "Therapeutic Interventions with Children",
                "description": "A broad range of therapeutic interventions with children and families are presented, with a particular focus on play therapy. Case conceptualization, diagnostic formulation, and issues related to treatment planning are addressed. The influence of class, culture and ethnicity on the assessment/treatment process is explored. Prerequisite: 200, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "318",
                "title": "Clinical Assessment I",
                "description": "Study of the therapeutic decision-making process in the context of psychopathology and the clinical setting. Emphasis on the recognition, classification, and understanding of abnormal behavior. Traditional DSM diagnostic categories are studied, including mood disorders, anxiety disorders, psychosis, affective disorders, psycho­physchological disorders, and other abnormal lifestyle patterns. Prerequisites: 200, 212, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "319",
                "title": "Clinical Assessment II",
                "description": "Emphasis on diagnosis and clinical judgment, including such issues as type of impairment, degree of impairment, predictability, and treatment plan, as well as sources of error judgment and how these errors are minimized. The use of individual, couple, and family assessment techniques, projective tests, personality inventories, and other instruments in a professional setting. Prerequisites: 318. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "320",
                "title": "Substance Abuse Treatment",
                "description": "This class focuses on substances that are abused, the effect on the abuser, and treatment strategies in both individual and group psychotherapy modalities. Included are various clinical approaches to treatment; coordination of treatment with 12‐step programs; co‐occurrence of substance use with other disorders; understanding the stages of recovery; and working with adolescents. (3 units)Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "321",
                "title": "Dual Diagnosis: Diagnosis and Treatment",
                "description": "This class covers the complexities and interactions in the diagnosing and treatment of Axis I and Axis II disorders in the presence of substance abuse. Prerequisite: None. (1.5 Units)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "323",
                "title": "Psychopharmacology",
                "description": "This is an introductory course designed for those without biological or medical training to provide a firm basis in practical neurophysiology and psychopharmacology. Course foci include the structure and functions of the nervous system, interactions of other organ systems, principles of pharmacodynamics and pharmacokinetics. The material is presented from a clinical orientation with illustrative case examples. Boundaries of practice and practical issues of assessment and referral are covered in depth. Prerequisites: 216, 218, 318. Can be taken concurrently with practicum. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "324",
                "title": "Biological Basis for Development",
                "description": "This course examines the biological basis for neonatal to early childhood development and behavior. Emphasis is placed on an understanding of the positive and negative effects of environment on early brain development and their sequalae in later life, including development and behavior in adolescence, adulthood and old age. Prerequisites: 216 and 218.NOTE: This course was previously listed as 223. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "328",
                "title": "Clinical Assessment: Issues in Child Diagnosis",
                "description": "Study of diagnostic issues in working with pediatric psychiatric disorders. Emphasis on DSM diagnostic criteria and interviewing children, parents, and families. Special attention to developmental disorders affecting later stages of maturation. Requirements: 78 Unit LPCC and MFT/LPCC Combined Track students and all 90 Unit students. Prerequisites: 200, 212, 216, 218, and 318. (1.5 units)NOTE: This course was previously numbered 318A.",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331A",
                "title": "Counseling Practicum: Agency",
                "description": "Supervised counseling experiences in community services such as juvenile probation, mental health, community colleges, etc. To be taken in the second half of the counseling program, after completion of the counseling core. Weekly seminars for consultation and discussion with a supervisor on such topics as case management and evaluation, referral procedures, ethical practices, professional and client interaction, confidential communication, and inter-professional ethical considerations. By permission only; must begin in fall quarter. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331A is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes; 311, 315, 317, and 318. (3 units per term; 6 units required)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331C",
                "title": "Counseling Practicum: Career Development",
                "description": "To culminate their emphasis program, students spend 15 hours per week engaged in supervised career development-related fieldwork at a practicum site. By permission only; must begin in fall quarter. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331C is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes; 300, 301, 302, 303, and 304. (3 units) NOTE: This practicum will be discontinued after Spring 2013.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331H",
                "title": "Counseling Practicum: Health Psychology",
                "description": "Counseling experience in health psychology. At a practicum site, students engage in health psychology-related work (e.g., research, counseling, health promotion). By permission; fall quarter only. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331H is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes and permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331L",
                "title": "Counseling Practicum: Latino/a Counseling",
                "description": "At a practicum site, students engage in Latino/ counseling-related work. By permission; fall quarter only. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331L is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes and permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "332",
                "title": "Psychotherapy with Transgender and Non-binary Clients",
                "description": "In this course, students will develop clinical skills to work effectively with Transgender/Gender Nonconforming, Intersex, Genderqueer clients, and with others exploring alternative expressions of gender and sexuality. Readings, discussions, experiential exercises, case studies, and feedback on skill development will be components of this class. Prerequisite: 213. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "333",
                "title": "Counseling Practicum",
                "description": "Supervised counseling experience designed specifically to meet California MFT and LPCC licensing requirements. Weekly seminars for consultation and discussion with a licensed supervisor on such topics as case management and evaluation, systems of care, community resources, advocacy issues, referral procedures, ethical practices, professional and client interaction, confidential communication, and documentation, among other issues. Prerequisites: Nine core classes; 311, 315, 317, 318, 319, and permission of instructor. Must begin in fall quarter. (3 units per term; 9 units required)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "351",
                "title": "Advanced Seminar in Family Therapy",
                "description": "For students who have completed CPSY 312, 315, and 317 and wish to participate in advanced training in brief family therapy. Students will receive intensive training in conducting strength-based parent counseling (C.A.R.E. Parent Therapy). In addition, students will have the opportunity to conduct brief counseling with a parent(s) at a local community clinic. Recommended for students interested in family and child therapy, and short term approaches to treatment. Prerequisites: 218, 315. Recommended: 215 or 317. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "352",
                "title": "Gender and Counseling Psychology",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "360",
                "title": "Latino/a Psychology",
                "description": "Designed to enhance the knowledge and skill components of their multicultural training (CSPY 231), with a specific focus on Latino/a cultures. An overview is offered of the Latinx experience within a socio-political and psycho-social context, and implications for therapeutic interventions are explored. Topics covered include: culture and personality, acculturation and ethnic self-identification, gender role socialization, influence of family and other systems, educational achievement, religion and spirituality, traditional healing practices, immigration and diversity within the Latinx population. Prerequisite: 231. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "361",
                "title": "Special Topics in Multicultural Psychotherapy",
                "description": "This course examines the special topic in multicultural counseling.NOTE: 78 Unit LPCC and MFT/LPCC combined track students and all 90 Unit students",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "362",
                "title": "Individual Counseling Skills with Latino/a Clients",
                "description": "Development of counseling skills within a cultural context. An examination is provided of how the counseling process is affected by cultural dynamics and counselor/client variables. Students will learn how to use cultural variables to help develop empathy and a strong working alliance with Latino/a clients. Discussion, demonstration and application of various therapeutic and treatment approaches. Feedback and supervision provided for specific skill development. Prerequisite: 200. Recommended: 231. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "364",
                "title": "Interventions with Latino/a Families and Children",
                "description": "Offers specific information on \"therapy techniques\" with Latino/a family members. The importance of setting for the \"therapy\" is examined. An enhanced understanding is proffered of common experiences Latino families have with various systems of care including schools, hospitals, community mental health agencies, and social service agencies. Within this framework, applied therapy techniques for children and families are examined. A strength-based, systems approach will be used to guide our discussions. Prerequisite: 200. Recommended: 231 and 360. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "366",
                "title": "Spanish-Based Interviewing and Assessment",
                "description": "Course conducted completely in Spanish. Emphasis will be placed on conducting client interviews, assessments, making recommendations, and providing instructions in Spanish. Use of advanced-level Spanish in job/field-related language contexts. Discussion of field-related articles and theories. Prerequisite: 200 and fluency in Spanish. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "380",
                "title": "Positive Psychology and Health",
                "description": "Introduction to \"Positive Psychology and Health,\" the empirical study of what leads humans to develop and flourish. Introduces theory, research and applications, exploring the implications of positive psychology for our understanding of health and illness. Topics include: What is health? Wholeness? Wellness? What makes people happy? How do you help people not merely survive, but thrive? How do we foster stress-related growth? What is the role of spirituality in health? What are positive psychological interventions? Students are encouraged to think critically about what it means to be healthy, and to reflect on personal experiences related to health and illness. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "381",
                "title": "Health Psychology: Theory and Practice",
                "description": "Introduction to health psychology theory, research, and practice, with a special focus on health promotion and health behavior change. Topics include: models of health and illness; biopsychosocial factors in illness; personality, health, and coping; social support and health; health assessment; models and strategies for health behavior change, including Prochaska's stage model and motivational interviewing; issues and preventions with specific health behaviors; and health promotion in the workplace and other settings. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "385",
                "title": "Stress and Stress Management",
                "description": "Introduction to conceptual models of chronic stress in home, work, and community environments. Particular attention to methods and programs to assess, as well as alter, chronic stress. Emphasis is placed on the bio/psycho/ social factors in the etiology, maintenance, and modification of stress. Intervention methods are demonstrated and practiced. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "388",
                "title": "Mindfulness and Psychotherapy: Theory, Research and Practice",
                "description": "This course will focus on the construct of mindfulness and its applications to psychotherapy. An experiential and academic understanding of mindfulness will be emphasized. The experiential component will involve training in meditation and mindfulness practices. The academic component will involve rigorous examination of current research on the applications of mindfulness in health care, as well as exploration of current theories of mindfulness and its applications to clinical work. The intention of the course is to help students better understand the construct of mindfulness and how it can be applied in clinical practice as a technique for clients, a theoretical frame for therapists, and as a means of enhancing therapist skills, for example, empathy and attention. A final intention is for students to explore the potential benefits of mindfulness for their own self-care and self-inquiry. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "389",
                "title": "Advanced Group Counseling",
                "description": "For students who have completed 219 and wish advanced training in group leadership procedures. This class focuses on practices of group therapy, and on the complexities of parallel process and the transference/ counter transference issues in groups. Both practical and academic approaches are taken; each student applies classroom learning to an ongoing group process situation. Extensive use of videotape, role-playing, and hands-on practice. The class includes a required one-day \"marathon\" group session. Recommended for students who expect to do group counseling and therapy in their post-master's employment. Prerequisites: 200, 218, 219, 221; P/NP. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "390",
                "title": "Advanced Seminar in Couples Therapy",
                "description": "Specifically designed to help students conceptualize and plan treatment for couples. Stress on issues of structured and non-structured interviewing, transference and counter transference, and family of origin. Normally the class views and examines a \"live case\" or case scenarios through the term and/or class participation in problem-solving couples' difficulties and extensive case examples and role playing. Examination of divorce issues and alternative lifestyles. Prerequisites: 212, 227 and 311. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "391",
                "title": "Hypnotic Techniques in Counseling and Therapy",
                "description": "Introduction to hypnotherapeutic techniques in the therapy context. Students learn to induce trance states and the appropriate application of these for therapeutic purposes. Emphasizes ethical utilization in both traditional and indirect hypnosis. The use of hypnosis as a part of psychotherapy is explored in depth. A clinically oriented course; research and literature are used to support the clinical application of hypnosis for such issues as pain control, memory retrieval, anesthesia, habit control, and direct therapy. Prerequisites: 15 hours completed, must include 227. Usually taken on a pass/ fail basis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "395",
                "title": "Advanced Object Relations Seminar: Clinical Techniques",
                "description": "Advanced skill building. Course addresses technique-related topics relevant to the growth and development of the skilled Object Relations therapist. Course focuses in depth on different topics during different terms. Topics range from developing a clinical stance, to uses of interpretation, working in the transference, working with countertransference and projective identification, working with frame issues, working with the schizoid patient, working with the narcissistic patient, the technical Winnicott, the technique papers of Freud, etc. Course will include relevant readings, presentations of case material, and experiential clinical practice. Prerequisite: 200, 212, 216, 218, 264 or permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "399",
                "title": "Thesis",
                "description": "Optional course; usually selected by candidates preparing for doctoral studies. The thesis should concern a recognized problem in the student's field of specialization, should make a scholarly contribution to the extant body of knowledge in this area, and should review the principal sources of knowledge. Format should follow the guidelines established by the American Psychological Association. Supervision and review of the thesis provided by faculty member(s) designated by the chair of the Department of Counseling Psychology. Students may replace the Comprehensive Examination with completion of an approved thesis. Requirements for thesis submission are negotiated with the thesis faculty director. (1-6 units)",
                "units": "1-6 units"
            }
        ],
        "abbr": [
            "CPSY"
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "School of Education and Counseling Psychology",
        "department": "",
        "courses": [
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "221M",
                "title": "Effective Teaching for Students with Disabilities",
                "description": "This course provides multiple and single subject teaching credential candidates with an introduction to creating positive and effective, inclusive, instructional environments for all learners, including students with disabilities. This course introduces the candidates to a range of strategies for learning about their students’ background knowledge, experiences, and interests and for identifying their academic, language, and social skill levels. Focused on the use of effective, inclusive teaching practices that enable all students to be successful, the course develops candidates’ ability to plan and implement flexible, standards-based instruction that will enable every student to learn every day. This course includes a study of types of disabilities according to IDEA 2004 and California rules and regulations, and criteria for identification for special education services, as well as an examination of the types of services provided in response to student needs. Candidates examine the population of students included for special education services, the continuum of services available, and different models of service delivery.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231A",
                "title": "Ethical Reflective Practicum in Elementary Schools I",
                "description": "This class is the first in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels. The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience. This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231B",
                "title": "Ethical Reflective Practicum in Elementary Schools II",
                "description": "This class is the second in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231C",
                "title": "Ethical Reflective Practicum in Elementary Schools III",
                "description": "The teacher candidate will continue to maintain a narrative reflective journals of all instruction observed. (6.1-6.4, 6.6) The teacher candidate will demonstrate knowledge and use of the range of curricular materials and resources available at their school. (2.4) Students will explore a variety of positive ways to manage student behavior (1.8, 2.1, 2.6, 2.6) Each student will demonstrate a developing repertoire of effective teaching standards in their specific content teaching area. (1.6, 1.8, 2.1, 2.2 3.4, 5.5) Students will understand their legal and ethical responsibilities as a professional educator. (2.3, 2.4, 6.5, 6.6) Students will understand the value of parents as partners and develop strategies to utilize the skills of parents. (1.2, 2.6, 4.6) Reflect on the moral and ethical core of your teaching practice and on the relationship between your moral/ethical core and your identity and life experiences (TPE 6.1) Collaborate with classmates in professional learning communities (PLCs) to analyze and evaluate the complexities of ethical classroom teaching in culturally and linguistically diverse school settings (TPE 6.3)",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231D",
                "title": "Ethical Reflective Practicum in Elementary Schools IV",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum I",
                "description": "This practicum course supports Catholic school credential candidates across each quarter of their placement. The course provides guidance in the assumption of full time teaching responsibilities and features regularly scheduled seminars and speakers. Candidates must meet established benchmarks for the development of academic and professional competence to satisfy course requirements and to earn a recommendation for a multiple or single subject teaching credential. Academic and teaching performance equivalent to a B is required to earn a passing grade. Required of all multiple and single subject candidates taking part in the ExCEL program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum II",
                "description": "This practicum course supports Catholic school credential candidates across each quarter of their placement. The course provides guidance in the assumption of full time teaching responsibilities and features regularly scheduled seminars and speakers. Candidates must meet established benchmarks for the development of academic and professional competence to satisfy course requirements and to earn a recommendation for a multiple or single subject teaching credential. Academic and teaching performance equivalent to a B is required to earn a passing grade. Required of all multiple and single subject candidates taking part in the ExCEL program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum III",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the Catholic schools at the K-12th grade levels. The main focus of the clinical practicum seminar is to support students as they complete their teaching experience. This seminar focuses on the Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom teaching, will provide students the opportunity to discuss instructional strategies and methodologies, as well as challenges and issues in Catholic education.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231E",
                "title": "School Practicum IV",
                "description": "This class is the final in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the Catholic schools at the K-12th grade levels. The main focus of the clinical practicum seminar is to support students as they complete their teaching experience. This seminar focuses on the Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom teaching, will provide students the opportunity to discuss instructional strategies and methodologies, as well as challenges and issues in Catholic education.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Summer 2 Ethical Reflective Practicum for Interns I",
                "description": "EDUC 231i - Summer 2 Ethical Reflective Practicum for Interns I",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Fall Ethical Reflective Practicum for Interns II",
                "description": "EDUC 231i - Fall Ethical Reflective Practicum for Interns II",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i-",
                "title": "Ethical Reflective Practicum for Interns III",
                "description": "EDUC 231i- Winter Ethical Reflective Practicum for Interns III",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "231i",
                "title": "Ethical Reflective Practicum for Interns IV",
                "description": "EDUC 231i - Ethical Reflective Practicum for Interns IV",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "251",
                "title": "Technology for Elementary Teachers",
                "description": "This course is designed to acquaint teacher credential candidates with learning theories, practices, hardware, software applications, and web resources that are useful in integrating technology into the daily practice of TK-12 teachers. The course meets the requirements identified in the technology standard for teacher preparation for the State of California. The guiding philosophy for the course is Constructivism, instantiated in the design of collaborative, project-based learning activities that capitalize on the full potential of educational technologies. Students will be expected to fully engage in classroom exercises, group projects, and small-group and whole-class discussions on the assigned readings.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "252",
                "title": "Social Foundations of Education",
                "description": "The goal of this course is to examine the historical, social, philosophical, and legal foundations of American education. We explore the impact of these various influences on the current state of education, as well as consider the future of education in a diverse society. This course provides an opportunity to reflect on our roles as educators and the manner in which we will work to improve the educational experience for all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "253",
                "title": "Development & Learning TK-12",
                "description": "Drawing on both developmental and educational psychology, this course examines theories and patterns of learning, development, and individual differences as they relate to teaching practices and educational programs. Students apply theories of cognitive, physical, social/emotional and motivation to learning contexts among children and youth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "257",
                "title": "English Language Development in Elementary Schools",
                "description": "This course is designed to provide knowledge of the linguistic and cultural aspects of developing English language proficiency. Students develop an understanding of the theory and methods of teaching linguistically diverse learners, including models for designated and integrated English language development as well as sheltering strategies to make content more accessible.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "258",
                "title": "Elementary Classroom Management",
                "description": "Research data report that the number one reason teachers leave the classroom is because they cannot manage their students.  In fact failure to control the classroom is synonymous with failure as a teacher. This course will explore the importance of establishing a positive structured learning environment by developing a successful classroom management model that is consistent with the California Standards for the Teaching Profession. Topics will include, but not be limited to, the following: motivation, managing time and physical space, and establishing rules and routines",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "259A",
                "title": "Elementary Mathematics Methods I",
                "description": "EDUC 259 (Elementary Mathematics  Methods) course is Part 1 of a two-course sequence in elementary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in elementary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structure, and conducting clinical interviews on number concepts, we will set the stage for our development as elementary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "259B",
                "title": "Elementary Mathematics Methods II",
                "description": "EDUC 259 (Elementary Mathematics Methods) course is Part 2 of a two-course sequence in elementary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in elementary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through examining classroom culture and structure, and evaluating, designing and implementing math lessons, we will set the stage for our development as elementary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "261",
                "title": "Teaching Reading in the Elementary School",
                "description": "This course enables credential candidates to develop awareness and understanding of current theories and best practices of comprehensive, balanced reading instruction in elementary school settings. Candidates will learn how to adapt instruction to meet the needs of individuals based on their cultural, linguistic, and experiential backgrounds and their specific needs as learners. Focused attention will be given to the nature of reading difficulties and principles of diagnosis and assessment. Content presented in this course prepares candidates for the Reading Instruction Competence Assessment (RICA). This course, required of all multiple subject teaching credential candidates, must be taken concurrently with enrollment in EDUC 266 or a full time teaching position in a Catholic school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "262",
                "title": "Teaching Language Arts in Elementary Schools",
                "description": "A study of language arts teaching strategies, with a focus on teaching writing to students in grades K-8, including English learners and students with special needs. Focused attention is given to techniques for integrating literature and language arts instruction with science and social studies content.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "263",
                "title": "Elementary Methods in S.S. and Visual Performing Arts",
                "description": "In this course, multiple subject credential candidates learn how to design, implement, and evaluate standards-based social science lessons and how to integrate content from the California content standards for visual and performing arts, and the California Common Core. The course emphasizes mastery of instructional strategies that create opportunities for all students, including English learners and students with special needs, to read and write about how to use social studies for social justice and how to incorporate the visual and performing arts as ways to express and visually represent meaningful learning. Topics include working with curriculum frameworks and content standards, developing curriculum units, and planning lessons that maximize the learning of all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "264",
                "title": "Elementary Methods in Science, Health and Physical Education",
                "description": "This course is designed to assist multiple subject credential candidates in developing the skills necessary to design and carry out science, health, and physical education instruction, demonstrations and laboratory experiences for students in elementary and middle school programs. We will build on current research and best practice in order to foster science/health/PE learning in K-8 students. The process of creating content, developing curriculum, and applying standards to generate meaningful lessons are emphasized with an additional area of emphasis being placed on assessment and collaboration. Scientific inquiry, project-based instruction (PBI), Common Core integration, and Next Generation Science Standards (NGSS) will be emphasized along with best practices in the STEM/Health/PE model.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "265",
                "title": "Assessing Elementary Student Learning",
                "description": "This course is designed to help future and current teachers of culturally and linguistically diverse elementary school students to (1) understand, develop, and implement a range of effective, practical strategies for assessing and documenting the academic achievement of their students, including English Learners, students with identified/unidentified exceptionalities, and students eligible for free or reduced price lunch (TPEs 1.1, 2.2, 3.5, 4.4, and 5.1-5.8); (2) develop the skills and habits of mind necessary to use assessment results to plan effective instruction for every student (TPEs 3.5, 4.4, and 5.1-5.8); (3) learn how to present and discuss assessment results with other education professionals and with students’ parents (TPEs 1.2, 2.6, 3.2, 4.5, 5.1-5.8).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "275",
                "title": "Ethics, Diversity, Reflection: Intro to TK-12 Teaching",
                "description": "This intensive five-day course orients credential candidates to the MATTC preliminary teaching credential program and to the teaching profession.  Emphasis is placed on providing opportunities for candidates to learn and to practice the inquiry, thinking, and reflection skills that are the foundation for teachers’ ongoing professional development throughout their careers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230A",
                "title": "Ethical Reflective Practicum in Secondary Schools I",
                "description": "This class is the first in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels. The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience. This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230B",
                "title": "Ethical Reflective Practicum in Secondary Schools II",
                "description": "This class is the second in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230C",
                "title": "Ethical Reflective Practicum in Secondary Schools III",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "230D",
                "title": "Ethical Reflective Practicum in Secondary Schools IV",
                "description": "This class is the third in a series of four field experience courses designed to introduce teacher credential candidates to curriculum, instruction and classroom practices in the public schools at the TK -12 levels.  The main focus of the clinical practicum seminar is supporting students as they complete their student teaching experience.  This seminar will focus on the six Teacher Performance Expectations (TPEs) as indicated in the course objectives. The seminar, in combination with classroom observations, will provide students the opportunity to discuss instructional strategies and methodologies, as well as problems and issues in public education. It will also provide classroom-based support while students complete the Teacher Performance Assessments (TPAs).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "275",
                "title": "Ethics, Diversity, Reflection: Intro to TK-12 Teaching",
                "description": "This intensive five-day course orients credential candidates to the MATTC preliminary teaching credential program and to the teaching profession.  Emphasis is placed on providing opportunities for candidates to learn and to practice the inquiry, thinking, and reflection skills that are the foundation for teachers’ ongoing professional development throughout their careers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "276",
                "title": "Technology for Secondary School Teachers",
                "description": "This course is designed to acquaint teacher credential candidates with learning theories, practices, hardware, software applications, and web resources that are useful in integrating technology into the daily practice of TK-12 teachers. The course meets the requirements identified in the technology standard for teacher preparation for the State of California. The guiding philosophy for the course is Constructivism, instantiated in the design of collaborative, project-based learning activities that capitalize on the full potential of educational technologies. Students will be expected to fully engage in classroom exercises, group projects, and small-group and whole-class discussions on the assigned readings.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "277",
                "title": "Social Foundations of Education",
                "description": "The goal of this course is to examine the historical, social, philosophical, and legal foundations of American education. We explore the impact of these various influences on the current state of education, as well as consider the future of education in a diverse society. This course provides an opportunity to reflect on our roles as educators and the manner in which we will work to improve the educational experience for all students.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "278",
                "title": "Development and Learning TK-12",
                "description": "Drawing on both developmental and educational psychology, this course examines theories and patterns of learning, development, and individual differences as they relate to teaching practices and educational programs. Students apply theories of cognitive, physical, social/emotional and motivation to learning contexts among children and youth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "282",
                "title": "English Language Development in Secondary Schools",
                "description": "This course is designed to provide knowledge of the linguistic and cultural aspects of developing English language proficiency. Students develop an understanding of the theory and methods of teaching linguistically diverse learners, including models for designated and integrated English language development as well as sheltering strategies to make content more accessible.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "283",
                "title": "Secondary Classroom Management",
                "description": "Research data report that the number one reason teachers leave the classroom is because they cannot manage their students.  In fact failure to control the classroom is synonymous with failure as a teacher. This course will explore the importance of establishing a positive structured learning environment by developing a successful classroom management model that is consistent with the California Standards for the Teaching Profession. Topics will include, but not be limited to, the following: motivation, managing time and physical space, and establishing rules and routines.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "285A",
                "title": "Secondary English Methods I",
                "description": "EDUC 285 and EDUC 286 are designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject, Secondary English/World Lang. Methods, effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the EDUC 285 Methods I and EDUC 286 Methods II blocks in the content area aligned with the credential they are seeking.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "285B",
                "title": "Secondary English Methods II",
                "description": "EDUC 285A and EDUC 285B are designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject, Secondary English/World Lang. Methods, effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the EDUC 285A Methods I and EDUC 285B Methods II blocks in the content area aligned with the credential they are seeking.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "286A",
                "title": "World Language Methods",
                "description": "This course is designed to further enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach World Languages to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to World Languages curriculum. All single subject credential candidates are required to take the Methods I and Methods II block in World languages. The course requires concurrent enrollment in EDUC 231C or employment as a full-time teacher in a Private school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "286B",
                "title": "World Language Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach World Languages to all students. Special attention is paid to developing candidates’ ability to utilize standards and instructional strategies to plan, deliver and reflect upon instruction that supports language development. The course also probes the role of cultural and content understanding in the development of instruction. All single subject credential candidates are required to take the Methods I and Methods II block in World languages. The course requires concurrent enrollment in EDUC 231B or employment as a full-time teacher in a Private school.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "287A",
                "title": "Math Methods",
                "description": "EDUC 287 (Secondary Math Methods I) course is Part 1 of a two-course sequence in secondary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in secondary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structures, facilitating mathematical discussions, and assessing student work, we will set the stage for our development as secondary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "287B",
                "title": "Math Methods",
                "description": "EDUC 288 (Secondary Math Methods II) course is Part 2 of a two-course sequence in secondary mathematics teaching methods. This sequence is designed to provide teacher candidates with a coherent set of experiences for mathematics teaching and learning in secondary schools. Through assigned readings, classroom discussions, content rich mathematics activities, and assignments that require data collection in your field placement, you will be supported as you make sense of how to approach the profession of teaching. Through thinking about ourselves as teachers, examining classroom culture and structures, facilitating mathematical discussions, and assessing student work, we will set the stage for our development as secondary mathematics teachers.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "288A",
                "title": "Secondary Science Methods I",
                "description": "This course introduces the instructional design techniques and strategies for developing effective programs of study for secondary science students. In addition, the course is designed for engagement with the current issues, challenges, and opportunities associated with science teaching and learning at the secondary level, with particular emphasis on the assurance that all students have opportunities to learn the core ideas, practices, and crosscutting concepts (as outlined in state and national standards documents), while leveraging students’ interests, prior knowledge, and lived experiences. Various course activities are designed to explore the following: 1) the relationship between content-specific lesson planning, enactment, and reflection; 2) what it means to teach three-dimensional science content that is aligned to the Next Generation Science Standards and reflects what the profession currently understands about the learning of scientific concepts; 3) rethinking procedural laboratory and textbook activities; and 4) methodologies to foster and maintain a positive scientific classroom climate that incorporates all aspects of science proficiency.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "288B",
                "title": "Secondary Science Methods II",
                "description": "This course continues the work undertaken in EDUC 288A (Secondary Science Methods I) to develop and refine instructional design techniques and strategies for implementing effective programs of study for secondary science students. This course includes a focus on planning an instructional sequence and assessments within a 5-E paradigm for science teaching. In addition, the course will maintain focus on increasing your familiarity with the basics of project-based instruction (PBI); and the Next Generation Science Standards (NGSS) and how these relate to planning lessons and assessments. In addition, the course will continue our engagement with the current issues, challenges, and opportunities associated with science teaching and learning at the secondary level, with particular emphasis on the assurance that all students have opportunities to learn the core ideas, practices, and crosscutting concepts (as outlined in state and national standards documents), while leveraging students’ interests, prior knowledge, and lived experiences. Various course activities will continue to explore the following: 1) the relationship between content-specific lesson planning, enactment, and reflection; 2) what it means to teach three-dimensional science content that is aligned to the Next Generation Science Standards and reflects what the profession currently understands about the learning of scientific concepts; 3) rethinking procedural laboratory and textbook activities; and 4) methodologies to foster and maintain a positive scientific classroom climate that incorporates all aspects of science proficiency. Lastly, this course explores resources available to the science teaching community, including inquiry-based materials for teaching secondary science content for student understanding.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "289A",
                "title": "Social Science Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the Methods I and Methods II block in the content area aligned with the credential they are seeking. Single subject credential candidates in art and music should enroll in the social sciences methods course block.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "289B",
                "title": "Social Science Methods",
                "description": "This course is designed to enable single subject credential candidates to develop the pedagogical content knowledge necessary to teach their specific academic subject effectively to all students. Special attention is paid to developing candidates’ ability to use Specially Designed Academic Instruction in English (SDAIE) skills to give all students equitable access to curriculum content. All single subject credential candidates are required to take the Methods I and Methods II block in the content area aligned with the credential they are seeking. Single subject credential candidates in art and music should enroll in the social sciences methods course block.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "294A",
                "title": "Adolescent Literacy Development I",
                "description": "EDUC294 Adolescent Literacy Development presents research-based principles for effective literacy instruction in secondary school settings. Students will explore theories, major trends, and principles in the field of literacy that render effective instruction for particular purposes and reflective of students’ needs and strengths.  Attention will be given to what, why, when, and how specific components of literacy are taught to promote communicative, reading, and writing competence in linguistically diverse classrooms and for individuals within a broad range of experiential and ability levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "294B",
                "title": "Adolescent Literacy Development II",
                "description": "This first course of the two-course sequence presents research-based principles for effective literacy instruction to support content area learning in secondary school. Students acquire models for integrating reading and academic talk into content area instruction. Attention is given to supporting the literacy and content area learning of English Learners and students with a broad range of experiential and ability levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "296",
                "title": "Assessing Secondary Student Learning",
                "description": "This course is designed to help you understand, integrate, and skillfully apply the principles of assessment. You will be taught how to develop assessments that align well you’re your lesson objectives and provide information about what your students have learned. Overall, this course will help you to understand the principles of assessments, construct valid assessments of student learning, recognize the strengths and limitations of various assessment types, and learn about the legal and ethical implications in the use of assessment data. At the end of this course, you will be able to develop, administer, and score a range of sound formative and summative assessments that will help all your students learn.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "246",
                "title": "Bilingual Seminar (In-Service)",
                "description": "This course is continues discussions about bilingual methods and foundations as well as begins to provide insights into the Latinx language practices and culture. In-Service Bilingual Teacher candidates gather information about the role and place of both languages at their school site, gather evidence as to the cultural and historical context of the Latinx community that they serve as well as sharpen their bilingual methodologies.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "247",
                "title": "Latinx Language and Culture",
                "description": "This course is designed to enable students to develop an awareness and understanding of the traditions, roles, status, and communication patterns of Latinx as practiced in the United States and their country of origin. Students will acquire skills to discern patterns of cultural relationships among Latinx in the US and CA. Students will also acquire understandings of the historical, political, economic, religious, and educational factors that impact the acculturation of Latinx in the US and CA. An emphasis will be to view Latinx countries’ of origin various factors (demographic, language use, immigration patterns) and how these impact settlement in CA.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "248B",
                "title": "Bilingual Foundations",
                "description": "This course is designed to enable students to develop an awareness and understanding of foundational issues of Bilingual Education and bilingualism. Students learn about the legal and legislative foundations of bilingual education in the United States. Histories and policies that have shaped bilingual education in the US is also a focus of the course. Students learn to apply knowledge of cognitive effects of bilingualism and biliteracy to instructional plans. Tenets of bilingualism are reviewed, including the Common Underlying Proficiency construct to understand transferability of skills, understandings and strategies from primary to target language. Students develop skills to promote authentic parent participation to ensure parents are viewed as a critical resource toward ensuring strong bilingualism and biliteracy development.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "249B",
                "title": "Bilingual Methods",
                "description": "This course focuses on the methodology of instructing students in Spanish and English in K-12 settings. The course addresses issues related to content scaffolding, biliteracy development and assessment of emergent bilinguals. Focused attention is given to first and second language development, including the interrelationship among reading, writing speaking and talking and the linguistic structure of both the English and Spanish language. Students also develop an understanding of the historical policies, program type and understanding of the diverse types of bilingual programs in the US. This course is required of all Bilingual MATTC candidates and must be taken concurrently with enrollment in EDUC 266b or a full time teaching position in a bilingual Catholic school. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "360",
                "title": "Organizational Leadership",
                "description": "CATE Objectives, including theories and concepts of leadership and their relationship to theory and practice. Understand and develop skills and strategies within the context of contemporary issues which include sustainable schools, student centered vision, use of data and sound teaching and learning for all students. Understanding skills to align the school vision with the local diocese or LEA. Develop skills and strategies for employee accountability, professional ethics and adapt personal skills needed for leadership and administration.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "361",
                "title": "Instructional Leadership",
                "description": "This course will focus on TK-12 CAPE content standards and their implications for the development of curriculum and instruction. This includes the use of assessments, teaching strategies and the appropriate blend of technology for teacher and students at all grade levels. There will be comprehensive demonstrations of best practices for instruction which will be modeled and discussed throughout this course. Students will understand the professional standards for implementing learning objectives which are meaningful, measurable and appropriate for grade levels.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "362",
                "title": "Organizational Behavior",
                "description": "The course includes topics such as the improvement of educational institutions and other organizations as a result of improving management practices; avoiding old mistakes and facing problems and challenges associated with a changing, culturally diverse school population with confidence are considered. Discussions include goal setting and the role of the individual and institutions. Topics include government intervention in education, legislation, regulation and policymaking. The organization as a target of legislative reform is discussed. Solving problems before they become unsolvable and strategies for improving management are considered (from SECP Graduate Bulletin, 2016, p. 98).",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "363",
                "title": "Organizational Governance and Law",
                "description": "This course is part of the Educational Leadership sequence of study. The focus of this course is the examination of the issues of education, law and morality and ways in which the law, by its very nature, cannot be separated from ethics and morality. Theories of law and of the relationship between law and other social and ethical values are reviewed. The ability of leaders to have a better understanding of the law and the politics associated with governance and the ability to assist people to work through moral dilemmas associated with the law are considered. Cross-cultural communications, desegregation and discrimination, credentialing laws, assignment authorization, and schools as a political system are also examined.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "364",
                "title": "Leadership Field Lab - Educational Leadership Practicum",
                "description": "This course is the first of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around weekly reflection and skill building, monthly seminars, and culminates in a field project and candidate evaluation. The candidate develops interpersonal and leadership skills in developing and leading the organization’s vision given the complex realities, multiple constituencies, and challenging interactions of the site. The candidate develops skills in shared leadership and change management and applies this to a site. The candidate coordinates organizational, legal, and ethical dimensions of leadership. This field lab extends and applies knowledge and skills developed in EDUC 360, 362, 363, and 428, and is ordinarily completed in the same program year as these courses. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "365",
                "title": "Human Resource Development",
                "description": "This course is part of the Educational Leadership sequence of study. It is intended to provide students with an introduction to the principles of human resource development and an overview of various supervision, evaluation, and leadership tools and strategies to support the cultivation of the people who make organizations work. Students will read empirical and conceptual works as well as a foundational guide for practitioners to anchor reflection and experiential learning related to managing human resources and organizational growth.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "366",
                "title": "Community Leadership and Public Relations",
                "description": "Exploring Community and Public Relations through the lens of visionary thinking and creative business strategies.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "367",
                "title": "Contextual Field Lab – Educational Leadership Practicum",
                "description": "EDUC 367, Contextual Field Lab, is the second of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around weekly reflections, skill building, consulting with a supervisor and culminates in a field project with candidate evaluation. The candidate develops skill in the design, collection, and use of data for decision making and program improvement in the context of relevant professional standards and outcomes.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "368",
                "title": "Program Evaluation",
                "description": "This course is part of the Educational Leadership sequence of study. It is intended to provide students with an introduction to program evaluation and the principles of assessment; it includes an overview of various assessment tools and strategies with a focus on data analysis and the use of evidence in decision-making. Students will read empirical and conceptual works as well as a foundational guide for practitioners to anchor reflection and experiential learning related to the principles of assessment and school improvement. The relevance and application of these principles for instructional leadership is explored, with an emphasis on the continuous school improvement framework in lieu of compliance-oriented reform. Students have the opportunity to gather comparative information through a well-designed process of assessment, analysis, and evaluation. Evidence and results will be analyzed within the appropriate context to determine judgment, size, and worth. Students will grapple with common misconceptions in assessment and the challenges, limitations, and possibilities that assessment holds for school improvement.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "369",
                "title": "Action Research and Research Methods",
                "description": "The course focuses on a spectrum of activities that focus on research, planning, theorizing, learning, and development in the resolution of a problem or problems. An understanding of the qualitative research principles, the dynamics associated with diversity and change and the need to study problems that are relevant in real settings while systematically inquiring, making hypotheses and testing these hypotheses; use as a vehicle for empowering teachers and learners. Approaches to scholarly inquiry. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "370",
                "title": "Field Lab-Community, Diversity and Technology",
                "description": "This course is the first of three leadership learning experiences centered on an approved and supervised embedded job experience or field placement in educational or nonprofit leadership. The course is built around reflection and skill building, monthly seminars, and culminates in a field project and candidate evaluation. The candidate develops skills in the full range of leadership and management skills for forming sustainable organizations that serve their intended communities. The field lab focuses on effective management of technology, as well as finances, facilities and fundraising. This includes budgeting, financial reporting and meeting legal reporting requirements. The candidate engages in both learning from and serving the organizations and community stakeholders. This lab extends and applies knowledge and skills developed in previous courses taken in during the degree program.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "371",
                "title": "Program Interventions",
                "description": "The purpose of the Program Interventions course is for students to develop the knowledge and skills necessary to evaluate and select appropriate interventions to build a culture of inclusion within school and other environments. The emphasis is on effective, efficient, and socially valid models of intervention, primarily through Multi-Tiered Systems of Support. The course develops an understanding of program evaluation measures, and requires students to be able to demonstrate this knowledge for purposes of making data based decisions to develop intervention plans for a variety of learners including students with disabilities and other special concerns such as youth from foster, immigrant and migrant families, students who are at risk and students from language diverse communities. Synchronous and asynchronous class activities provide practice in the use of relevant interventions designed to effect continuous improvement in schools and other organizations. The course focuses on the role of educational leaders in serving students and building inclusive school communities and other organizations.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "374",
                "title": "Organizational Culture and Change",
                "description": "This course explores current issues with regard to organizational culture and change. Topics to be explored include how organizational culture influences such things as making staffing decisions, using data driven professional development, understanding the barriers to organizational reform, managing and changing culture, understanding governance structures for public and private schools and other organizations, and creating principles of equity, diversity, inclusivity, accountability as well as researching future educational visions.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "376",
                "title": "Technology to Enhance Leadership",
                "description": "This course enables the educational leader to develop the ability to make informed decisions about appropriate technologies for school use, understand the importance and role of multimedia technologies for instructional support, administrative decision-making, and management of data in schools. It further helps the administrator to use computers and other technologies in the performance of their responsibilities, and to define, develop, and demonstrate standards of ethics for technology and the use of technology in the schools.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "391",
                "title": "Ethics in Education",
                "description": "The course examines the roles educators play in the moral education of students, and the formation of ethical school communities and agencies. Educational ethics invites educators to consider the roles, stakeholders, issues, and methods useful for applied ethics in the schools. Discussion focuses on major ethical theories and principles Students develop a method for making ethical decisions involving administration, faculty, and student life, while considering realistic ethical problems. The course includes investigations into controversial ethical issues and dilemmas to prepare educators to critically think through potential situations that may arise with students, parents, administrators, and peers. [3 units]",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "400A,",
                "title": "and 407 - Calif. Professional Standards for Educational Leaders",
                "description": "These three graduate courses form an integrated body of a two-year study and support of candidates who wish to obtain a “clear” induction administrative credential to work in California schools. These three courses are treated as one set of courses to introduce and develop students to gain competence in the concepts, skills and specific tools by which to effectively and pragmatically lead schools as organizations, with the primary focus on developing and demonstrating competence in each of the six California Professional Standards for Educational Leaders (CPSEL). These courses must total at least 14 units. The individual nature of the course structure supports those in public standard schools, public charter schools, and private schools, both those with a religious focus and those that are public, secular (not religious) schools",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "428",
                "title": "Management",
                "description": "Financial Management is an introduction to resource allocation, management, and reporting in schools, churches and nonprofit institutions. The course focuses on the budget process, nonprofit and government accounting and finance, information technology, and property management. The course then considers school funding models, site planning, as well as reporting and other requirements. School business management is situated in the economics of the school enterprise, explores the role of innovation and entrepreneurship, and applies these concepts to the development of business models and plans. The course is generally concerned with: the macroeconomics of schools in society; resource allocation, funding, and reporting; the microeconomics of school planning and management; the budget process; financial statements; government funding, controls, and accounting standards; nonprofit accounting.",
                "units": ""
            },
            {
                "abbr": "EDUC",
                "type": "Graduate",
                "id": "429",
                "title": "Perspectives",
                "description": "School leaders are constantly faced with pressing social justice issues that impact the school community and raise ethical and social dilemmas. It is imperative that future school leaders develop a foundation of knowledge that enables them to comprehensively respond to issues of social justice issues and social change. The course will address personal leadership styles, organizational leadership, and issues of social justice, educational equity, leading for change. In short, this course will explore how one’s leadership style impacts leading for change. The primary goal for this class is to explore yourself as a leader, to engage in dialogue, and motivate students to express their opinions on said issues. Students will be asked to examine their personal and professional commitment to ethics, diversity, social justice and human dignity. Students will leave this class having formed clear concepts of their leadership tendencies, with formed opinions on how the importance of equity and social justice are a fundamental part of a school climate and culture.",
                "units": ""
            }
        ],
        "abbr": [
            "EDUC"
        ]
    },
    {
        "university": "Santa Clara University",
        "school": "School of Education and Counseling Psychology",
        "department": "",
        "courses": [
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "200",
                "title": "Psychology of Interpersonal Communications",
                "description": "The foundation course for all CPSY programs, this course provides a laboratory setting in which students master basic skill sets that are fundamental for effective communication, advanced counseling and therapy. Among the basic skills essential to counseling psychology are the cultivation of attention, learning to ask questions, paraphrasing and encouraging, reflecting feeling and meaning, confrontation and empathy. The course allows students the opportunity to create, discover and/or examine and expand their personal counseling style through deep investigation of both self and the professional literature. A primary focus is on being more conscious and intentional in interpersonal communication and subsequently in the counseling process. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "205",
                "title": "Community Based Learning",
                "description": "This course is designed on a community based learning model and is intended to expose students to a variety of social issues that affect individuals and families of low socioeconomic status:poverty, deprivation, inadequate housing, access to health care, access to education, and other salient issues. A variety of sites, schools, community pantries, homeless shelters, soup kitchens, etc. are available for the student to choose. The student is expected to assist in these sites as they are asked. This is not a therapy based practicum and students do not provide any counseling services. Students are expected to participate in their site for 4 hours per week and attend a 90 minute weekly reflection period. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "211",
                "title": "Human Sexuality",
                "description": "This course provides information and perspective to future therapists regarding biological, developmental, behavioral, emotional, and cultural aspects of human sexuality. It is principally clinical in focus: reading materials, classroom experiences and discussions are used to augment students' knowledge of human sexual functioning, both potential and problematic, and to expand students' comfort with their future role as therapists to couples and individuals. Prerequisite: 200 and (212 or 216). (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "211A",
                "title": "Sex Addiction",
                "description": "This class will provide participants with information to understand and diagnose sexual addiction and sexual anorexia, knowledge of assessment tools, as well as the ability to develop treatment plans that provide interventions in all phases of recovery. Case illustrations, formal presentations, and interactive exercises will be used to illuminate issues pertaining to the etiology and treatment of problematic sexual attitudes and behaviors. Prerequisite: 200, 212 or 216. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "212",
                "title": "Psychology of Relationships",
                "description": "The focus of this course is relationships: how human beings develop as relational beings; how they orient toward themselves and toward others in relationship; how they orient in the therapeutic relationship; how their relational templates may be the focus of therapeutic intervention. Study is focused on the formation and dynamics of interpersonal relationships in the individual, family, and couples. Study also includes traditional and nontraditional relationships. Prerequisite: 200 or 216.",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "213",
                "title": "Foundations of LGBT Psychology",
                "description": "This course provide counseling psychology students with an opportunity to familiarize themselves with issues like to be encountered when working with LGBT clients. Students will confront their own beliefs and feelings about same sex relationships and how these might affect their clinical work. Teaching methodology will include lecture, readings and discussions, case studies, experiential exercises, testimonies of LGBT persons, and films. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "214",
                "title": "Evidence-Based Approaches to Psychotherapy",
                "description": "This course focuses on research and clinical technique related to evidence-based practice in psychotherapy. It includes instruction on methodology, analysis, and synthesis of research on the efficacy and outcomes of psychotherapy interventions, as well as training in evidence-based counseling techniques from a variety of theoretical perspectives, including cognitive, behavioral, person-centered, and psychodynamic. Students gain an understanding of how research can inform what techniques to practice in the therapy encounter and how those techniques should be implemented with a variety of disorders and psychosocial issues. NOTE: Students who have taken this course should not enroll in CPSY 224. Prerequisites: None. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "215",
                "title": "Psychology of Childhood",
                "description": "Explores the psychological world of the child from infancy through adolescence from a developmental perspective with a particular focus on attachment/object relations theory. Examines processes associated with healthy psychosocial adjustment, case conceptualization and treatment approaches. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "216",
                "title": "Psychology of Human Development",
                "description": "A developmental approach to the entire human life cycle from childhood through old age, with focus on significant transitions and passages. Includes coping with change in the personal, social, and transpersonal domains and how it has an impact on human growth and development. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "218",
                "title": "Foundations of Psychotherapy and Personality",
                "description": "A comprehensive review of fundamental concepts in personality theories and their applications to counseling and psychopathology, with special focus on explicating the relationship between theory and practice. Key elements, concepts, and techniques associated with major theories of counseling are examined; identifying the strengths and limitations of each of the major theories, as well as commonalities and divergences among them. The course will help students formulate an initial personal theory of counseling from which to build as they evolve through the program. Exploration of Psychoanalytic, Humanistic, Cognitive, Behavioral, Systems and multi-cultural theory and technique are among the course foci. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "219",
                "title": "Psychology of Group Counseling",
                "description": "Introduction to small-group dynamics. Techniques of small-group leadership and experiential involvement in group process. The phases of natural group development and ethical, professional leadership are examined. Primary focus is on process-oriented, especially closed-ended groups. Lab group required concurrently or prior. Prerequisites: 200 and 218; pre-requisite or co-requisite: 220; 221 are strongly recommended. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "219A",
                "title": "Psychology of Group Counseling Lab Group",
                "description": "This lab is an experiential application of the theories and principles learned in 219. Must be taken prior to or concurrently with 219; Prerequisites: 200 and 218; 220 strongly recommended. (0 units)",
                "units": "0 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "220",
                "title": "Research Methods",
                "description": "Fundamentals of research and statistics in analyzing research in counseling and psychotherapy. Emphasis on the review, evaluation and interpretation of research literature, particularly in the areas of child development and counseling, and marital and family therapy. Discussion of formulations of research proposals and theses. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "221",
                "title": "Group Counseling Lab",
                "description": "This lab is an experiential application of the theories and principles learned in 219. This lab is taken prior to or concurrently with 219. Prerequisites: 200 and 218; 220 strongly recommended. Note: 78 Unit LPCC and LPCC/MFT combined track students. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "222",
                "title": "Advanced Group Counseling Seminar",
                "description": "This seminar is for students who completed 219A and are seeking to supplement their understanding and knowledge of group therapy. Prerequisites: 219A.Requirements: 78 Unit LPCC and MFT/LPCC combined Track students only. NOTE: This seminar will only be offered 1 time in 2012 and 2013 and then be discontinued. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "227",
                "title": "Counseling Process and Skills",
                "description": "Intensive focus on the development of individual counseling skills through readings, discussion, experiential exercises, and feedback on skill development. Reviews of videotaped interviews enhance self-observation skills and understanding of therapeutic process. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "228",
                "title": "Advanced Counseling Process and Skills",
                "description": "An intensive skill-building class presenting an integrative model of individual therapy. Theory and interventions are based on process experiential (Emotion-Focused Therapy) and interpersonal (Time-Limited Dynamic, Control Mastery) approaches. The class offers students opportunities to (a) learn and practice strategies and techniques for working with process dimensions of therapy, (b) learn a wide range of therapy markers and the specific interventions recommended for each of them, (c) gain experience as counselors in supervised therapy mini-sessions, (d) practice advanced therapy skills during class, and (e) receive extensive feedback on their counseling skills. The class is particularly useful for students just before or during their practicum experience. Prerequisites: 200, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "230",
                "title": "Psychotherapy with Lesbian, Gay, and Bisexual Clients",
                "description": "The focus of this course is the development of clinical skills and interventions to work with issues presented by lesbian, gay, and bisexual clients. Therapeutic concerns of individuals, couples and families will be explored through readings, discussions, experiential exercises, and feedback on skill development. Prerequisite: 213. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "231",
                "title": "Multicultural Counseling",
                "description": "This class addresses the evaluation of the various models of psychotherapy as they relate to diverse populations and the influence of the mores and values of various ethnically and culturally diverse populations upon the counseling process. Within-group differences associated with culture, acculturation, and identity development are explored in depth. Self-exploration of racial/ethnic perceptions, attitudes, and experiences, as well as perceptions of gender, privilege, SES, class, and other issues. Review and evaluation of contemporary examples of multicultural research. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "243",
                "title": "Delinquent, At-Risk, and Nonconventional Youth: Trauma and Effects",
                "description": "Concepts and characteristics of child and adolescent delinquency, including the effects of trauma, violence and abuse; gangs; substance abuse;teenage parenthood; and dropout, anti-social, and nonconventional behavior. Introduction to the treatment of these issues, including correctional education, special education, juvenile justice, and social welfare systems as well as effective practices for counselors, including crisis, safety, and weapons management among others. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "244",
                "title": "Correctional Psychology",
                "description": "Principles and procedures of correctional psychology and correctional education, including current research on best practices. Discussion of pro-social development and skills, functional assessment and curriculum, correctional psychology, criminal justice, vocational programs, aggression reduction, prejudice reduction, life skills training, comprehensive systems, and treatment planning. Examination of therapeutic approaches and model programs. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "245",
                "title": "Transitional Treatment and Vocational Planning",
                "description": "Program planning, treatment planning, effective transitions, and vocational planning for delinquent, at-risk, and nonconventional youth. Coordinating planning, existing processes (IEP, IFSP, ILP, ITP), and promoting future success. Functional assessment and intervention, program identification, placement, and support. Vocational education programs, training options, assessment, and instruments. Job development, recruiting, placement, and support. Impact of disability, criminality, lifestyle, and cognitive distortion. Thinking processes, distortions, and retraining. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "246",
                "title": "Applied Behavior Analysis in Correctional Psychology",
                "description": "Principles and procedures of applied behavior analysis with applications to the correctional setting. Strategies for managing behavior problems. Assessment, documentation, and intervention for disruptive, aggressive, antisocial, and self-injurious behaviors. Primary emphasis on behavioral therapies with antisocial persons. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "264",
                "title": "Object-Relations Therapy",
                "description": "An introduction to the central ideas and processes involved in the object-relations approach to psychotherapy. Critical concepts such as projective identification, transference/countertransference, the holding environment, internal objects, transitional phenomena, the therapeutic matrix, etc. are explored and practiced. Readings from the British school (Klein, Winnicott) and American (Ogden) are blended with clinical practice and discussion. Prerequisites: 200, 212, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "265",
                "title": "Cognitive Behavior Therapy",
                "description": "This course provides a \"hands-on\" approach to understanding the basic tenets of cognitive behavioral therapy (CBT). Beginning with a comprehensive review of the fundamental concepts and research supporting CBT, students will learn about and practice cognitive behavioral therapy through didactic lectures, experiential learning, readings, group discussion, videos, and role plays. A primary focus in this class is practical applications of CBT, including relaxation training, activity scheduling, and development of treatment plans for diverse populations. Prerequisites: 200, 218; 214 recommended. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "266",
                "title": "Counseling the Adolescent",
                "description": "The adolescent as studied from developmental, sociological, and psychological perspectives, with special emphasis on counseling strategies and action techniques appropriate to this critical transition age. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "275",
                "title": "Ethical and Legal Issues in Counseling",
                "description": "Study of professional, legal, and ethical issues that emerge in marriage and family counseling, psychotherapy, and private practice; understanding values as a method of critical thinking and behavioral analysis. Students confront such issues as confidentiality, clients' rights, mediation, as well as child, spousal/partner, and elder abuse. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "276",
                "title": "Professional Orientation, Ethics, and Law in Counseling",
                "description": "Study of licensing law and process, regulatory laws that delineate the profession's scope of practice, strategies for collaboration, and advocacy processes needed to address institutional and social barriers that impede access, equity, and success for clients. Prerequisites: 200, 218, 275. (1.5 units).",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "280",
                "title": "Psychology of Aging and the Family",
                "description": "An overview of the research on adult development, with an emphasis on large-sample longitudinal studies. Concepts and definitions of adulthood are explored. Primary emphasis is on the clinical utility and integration of stages of adulthood and both their empirical parameters and those presented in the world's great mythologies and contemplative traditions. Focus on identification and assistance with the transitional challenges of middle and late adulthood. Finally, theories of aging and issues that concern the elderly; dynamics and complexity of intergenerational families; social responses to aging and concerns of the extended family are integrated into practical counseling models for individual, family, and group therapy. Prerequisite: 200 and 216. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "282",
                "title": "Gestalt Therapy for Individuals and Couples",
                "description": "The theory and techniques of Fritz Perls and the Gestalt school. Emphasis on applications to family, individual, and couple counseling. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "288",
                "title": "Existential Psychotherapy",
                "description": "Among the major theories of psychotherapy, Existential Psychotherapy holds a place that both blends with other approaches and stands distinctly apart. Focused on the personal experience of meaning, this form of psychotherapy explores the inner world as the client creates it. Beginning with the thinking of Viktor Frankl, the course focuses primarily on the American approaches to existential therapy. Constructs employed include the centrality of choice, the tension between the fear of the unknown (freedom) and the stagnation of the status quo (security), the salience of the here-and-now experience of self and the therapist use of self. Although a theory class, significant portions of the class are clinical and pragmatic; exploring existential psychotherapy in film, demonstration and experimentation. Prerequisites: 15 units including CPSY 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "291",
                "title": "Counseling for Grief, Loss and Trauma",
                "description": "Explores psychological issues and skills in counseling people coping with loss, grief, and life-threatening illness, and other traumatic circumstances. Topics include: current theory and research on coping with and resilience to grief, loss, and trauma; assessment and therapeutic interventions with individuals and families; cultural and spiritual dimensions; the evolving philosophy and practice of hospice and palliative care; stress management for the therapist. The applicability of these concepts and skills to everyday psychotherapy practice is emphasized. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "298",
                "title": "Psychology and Spirituality",
                "description": "A comparative study of various Eastern and Western themes and schools of spirituality. In-depth exploration of the implications and relationship of these views to counseling psychology. The nature of the human person and criteria for assessing a person's spiritual-psychological health and growth; stages of development; teachings on how to guide or work with another; and views on such themes as authentic love, humility, guilt, and discernment. Prerequisite: 200. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "300",
                "title": "Career Development and Life Planning",
                "description": "Overview of the career development field, focusing on current career development and decision theory. Applications of theory across various settings (industry, clinics, schools, rehabilitation, etc.). Exploration of changing concepts of work and career. Examination of the meaning and spirituality of work, and of \"calling,\" conscious life planning and lifestyle choices. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "302",
                "title": "Formal and Informal Assessment in Career Development",
                "description": "Familiarity with, and use of, current career assessment instrumentation. Evaluation of leading instruments; selection criteria governing use of instruments according to client needs. Interpretation of individual and group assessment data. Practice in completing the career counseling interview, including appropriate assessment and interpretation. Course includes an approved, individualized, formal career assessment to be completed either prior to or concurrent with 302. Prerequisite: 300. Recommended: 318. (3 units)Note: Required for 90 unit LPCC or LPCC/MFT Track only.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "307",
                "title": "Career Counseling Seminar",
                "description": "This course examines special issues in career counseling with special attention on working with multicultural populations, disabled populations, and the Americans with Disability Act. Requirements: 78 Unit LPCC Track students only; Prerequisites: 300. (1.5 units) This course will be discontinued after Spring of 2014.",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "308",
                "title": "Counseling for Crises, Emergencies, and Disasters",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "309",
                "title": "Treating Complex Trauma: Theory and Practice",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "310",
                "title": "Independent Study",
                "description": "Supervised course of study initiated by the student. A written proposal and course syllabus must be submitted to the Graduate Services Office by the end of the first week of the term in which the course will be conducted. The proposal must be approved with signatures from the faculty member of record and the Department Chair.NOTE: Only Full-time faculty members may direct an independent study. (1-6 units)",
                "units": "1-6 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "311",
                "title": "Psychology of Marriage Counseling",
                "description": "Introduction to methods, theories, and techniques of premarital, marital, sexual, and divorce counseling. Initial focus is on normal relational development, followed by characteristic methods of intervention with relationship difficulties in a primary dyadic relationship. Couple relationships within the cultures most common in California are explored and integrated with the more generic foci. This class includes considerable media and experiential components. Prerequisites: 200, 212, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "312",
                "title": "Counseling for Contemporary Problems I",
                "description": "Research, assessment, crisis intervention, and counseling methodology used in addressing the problems of child abuse, domestic violence, substance abuse and addiction. Provides an overview of the psychosocial factors and dynamics involved in the etiology and maintenance of these problems. Describes specific skills and interventions and related considerations used in dealing with clients, their families, and involved community agencies and resources. Prerequisites:227. (3 units) NOTE: This course will be discontinued after Winter quarter 2014.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "313",
                "title": "Contemporary Issues in Psychotherapy II",
                "description": "This course examines special issues related to psychotherapy, including diagnosing and reporting child abuse, spousal abuse, elder abuse, and abuse of the disabled, as well as crises and trauma management and interventions. Prerequisites: 227. (3 units)NOTE: 78 unit degree: LPCC and MFT/LPCC Combined Track students only. 90 unit degree: All students. Students taking this course are exempt from 312A, but must take 15 hours of CEU's in Substance Abuse through CPD. This course will be discontinued after Spring of 2014.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "315",
                "title": "Family Therapy",
                "description": "Introduction to systems theory (e.g., Structural, Bowenian, Strategic) and procedures appropriate to working with families. Opportunity to practice counseling with simulated families. Prerequisites: 200, 212, 218 and 227. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "317",
                "title": "Therapeutic Interventions with Children",
                "description": "A broad range of therapeutic interventions with children and families are presented, with a particular focus on play therapy. Case conceptualization, diagnostic formulation, and issues related to treatment planning are addressed. The influence of class, culture and ethnicity on the assessment/treatment process is explored. Prerequisite: 200, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "318",
                "title": "Clinical Assessment I",
                "description": "Study of the therapeutic decision-making process in the context of psychopathology and the clinical setting. Emphasis on the recognition, classification, and understanding of abnormal behavior. Traditional DSM diagnostic categories are studied, including mood disorders, anxiety disorders, psychosis, affective disorders, psycho­physchological disorders, and other abnormal lifestyle patterns. Prerequisites: 200, 212, 216 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "319",
                "title": "Clinical Assessment II",
                "description": "Emphasis on diagnosis and clinical judgment, including such issues as type of impairment, degree of impairment, predictability, and treatment plan, as well as sources of error judgment and how these errors are minimized. The use of individual, couple, and family assessment techniques, projective tests, personality inventories, and other instruments in a professional setting. Prerequisites: 318. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "320",
                "title": "Substance Abuse Treatment",
                "description": "This class focuses on substances that are abused, the effect on the abuser, and treatment strategies in both individual and group psychotherapy modalities. Included are various clinical approaches to treatment; coordination of treatment with 12‐step programs; co‐occurrence of substance use with other disorders; understanding the stages of recovery; and working with adolescents. (3 units)Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "321",
                "title": "Dual Diagnosis: Diagnosis and Treatment",
                "description": "This class covers the complexities and interactions in the diagnosing and treatment of Axis I and Axis II disorders in the presence of substance abuse. Prerequisite: None. (1.5 Units)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "323",
                "title": "Psychopharmacology",
                "description": "This is an introductory course designed for those without biological or medical training to provide a firm basis in practical neurophysiology and psychopharmacology. Course foci include the structure and functions of the nervous system, interactions of other organ systems, principles of pharmacodynamics and pharmacokinetics. The material is presented from a clinical orientation with illustrative case examples. Boundaries of practice and practical issues of assessment and referral are covered in depth. Prerequisites: 216, 218, 318. Can be taken concurrently with practicum. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "324",
                "title": "Biological Basis for Development",
                "description": "This course examines the biological basis for neonatal to early childhood development and behavior. Emphasis is placed on an understanding of the positive and negative effects of environment on early brain development and their sequalae in later life, including development and behavior in adolescence, adulthood and old age. Prerequisites: 216 and 218.NOTE: This course was previously listed as 223. (1.5 units)",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "328",
                "title": "Clinical Assessment: Issues in Child Diagnosis",
                "description": "Study of diagnostic issues in working with pediatric psychiatric disorders. Emphasis on DSM diagnostic criteria and interviewing children, parents, and families. Special attention to developmental disorders affecting later stages of maturation. Requirements: 78 Unit LPCC and MFT/LPCC Combined Track students and all 90 Unit students. Prerequisites: 200, 212, 216, 218, and 318. (1.5 units)NOTE: This course was previously numbered 318A.",
                "units": "1.5 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331A",
                "title": "Counseling Practicum: Agency",
                "description": "Supervised counseling experiences in community services such as juvenile probation, mental health, community colleges, etc. To be taken in the second half of the counseling program, after completion of the counseling core. Weekly seminars for consultation and discussion with a supervisor on such topics as case management and evaluation, referral procedures, ethical practices, professional and client interaction, confidential communication, and inter-professional ethical considerations. By permission only; must begin in fall quarter. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331A is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes; 311, 315, 317, and 318. (3 units per term; 6 units required)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331C",
                "title": "Counseling Practicum: Career Development",
                "description": "To culminate their emphasis program, students spend 15 hours per week engaged in supervised career development-related fieldwork at a practicum site. By permission only; must begin in fall quarter. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331C is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes; 300, 301, 302, 303, and 304. (3 units) NOTE: This practicum will be discontinued after Spring 2013.",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331H",
                "title": "Counseling Practicum: Health Psychology",
                "description": "Counseling experience in health psychology. At a practicum site, students engage in health psychology-related work (e.g., research, counseling, health promotion). By permission; fall quarter only. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331H is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes and permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "331L",
                "title": "Counseling Practicum: Latino/a Counseling",
                "description": "At a practicum site, students engage in Latino/ counseling-related work. By permission; fall quarter only. Arrangements with site must be made before the beginning of fall quarter. Enrollment of 331L is typically very small. Meetings with professor are individual and ongoing. Prerequisites: Nine core classes and permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "332",
                "title": "Psychotherapy with Transgender and Non-binary Clients",
                "description": "In this course, students will develop clinical skills to work effectively with Transgender/Gender Nonconforming, Intersex, Genderqueer clients, and with others exploring alternative expressions of gender and sexuality. Readings, discussions, experiential exercises, case studies, and feedback on skill development will be components of this class. Prerequisite: 213. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "333",
                "title": "Counseling Practicum",
                "description": "Supervised counseling experience designed specifically to meet California MFT and LPCC licensing requirements. Weekly seminars for consultation and discussion with a licensed supervisor on such topics as case management and evaluation, systems of care, community resources, advocacy issues, referral procedures, ethical practices, professional and client interaction, confidential communication, and documentation, among other issues. Prerequisites: Nine core classes; 311, 315, 317, 318, 319, and permission of instructor. Must begin in fall quarter. (3 units per term; 9 units required)",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "351",
                "title": "Advanced Seminar in Family Therapy",
                "description": "For students who have completed CPSY 312, 315, and 317 and wish to participate in advanced training in brief family therapy. Students will receive intensive training in conducting strength-based parent counseling (C.A.R.E. Parent Therapy). In addition, students will have the opportunity to conduct brief counseling with a parent(s) at a local community clinic. Recommended for students interested in family and child therapy, and short term approaches to treatment. Prerequisites: 218, 315. Recommended: 215 or 317. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "352",
                "title": "Gender and Counseling Psychology",
                "description": "",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "360",
                "title": "Latino/a Psychology",
                "description": "Designed to enhance the knowledge and skill components of their multicultural training (CSPY 231), with a specific focus on Latino/a cultures. An overview is offered of the Latinx experience within a socio-political and psycho-social context, and implications for therapeutic interventions are explored. Topics covered include: culture and personality, acculturation and ethnic self-identification, gender role socialization, influence of family and other systems, educational achievement, religion and spirituality, traditional healing practices, immigration and diversity within the Latinx population. Prerequisite: 231. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "361",
                "title": "Special Topics in Multicultural Psychotherapy",
                "description": "This course examines the special topic in multicultural counseling.NOTE: 78 Unit LPCC and MFT/LPCC combined track students and all 90 Unit students",
                "units": ""
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "362",
                "title": "Individual Counseling Skills with Latino/a Clients",
                "description": "Development of counseling skills within a cultural context. An examination is provided of how the counseling process is affected by cultural dynamics and counselor/client variables. Students will learn how to use cultural variables to help develop empathy and a strong working alliance with Latino/a clients. Discussion, demonstration and application of various therapeutic and treatment approaches. Feedback and supervision provided for specific skill development. Prerequisite: 200. Recommended: 231. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "364",
                "title": "Interventions with Latino/a Families and Children",
                "description": "Offers specific information on \"therapy techniques\" with Latino/a family members. The importance of setting for the \"therapy\" is examined. An enhanced understanding is proffered of common experiences Latino families have with various systems of care including schools, hospitals, community mental health agencies, and social service agencies. Within this framework, applied therapy techniques for children and families are examined. A strength-based, systems approach will be used to guide our discussions. Prerequisite: 200. Recommended: 231 and 360. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "366",
                "title": "Spanish-Based Interviewing and Assessment",
                "description": "Course conducted completely in Spanish. Emphasis will be placed on conducting client interviews, assessments, making recommendations, and providing instructions in Spanish. Use of advanced-level Spanish in job/field-related language contexts. Discussion of field-related articles and theories. Prerequisite: 200 and fluency in Spanish. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "380",
                "title": "Positive Psychology and Health",
                "description": "Introduction to \"Positive Psychology and Health,\" the empirical study of what leads humans to develop and flourish. Introduces theory, research and applications, exploring the implications of positive psychology for our understanding of health and illness. Topics include: What is health? Wholeness? Wellness? What makes people happy? How do you help people not merely survive, but thrive? How do we foster stress-related growth? What is the role of spirituality in health? What are positive psychological interventions? Students are encouraged to think critically about what it means to be healthy, and to reflect on personal experiences related to health and illness. Prerequisites: 200 and 218. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "381",
                "title": "Health Psychology: Theory and Practice",
                "description": "Introduction to health psychology theory, research, and practice, with a special focus on health promotion and health behavior change. Topics include: models of health and illness; biopsychosocial factors in illness; personality, health, and coping; social support and health; health assessment; models and strategies for health behavior change, including Prochaska's stage model and motivational interviewing; issues and preventions with specific health behaviors; and health promotion in the workplace and other settings. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "385",
                "title": "Stress and Stress Management",
                "description": "Introduction to conceptual models of chronic stress in home, work, and community environments. Particular attention to methods and programs to assess, as well as alter, chronic stress. Emphasis is placed on the bio/psycho/ social factors in the etiology, maintenance, and modification of stress. Intervention methods are demonstrated and practiced. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "388",
                "title": "Mindfulness and Psychotherapy: Theory, Research and Practice",
                "description": "This course will focus on the construct of mindfulness and its applications to psychotherapy. An experiential and academic understanding of mindfulness will be emphasized. The experiential component will involve training in meditation and mindfulness practices. The academic component will involve rigorous examination of current research on the applications of mindfulness in health care, as well as exploration of current theories of mindfulness and its applications to clinical work. The intention of the course is to help students better understand the construct of mindfulness and how it can be applied in clinical practice as a technique for clients, a theoretical frame for therapists, and as a means of enhancing therapist skills, for example, empathy and attention. A final intention is for students to explore the potential benefits of mindfulness for their own self-care and self-inquiry. Prerequisite: None (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "389",
                "title": "Advanced Group Counseling",
                "description": "For students who have completed 219 and wish advanced training in group leadership procedures. This class focuses on practices of group therapy, and on the complexities of parallel process and the transference/ counter transference issues in groups. Both practical and academic approaches are taken; each student applies classroom learning to an ongoing group process situation. Extensive use of videotape, role-playing, and hands-on practice. The class includes a required one-day \"marathon\" group session. Recommended for students who expect to do group counseling and therapy in their post-master's employment. Prerequisites: 200, 218, 219, 221; P/NP. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "390",
                "title": "Advanced Seminar in Couples Therapy",
                "description": "Specifically designed to help students conceptualize and plan treatment for couples. Stress on issues of structured and non-structured interviewing, transference and counter transference, and family of origin. Normally the class views and examines a \"live case\" or case scenarios through the term and/or class participation in problem-solving couples' difficulties and extensive case examples and role playing. Examination of divorce issues and alternative lifestyles. Prerequisites: 212, 227 and 311. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "391",
                "title": "Hypnotic Techniques in Counseling and Therapy",
                "description": "Introduction to hypnotherapeutic techniques in the therapy context. Students learn to induce trance states and the appropriate application of these for therapeutic purposes. Emphasizes ethical utilization in both traditional and indirect hypnosis. The use of hypnosis as a part of psychotherapy is explored in depth. A clinically oriented course; research and literature are used to support the clinical application of hypnosis for such issues as pain control, memory retrieval, anesthesia, habit control, and direct therapy. Prerequisites: 15 hours completed, must include 227. Usually taken on a pass/ fail basis. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "395",
                "title": "Advanced Object Relations Seminar: Clinical Techniques",
                "description": "Advanced skill building. Course addresses technique-related topics relevant to the growth and development of the skilled Object Relations therapist. Course focuses in depth on different topics during different terms. Topics range from developing a clinical stance, to uses of interpretation, working in the transference, working with countertransference and projective identification, working with frame issues, working with the schizoid patient, working with the narcissistic patient, the technical Winnicott, the technique papers of Freud, etc. Course will include relevant readings, presentations of case material, and experiential clinical practice. Prerequisite: 200, 212, 216, 218, 264 or permission of instructor. (3 units)",
                "units": "3 units"
            },
            {
                "abbr": "CPSY",
                "type": "Graduate",
                "id": "399",
                "title": "Thesis",
                "description": "Optional course; usually selected by candidates preparing for doctoral studies. The thesis should concern a recognized problem in the student's field of specialization, should make a scholarly contribution to the extant body of knowledge in this area, and should review the principal sources of knowledge. Format should follow the guidelines established by the American Psychological Association. Supervision and review of the thesis provided by faculty member(s) designated by the chair of the Department of Counseling Psychology. Students may replace the Comprehensive Examination with completion of an approved thesis. Requirements for thesis submission are negotiated with the thesis faculty director. (1-6 units)",
                "units": "1-6 units"
            }
        ],
        "abbr": [
            "CPSY"
        ]
    }
]
